[
  {
    "course_instance_id": "BIOE 100 Undergraduate Open Seminar A1 70346",
    "course_id": "BIOE 100",
    "course_number": 100,
    "subject": "BIOE",
    "title": "Undergraduate Open Seminar",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "A1",
    "crn": 70346,
    "credit_hours": 1,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Bioengineering Seminar provides a broad introduction to the field, practice, and curriculum of Bioengineering. The major goals are for students to (1) meet the department faculty, (2) understand the curriculum and the 4-year goals, (3) understand and apply technologies central to the field through individual and group projects, (4) begin independent explorations into technologies in the field, and (5) practice teamwork, technical writing, and presentation. The course is designed for first-year Bioengineering majors.",
    "prerequisites": null,
    "admin_notes": null,
    "topics": [
      "Bioengineering Seminar provides a broad introduction to the field, practice, and curriculum of Bioengineering",
      "The major goals are for students to (1) meet the department faculty, (2) understand the curriculum and the 4-year goals, (3) understand and apply technologies central to the field through individual and group projects, (4) begin independent explorations into technologies in the field, and (5) practice teamwork, technical writing, and presentation",
      "The course is designed for first-year Bioengineering majors"
    ],
    "embedding_text": "BIOE 100 Undergraduate Open Seminar. Bioengineering Seminar provides a broad introduction to the field, practice, and curriculum of Bioengineering. The major goals are for students to (1) meet the department faculty, (2) understand the curriculum and the 4-year goals, (3) understand and apply technologies central to the field through individual and group projects, (4) begin independent explorations into technologies in the field, and (5) practice teamwork, technical writing, and presentation. The course is designed for first-year Bioengineering majors."
  },
  {
    "course_instance_id": "BIOE 120 Introduction to Bioengineering 100 45137",
    "course_id": "BIOE 120",
    "course_number": 120,
    "subject": "BIOE",
    "title": "Introduction to Bioengineering",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "100",
    "crn": 45137,
    "credit_hours": 1,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Lectures and discussions of recent trends in bioengineering; topics typically include biological interaction with ultrasound and microwave radiation, modeling, instrumentation, biomaterials, biomechanics, biological heat and mass transfer, and medical imaging techniques.",
    "prerequisites": null,
    "admin_notes": "This section is for non-Bioengineering majors.",
    "topics": [
      "Lectures and discussions of recent trends in bioengineering",
      "topics typically include biological interaction with ultrasound and microwave radiation, modeling, instrumentation, biomaterials, biomechanics, biological heat and mass transfer, and medical imaging techniques"
    ],
    "embedding_text": "BIOE 120 Introduction to Bioengineering. Lectures and discussions of recent trends in bioengineering; topics typically include biological interaction with ultrasound and microwave radiation, modeling, instrumentation, biomaterials, biomechanics, biological heat and mass transfer, and medical imaging techniques."
  },
  {
    "course_instance_id": "BIOE 199 Frontiers in Cancer Research FCR 63911",
    "course_id": "BIOE 199",
    "course_number": 199,
    "subject": "BIOE",
    "title": "Frontiers in Cancer Research",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "FCR",
    "crn": 63911,
    "credit_hours": 1,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": null,
    "prerequisites": null,
    "admin_notes": "May be repeated.",
    "topics": null,
    "embedding_text": "BIOE 199 Frontiers in Cancer Research."
  },
  {
    "course_instance_id": "BIOE 201 Conservation Principles Bioeng AL1 48270",
    "course_id": "BIOE 201",
    "course_number": 201,
    "subject": "BIOE",
    "title": "Conservation Principles Bioeng",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "AL1",
    "crn": 48270,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Material, energy, charge, and momentum balances in biological problems. Steady-state and transient conservation equations for mass, energy, charge, and momentum will be derived and applied to mathematically analyze physiological systems using basic mathematical principles, physical laws, stoichiometry, and thermodynamic properties.",
    "prerequisites": "CHEM 104, MCB 150, and PHYS 211",
    "admin_notes": "Prerequisite: CHEM 104, MCB 150, and PHYS 211. Seats will be released to non-majors who meet prerequisites on July 21. Some seats will remain held for majors through the 10th day of class.",
    "topics": [
      "Material, energy, charge, and momentum balances in biological problems",
      "Steady-state and transient conservation equations for mass, energy, charge, and momentum will be derived and applied to mathematically analyze physiological systems using basic mathematical principles, physical laws, stoichiometry, and thermodynamic properties"
    ],
    "embedding_text": "BIOE 201 Conservation Principles Bioeng. Material, energy, charge, and momentum balances in biological problems. Steady-state and transient conservation equations for mass, energy, charge, and momentum will be derived and applied to mathematically analyze physiological systems using basic mathematical principles, physical laws, stoichiometry, and thermodynamic properties. Prerequisite: CHEM 104, MCB 150, and PHYS 211."
  },
  {
    "course_instance_id": "BIOE 202 Cell & Tissue Engineering Lab AB1 49685",
    "course_id": "BIOE 202",
    "course_number": 202,
    "subject": "BIOE",
    "title": "Cell & Tissue Engineering Lab",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Laboratory",
    "section_number": "AB1",
    "crn": 49685,
    "credit_hours": 2,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Principles of cell biology inherent in tissue engineering design. Lab experience in safely and skillfully manipulating cells of the four tissue types and performing various quantitative analyses on products produced by cells that have differentiated.",
    "prerequisites": "MCB 150, and credit or concurrent enrollment in BIOE 206",
    "admin_notes": "Prerequisite: MCB 150, and credit or concurrent enrollment in BIOE 206.",
    "topics": [
      "Principles of cell biology inherent in tissue engineering design",
      "Lab experience in safely and skillfully manipulating cells of the four tissue types and performing various quantitative analyses on products produced by cells that have differentiated"
    ],
    "embedding_text": "BIOE 202 Cell & Tissue Engineering Lab. Principles of cell biology inherent in tissue engineering design. Lab experience in safely and skillfully manipulating cells of the four tissue types and performing various quantitative analyses on products produced by cells that have differentiated. Prerequisite: MCB 150, and credit or concurrent enrollment in BIOE 206."
  },
  {
    "course_instance_id": "BIOE 205 Signals & Systems in Bioengrg AD1 51650",
    "course_id": "BIOE 205",
    "course_number": 205,
    "subject": "BIOE",
    "title": "Signals & Systems in Bioengrg",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Discussion/Recitation",
    "section_number": "AD1",
    "crn": 51650,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Introduction to signals and linear systems with examples from biology and medicine. Linear systems and mathematical models of systems, including differential equations, convolution, Laplace transforms, Fourier series and transforms, and discrete representations. Class examples and coursework apply general techniques to problems in biological signal analysis, including circuits, enzyme kinematics, and physiological system analysis. Use of Matlab and Simulink software to understand more complex systems.",
    "prerequisites": "CS 101 or CS 124, PHYS 212, and credit or concurrent registration in MATH 285",
    "admin_notes": "Prerequisite: CS 101 or CS 124, PHYS 212, and credit or concurrent registration in MATH 285.",
    "topics": [
      "Introduction to signals and linear systems with examples from biology and medicine",
      "Linear systems and mathematical models of systems, including differential equations, convolution, Laplace transforms, Fourier series and transforms, and discrete representations",
      "Class examples and coursework apply general techniques to problems in biological signal analysis, including circuits, enzyme kinematics, and physiological system analysis",
      "Use of Matlab and Simulink software to understand more complex systems"
    ],
    "embedding_text": "BIOE 205 Signals & Systems in Bioengrg. Introduction to signals and linear systems with examples from biology and medicine. Linear systems and mathematical models of systems, including differential equations, convolution, Laplace transforms, Fourier series and transforms, and discrete representations. Class examples and coursework apply general techniques to problems in biological signal analysis, including circuits, enzyme kinematics, and physiological system analysis. Use of Matlab and Simulink software to understand more complex systems. Prerequisite: CS 101 or CS 124, PHYS 212, and credit or concurrent registration in MATH 285."
  },
  {
    "course_instance_id": "BIOE 206 Cellular Bioengineering ALR 58750",
    "course_id": "BIOE 206",
    "course_number": 206,
    "subject": "BIOE",
    "title": "Cellular Bioengineering",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "ALR",
    "crn": 58750,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Molecular and cellular biology focusing on instrumentation and measurement techniques: gene expression, translation, and regulation; cellular energetics and enzyme kinetics; membrane transport and cell signaling; cytoskeleton and the cell cycle; cell biology fundamentals emphasizing modern imaging and measurement systems to quantify cellular function.",
    "prerequisites": "MCB 150",
    "admin_notes": "Credit is not given for both BIOE 206 and MCB 252. Prerequisite: MCB 150. Seats will be released to non-majors who meet prerequisites on July 21. Some seats will remain held for majors through the 10th day of class.",
    "topics": [
      "Molecular and cellular biology focusing on instrumentation and measurement techniques: gene expression, translation, and regulation",
      "cellular energetics and enzyme kinetics",
      "membrane transport and cell signaling",
      "cytoskeleton and the cell cycle",
      "cell biology fundamentals emphasizing modern imaging and measurement systems to quantify cellular function"
    ],
    "embedding_text": "BIOE 206 Cellular Bioengineering. Molecular and cellular biology focusing on instrumentation and measurement techniques: gene expression, translation, and regulation; cellular energetics and enzyme kinetics; membrane transport and cell signaling; cytoskeleton and the cell cycle; cell biology fundamentals emphasizing modern imaging and measurement systems to quantify cellular function. Prerequisite: MCB 150."
  },
  {
    "course_instance_id": "BIOE 210 Linear Alg for Biomed Data Sci NE1 79296",
    "course_id": "BIOE 210",
    "course_number": 210,
    "subject": "BIOE",
    "title": "Linear Alg for Biomed Data Sci",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "NE1",
    "crn": 79296,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Using analytical and computational tools from linear algebra, students will Solve large systems of linear equations, systems of linear ODEs, and linear PDEs; Analyze large, multivariable datasets to quantify relationships between variables; Decompose complex datasets into simpler representations; Introduce and solve common problems in classification, image processing, and machine learning; Develop a geometric understanding of high-dimensional spaces.",
    "prerequisites": "CS 101 or CS 124, and MATH 231",
    "admin_notes": "Prerequisite: CS 101 or CS 124, and MATH 231.",
    "topics": [
      "Using analytical and computational tools from linear algebra, students will Solve large systems of linear equations, systems of linear ODEs, and linear PDEs",
      "Analyze large, multivariable datasets to quantify relationships between variables",
      "Decompose complex datasets into simpler representations",
      "Introduce and solve common problems in classification, image processing, and machine learning",
      "Develop a geometric understanding of high-dimensional spaces"
    ],
    "embedding_text": "BIOE 210 Linear Alg for Biomed Data Sci. Using analytical and computational tools from linear algebra, students will Solve large systems of linear equations, systems of linear ODEs, and linear PDEs; Analyze large, multivariable datasets to quantify relationships between variables; Decompose complex datasets into simpler representations; Introduce and solve common problems in classification, image processing, and machine learning; Develop a geometric understanding of high-dimensional spaces. Prerequisite: CS 101 or CS 124, and MATH 231."
  },
  {
    "course_instance_id": "BIOE 297 Individual Study 0 47929",
    "course_id": "BIOE 297",
    "course_number": 297,
    "subject": "BIOE",
    "title": "Individual Study",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Independent Study",
    "section_number": "0",
    "crn": 47929,
    "credit_hours": 1,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Special project or reading activity.",
    "prerequisites": "Approved written application to department as specified by department or instructor",
    "admin_notes": "May be repeated in the same or separate terms to a maximum of 12 hours. Prerequisite: Approved written application to department as specified by department or instructor.",
    "topics": [
      "Special project or reading activity"
    ],
    "embedding_text": "BIOE 297 Individual Study. Special project or reading activity. Prerequisite: Approved written application to department as specified by department or instructor."
  },
  {
    "course_instance_id": "BIOE 298 Healthcare Innovation & Trans HIT 65183",
    "course_id": "BIOE 298",
    "course_number": 298,
    "subject": "BIOE",
    "title": "Healthcare Innovation & Trans",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "HIT",
    "crn": 65183,
    "credit_hours": 1,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Subject offerings of new and developing areas of knowledge in bioengineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites.",
    "prerequisites": null,
    "admin_notes": "May be repeated to a maximum of 8 hours, if topics vary.",
    "topics": [
      "Subject offerings of new and developing areas of knowledge in bioengineering intended to augment the existing curriculum",
      "See Class Schedule or departmental course information for topics and prerequisites"
    ],
    "embedding_text": "BIOE 298 Healthcare Innovation & Trans. Subject offerings of new and developing areas of knowledge in bioengineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites."
  },
  {
    "course_instance_id": "BIOE 302 Modeling Human Physiology AL1 66323",
    "course_id": "BIOE 302",
    "course_number": 302,
    "subject": "BIOE",
    "title": "Modeling Human Physiology",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "AL1",
    "crn": 66323,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Description, quantification, and modeling of human physiological systems, based on systems fundamentals. Components, relationships, and homeostatic controls of neural, musculoskeletal, respiratory, cardiovascular, endocrine, digestion, and renal-filtration systems. Application of mathematical modeling and MATLAB simulation to further understanding of the systems and relate physiological consequences to changes in environment or component function.",
    "prerequisites": "BIOE 205 and one of MCB 252 or BIOE 206",
    "admin_notes": "Prerequisite: BIOE 205 and one of MCB 252 or BIOE 206. Seats will be released to non-majors who meet prerequisites on July 21. Some seats will remain held for majors through the 10th day of class.",
    "topics": [
      "Description, quantification, and modeling of human physiological systems, based on systems fundamentals",
      "Components, relationships, and homeostatic controls of neural, musculoskeletal, respiratory, cardiovascular, endocrine, digestion, and renal-filtration systems",
      "Application of mathematical modeling and MATLAB simulation to further understanding of the systems and relate physiological consequences to changes in environment or component function"
    ],
    "embedding_text": "BIOE 302 Modeling Human Physiology. Description, quantification, and modeling of human physiological systems, based on systems fundamentals. Components, relationships, and homeostatic controls of neural, musculoskeletal, respiratory, cardiovascular, endocrine, digestion, and renal-filtration systems. Application of mathematical modeling and MATLAB simulation to further understanding of the systems and relate physiological consequences to changes in environment or component function. Prerequisite: BIOE 205 and one of MCB 252 or BIOE 206."
  },
  {
    "course_instance_id": "BIOE 303 Quantitative Physiology Lab AB1 66325",
    "course_id": "BIOE 303",
    "course_number": 303,
    "subject": "BIOE",
    "title": "Quantitative Physiology Lab",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Laboratory",
    "section_number": "AB1",
    "crn": 66325,
    "credit_hours": 2,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Experiments involving the modeling and measurement of animal and human physiology systems. Use of computer simulations to provide mathematical descriptions of physiology behavior. Calibration and validation of models through hands-on experiments. Focus on quantitative measurement of neural, cardiovascular, respiratory, muscular, and endocrine system functions.",
    "prerequisites": "Concurrent enrollment in BIOE 302 is allowed",
    "admin_notes": "Prerequisite: Concurrent enrollment in BIOE 302 is allowed. Class Schedule Information: Departmental approval required for non-majors.",
    "topics": [
      "Experiments involving the modeling and measurement of animal and human physiology systems",
      "Use of computer simulations to provide mathematical descriptions of physiology behavior",
      "Calibration and validation of models through hands-on experiments",
      "Focus on quantitative measurement of neural, cardiovascular, respiratory, muscular, and endocrine system functions"
    ],
    "embedding_text": "BIOE 303 Quantitative Physiology Lab. Experiments involving the modeling and measurement of animal and human physiology systems. Use of computer simulations to provide mathematical descriptions of physiology behavior. Calibration and validation of models through hands-on experiments. Focus on quantitative measurement of neural, cardiovascular, respiratory, muscular, and endocrine system functions. Prerequisite: Concurrent enrollment in BIOE 302 is allowed."
  },
  {
    "course_instance_id": "BIOE 310 Comp Tools Bio Data LEC 60965",
    "course_id": "BIOE 310",
    "course_number": 310,
    "subject": "BIOE",
    "title": "Comp Tools Bio Data",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "LEC",
    "crn": 60965,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Fundamental and applied statistics, including probability distributions, parameter estimation, descriptive statistics, hypothesis testing, and linear regression. Statistical methods in genomics including sequence analysis, gene expression data analysis, human genomic variation, regulatory genomics, and cancer genomics.",
    "prerequisites": "BIOE 210 or MATH 257",
    "admin_notes": "Credit is not given towards graduation for both BIOE 310 and IE 300. Prerequisite: BIOE 210 or MATH 257. Students in the BS-BIOE must take BIOE 210 as the prerequisite. Class Schedule Information: Departmental approval required for non-majors. Some seats will remain reserved for majors. Cohort and program-restricted seats will be released on December 3 to students within the Bioengineering department who meet the prerequisite requirements.",
    "topics": [
      "Fundamental and applied statistics, including probability distributions, parameter estimation, descriptive statistics, hypothesis testing, and linear regression",
      "Statistical methods in genomics including sequence analysis, gene expression data analysis, human genomic variation, regulatory genomics, and cancer genomics"
    ],
    "embedding_text": "BIOE 310 Comp Tools Bio Data. Fundamental and applied statistics, including probability distributions, parameter estimation, descriptive statistics, hypothesis testing, and linear regression. Statistical methods in genomics including sequence analysis, gene expression data analysis, human genomic variation, regulatory genomics, and cancer genomics. Prerequisite: BIOE 210 or MATH 257."
  },
  {
    "course_instance_id": "BIOE 360 Transport & Flow in Bioengrg LEC 60966",
    "course_id": "BIOE 360",
    "course_number": 360,
    "subject": "BIOE",
    "title": "Transport & Flow in Bioengrg",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "LEC",
    "crn": 60966,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Fundamentals of fluid dynamics and mass transport applied to analysis of biological systems. Quantitative understanding of microscopic to macroscopic phenomena in biological systems related to their sensing by imaging techniques. Molecular phenomena in both healthy tissue and disease using examples from cardiovascular problems and cancer using ultrasound, optical and MRI techniques.",
    "prerequisites": "BIOE 201 and MATH 285",
    "admin_notes": "Credit is not given for both BIOE 360 and any of CHBE 421, CHBE 451, or TAM 335. Prerequisite: BIOE 201 and MATH 285. Class Schedule Information: Departmental approval required for non-majors. Some seats will remain reserved for majors. Cohort and program-restricted seats will be released on December 3 to students within the Bioengineering department who meet the prerequisite requirements.",
    "topics": [
      "Fundamentals of fluid dynamics and mass transport applied to analysis of biological systems",
      "Quantitative understanding of microscopic to macroscopic phenomena in biological systems related to their sensing by imaging techniques",
      "Molecular phenomena in both healthy tissue and disease using examples from cardiovascular problems and cancer using ultrasound, optical and MRI techniques"
    ],
    "embedding_text": "BIOE 360 Transport & Flow in Bioengrg. Fundamentals of fluid dynamics and mass transport applied to analysis of biological systems. Quantitative understanding of microscopic to macroscopic phenomena in biological systems related to their sensing by imaging techniques. Molecular phenomena in both healthy tissue and disease using examples from cardiovascular problems and cancer using ultrasound, optical and MRI techniques. Prerequisite: BIOE 201 and MATH 285."
  },
  {
    "course_instance_id": "BIOE 380 Biomedical Imaging B 64641",
    "course_id": "BIOE 380",
    "course_number": 380,
    "subject": "BIOE",
    "title": "Biomedical Imaging",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "B",
    "crn": 64641,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Physics and engineering principles associated with x-ray, computed tomography, nuclear, ultrasound, magnetic resonance, and optical imaging, including human visualization and perception of image data. Same as  * HYPERLINK \"https://catalog.illinois.edu/search/?P=BIOE%20380\" BIOE 380 . Prerequisite:  * HYPERLINK \"https://catalog.illinois.edu/search/?P=MATH%20285\" MATH 285 or MATH 286.",
    "prerequisites": null,
    "admin_notes": null,
    "topics": [
      "Physics and engineering principles associated with x-ray, computed tomography, nuclear, ultrasound, magnetic resonance, and optical imaging, including human visualization and perception of image data",
      "Same as  * HYPERLINK \"https://catalog",
      "edu/search/?P=BIOE%20380\" BIOE 380",
      "Prerequisite:  * HYPERLINK \"https://catalog",
      "edu/search/?P=MATH%20285\" MATH 285 or MATH 286"
    ],
    "embedding_text": "BIOE 380 Biomedical Imaging. Physics and engineering principles associated with x-ray, computed tomography, nuclear, ultrasound, magnetic resonance, and optical imaging, including human visualization and perception of image data. Same as  * HYPERLINK \"https://catalog.illinois.edu/search/?P=BIOE%20380\" BIOE 380 . Prerequisite:  * HYPERLINK \"https://catalog.illinois.edu/search/?P=MATH%20285\" MATH 285 or MATH 286."
  },
  {
    "course_instance_id": "BIOE 397 Individual Study 0 10412",
    "course_id": "BIOE 397",
    "course_number": 397,
    "subject": "BIOE",
    "title": "Individual Study",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Independent Study",
    "section_number": "0",
    "crn": 10412,
    "credit_hours": 1,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Special project or reading activity.",
    "prerequisites": "Approved written application to department as specified by department or instructor",
    "admin_notes": "May be repeated up to 8 hours in a term to a maximum of 12 total hours. Prerequisite: Approved written application to department as specified by department or instructor.",
    "topics": [
      "Special project or reading activity"
    ],
    "embedding_text": "BIOE 397 Individual Study. Special project or reading activity. Prerequisite: Approved written application to department as specified by department or instructor."
  },
  {
    "course_instance_id": "BIOE 400 Bioengineering Senior Design SD 78442",
    "course_id": "BIOE 400",
    "course_number": 400,
    "subject": "BIOE",
    "title": "Bioengineering Senior Design",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Packaged Section",
    "section_number": "SD",
    "crn": 78442,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Students perform market research and explore entrepreneurship in bioengineering resulting in the design of a device or process; practice problem identification and analyze solutions for real-world problems from the perspective of value added for end-users; use principles of design, engineering analysis, and customer discovery. This course emphasizes effective teamwork and technical communication; integrates intellectual property, United States Food and Drug Administration Quality System Regulation and Design Controls, human-centered design, FDA regulation, professionalism, and ethics.",
    "prerequisites": "BIOE 302, BIOE 303, BIOE 414, BIOE 415",
    "admin_notes": "4 undergraduate hours. No graduate credit. Prerequisite: BIOE 302, BIOE 303, BIOE 414, BIOE 415. Restricted to students in the Bioengineering Bachelor of Science program. The course instructor will arrange team meetings with students at the beginning of the course and team meetings will take place at a singular time occurring Monday-Friday between the hours of 8am - 5pm.",
    "topics": [
      "Students perform market research and explore entrepreneurship in bioengineering resulting in the design of a device or process",
      "practice problem identification and analyze solutions for real-world problems from the perspective of value added for end-users",
      "use principles of design, engineering analysis, and customer discovery",
      "This course emphasizes effective teamwork and technical communication",
      "integrates intellectual property, United States Food and Drug Administration Quality System Regulation and Design Controls, human-centered design, FDA regulation, professionalism, and ethics"
    ],
    "embedding_text": "BIOE 400 Bioengineering Senior Design. Students perform market research and explore entrepreneurship in bioengineering resulting in the design of a device or process; practice problem identification and analyze solutions for real-world problems from the perspective of value added for end-users; use principles of design, engineering analysis, and customer discovery. This course emphasizes effective teamwork and technical communication; integrates intellectual property, United States Food and Drug Administration Quality System Regulation and Design Controls, human-centered design, FDA regulation, professionalism, and ethics. Prerequisite: BIOE 302, BIOE 303, BIOE 414, BIOE 415."
  },
  {
    "course_instance_id": "BIOE 414 Biomedical Instrumentation B 40017",
    "course_id": "BIOE 414",
    "course_number": 414,
    "subject": "BIOE",
    "title": "Biomedical Instrumentation",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "B",
    "crn": 40017,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Engineering aspects of the detection, acquisition, processing, and display of signals from living systems; biomedical sensors for measurements of biopotentials, ions and gases in aqueous solution, force, displacement, blood pressure, blood flow, heart sounds, respiration, and temperature; therapeutic and prosthetic devices; medical imaging instrumentation.",
    "prerequisites": "BIOE 205, ECE 205 or ECE 210",
    "admin_notes": "Same as ECE 414. 3 undergraduate hours. 3 graduate hours. Prerequisite: BIOE 205, ECE 205 or ECE 210. BIOE-MS, PhD, and M.Eng students should contact sh4nier3@illinois.edu for an override; concurrent enrollment in BIOE 598, section B1, CRN 65285 is required. Seats will be released to non-majors who meet prerequisites on July 21. Some seats will remain held for majors through the 10th day of class.",
    "topics": [
      "Engineering aspects of the detection, acquisition, processing, and display of signals from living systems",
      "biomedical sensors for measurements of biopotentials, ions and gases in aqueous solution, force, displacement, blood pressure, blood flow, heart sounds, respiration, and temperature",
      "therapeutic and prosthetic devices",
      "medical imaging instrumentation"
    ],
    "embedding_text": "BIOE 414 Biomedical Instrumentation. Engineering aspects of the detection, acquisition, processing, and display of signals from living systems; biomedical sensors for measurements of biopotentials, ions and gases in aqueous solution, force, displacement, blood pressure, blood flow, heart sounds, respiration, and temperature; therapeutic and prosthetic devices; medical imaging instrumentation. Prerequisite: BIOE 205, ECE 205 or ECE 210."
  },
  {
    "course_instance_id": "BIOE 415 Biomedical Instrumentation Lab AB2 43867",
    "course_id": "BIOE 415",
    "course_number": 415,
    "subject": "BIOE",
    "title": "Biomedical Instrumentation Lab",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Laboratory",
    "section_number": "AB2",
    "crn": 43867,
    "credit_hours": 2,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Laboratory to accompany BIOE 414. Use of sensors and medical instrumentation for static and dynamic biological inputs. Measurement of biomedical signals.",
    "prerequisites": "Credit or concurrent registration in BIOE 414",
    "admin_notes": "Same as ECE 415. 2 undergraduate hours. 2 graduate hours. Prerequisite: Credit or concurrent registration in BIOE 414.",
    "topics": [
      "Laboratory to accompany BIOE 414",
      "Use of sensors and medical instrumentation for static and dynamic biological inputs",
      "Measurement of biomedical signals"
    ],
    "embedding_text": "BIOE 415 Biomedical Instrumentation Lab. Laboratory to accompany BIOE 414. Use of sensors and medical instrumentation for static and dynamic biological inputs. Measurement of biomedical signals. Prerequisite: Credit or concurrent registration in BIOE 414."
  },
  {
    "course_instance_id": "BIOE 416 Biosensors A 53605",
    "course_id": "BIOE 416",
    "course_number": 416,
    "subject": "BIOE",
    "title": "Biosensors",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "A",
    "crn": 53605,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Underlying engineering principles used to detect small molecules, DNA, proteins, and cells in the context of applications in diagnostic testing, pharmaceutical research, and environmental monitoring. Biosensor approaches including electrochemistry, fluorescence, acoustics, and optics; aspects of selective surface chemistry including methods for biomolecule attachment to transducer surfaces; characterization of bisensor performance; blood glucose detection; fluorescent DNA microarrays; label-free biochips; bead-based assay methods. Case studies and analysis of commercial biosensor. Same as  * HYPERLINK \"https://catalog.illinois.edu/search/?P=BIOE%20416\" BIOE 416 . 3 undergraduate hours. 3 graduate hours. Prerequisite:  * HYPERLINK \"https://catalog.illinois.edu/search/?P=ECE%20329\" ECE 329 .",
    "prerequisites": null,
    "admin_notes": null,
    "topics": [
      "Underlying engineering principles used to detect small molecules, DNA, proteins, and cells in the context of applications in diagnostic testing, pharmaceutical research, and environmental monitoring",
      "Biosensor approaches including electrochemistry, fluorescence, acoustics, and optics",
      "aspects of selective surface chemistry including methods for biomolecule attachment to transducer surfaces",
      "characterization of bisensor performance",
      "blood glucose detection",
      "fluorescent DNA microarrays",
      "label-free biochips",
      "bead-based assay methods",
      "Case studies and analysis of commercial biosensor",
      "Same as  * HYPERLINK \"https://catalog",
      "edu/search/?P=BIOE%20416\" BIOE 416",
      "3 undergraduate hours",
      "3 graduate hours",
      "Prerequisite:  * HYPERLINK \"https://catalog",
      "edu/search/?P=ECE%20329\" ECE 329"
    ],
    "embedding_text": "BIOE 416 Biosensors. Underlying engineering principles used to detect small molecules, DNA, proteins, and cells in the context of applications in diagnostic testing, pharmaceutical research, and environmental monitoring. Biosensor approaches including electrochemistry, fluorescence, acoustics, and optics; aspects of selective surface chemistry including methods for biomolecule attachment to transducer surfaces; characterization of bisensor performance; blood glucose detection; fluorescent DNA microarrays; label-free biochips; bead-based assay methods. Case studies and analysis of commercial biosensor. Same as  * HYPERLINK \"https://catalog.illinois.edu/search/?P=BIOE%20416\" BIOE 416 . 3 undergraduate hours. 3 graduate hours. Prerequisite:  * HYPERLINK \"https://catalog.illinois.edu/search/?P=ECE%20329\" ECE 329 ."
  },
  {
    "course_instance_id": "BIOE 420 Intro Bio Control Systems AL1 62799",
    "course_id": "BIOE 420",
    "course_number": 420,
    "subject": "BIOE",
    "title": "Intro Bio Control Systems",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "AL1",
    "crn": 62799,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Systems engineering approach to modeling physiological systems to examine natural biological control systems, homeostasis, and control through external medical devices. Introduces open loop and closed loop feedback control; Laplace and Fourier analysis of system behavior; impulse and steady state responses; physiological modeling and system identification; and stability. Includes biological systems for endocrine function, muscle position, neuronal circuits, and cardiovascular function. Mathematical modeling, Matlab and Simulink simulation, and physiological measurements to relate control systems to maintenance of internal environment.",
    "prerequisites": "BIOE 302, BIOE 303, BIOE 414, BIOE 415",
    "admin_notes": "3 undergraduate hours. No graduate credit. Credit is not given for BIOE 420 if credit for AE 353, ECE 486, SE 320, or ME 340 has been earned. Prerequisite: BIOE 302, BIOE 303, BIOE 414, BIOE 415. Class Schedule Information: Departmental approval required for non-majors.",
    "topics": [
      "Systems engineering approach to modeling physiological systems to examine natural biological control systems, homeostasis, and control through external medical devices",
      "Introduces open loop and closed loop feedback control",
      "Laplace and Fourier analysis of system behavior",
      "impulse and steady state responses",
      "physiological modeling and system identification",
      "Includes biological systems for endocrine function, muscle position, neuronal circuits, and cardiovascular function",
      "Mathematical modeling, Matlab and Simulink simulation, and physiological measurements to relate control systems to maintenance of internal environment"
    ],
    "embedding_text": "BIOE 420 Intro Bio Control Systems. Systems engineering approach to modeling physiological systems to examine natural biological control systems, homeostasis, and control through external medical devices. Introduces open loop and closed loop feedback control; Laplace and Fourier analysis of system behavior; impulse and steady state responses; physiological modeling and system identification; and stability. Includes biological systems for endocrine function, muscle position, neuronal circuits, and cardiovascular function. Mathematical modeling, Matlab and Simulink simulation, and physiological measurements to relate control systems to maintenance of internal environment. Prerequisite: BIOE 302, BIOE 303, BIOE 414, BIOE 415."
  },
  {
    "course_instance_id": "BIOE 424 Preclinical Molecular Imaging G 79634",
    "course_id": "BIOE 424",
    "course_number": 424,
    "subject": "BIOE",
    "title": "Preclinical Molecular Imaging",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "G",
    "crn": 79634,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Students will gain a solid educational foundation in the principles and practice of preclinical molecular imaging such that students can build on their prior education, training, and experiences to drive the field in new directions and advance their professional goals. The course will focus on key areas of knowledge: imaging physics and instrumentation, molecular probes and contrast agents, molecular interactions, quantitative imaging and modeling, and translation to the clinical imaging of disease.",
    "prerequisites": "BIOE 205 is recommended",
    "admin_notes": "3 undergraduate hours. 4 graduate hours. Credit is not given toward graduation for BIOE 424 and either BIOE 498 WD or BIOE 598 WD. Prerequisite: BIOE 205 is recommended.",
    "topics": [
      "Students will gain a solid educational foundation in the principles and practice of preclinical molecular imaging such that students can build on their prior education, training, and experiences to drive the field in new directions and advance their professional goals",
      "The course will focus on key areas of knowledge: imaging physics and instrumentation, molecular probes and contrast agents, molecular interactions, quantitative imaging and modeling, and translation to the clinical imaging of disease"
    ],
    "embedding_text": "BIOE 424 Preclinical Molecular Imaging. Students will gain a solid educational foundation in the principles and practice of preclinical molecular imaging such that students can build on their prior education, training, and experiences to drive the field in new directions and advance their professional goals. The course will focus on key areas of knowledge: imaging physics and instrumentation, molecular probes and contrast agents, molecular interactions, quantitative imaging and modeling, and translation to the clinical imaging of disease. Prerequisite: BIOE 205 is recommended."
  },
  {
    "course_instance_id": "BIOE 432 Systems Biology SB1 76519",
    "course_id": "BIOE 432",
    "course_number": 432,
    "subject": "BIOE",
    "title": "Systems Biology",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "SB1",
    "crn": 76519,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Systems biology is the study of systems of biological components that may be molecules, cells, organisms or entire species. The behaviors of such systems often requires holistic, quantitative measurements and modeling of the entire groups of interacting components. This course offers an introduction to the fundamental concepts and quantitative methodologies underlying systems biology through the examination of a series of examples. It outlines basic design principles ubiquitous in biological networks.",
    "prerequisites": "MATH 285 or equivalent knowledge",
    "admin_notes": "3 undergraduate hours. 4 graduate hours. Prerequisite: MATH 285 or equivalent knowledge.",
    "topics": [
      "Systems biology is the study of systems of biological components that may be molecules, cells, organisms or entire species",
      "The behaviors of such systems often requires holistic, quantitative measurements and modeling of the entire groups of interacting components",
      "This course offers an introduction to the fundamental concepts and quantitative methodologies underlying systems biology through the examination of a series of examples",
      "It outlines basic design principles ubiquitous in biological networks"
    ],
    "embedding_text": "BIOE 432 Systems Biology. Systems biology is the study of systems of biological components that may be molecules, cells, organisms or entire species. The behaviors of such systems often requires holistic, quantitative measurements and modeling of the entire groups of interacting components. This course offers an introduction to the fundamental concepts and quantitative methodologies underlying systems biology through the examination of a series of examples. It outlines basic design principles ubiquitous in biological networks. Prerequisite: MATH 285 or equivalent knowledge."
  },
  {
    "course_instance_id": "BIOE 434 Immunoengineering IM1 76521",
    "course_id": "BIOE 434",
    "course_number": 434,
    "subject": "BIOE",
    "title": "Immunoengineering",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "IM1",
    "crn": 76521,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Students will explore the field of immunoengineering, including basic and translational research for disease intervention and management, with rigorous investigation of the design principles underlying immunologically-based therapies and diagnostics. Students will learn to critically analyze scientific findings and develop effective written and oral communication skills through lectures, literature discussions, in-class activities, and a project requiring students to develop and present novel solutions to address limitations in existing technology in the field.",
    "prerequisites": "Background in advanced biology or related field",
    "admin_notes": "3 undergraduate hours. 4 graduate hours. Credit is not given toward graduation for BIOE 434 and either BIOE 498 AL or BIOE 598 AL. Prerequisite: Background in advanced biology or related field. Students must be in year 3 or 4 of their undergraduate curriculum to enroll in this course.",
    "topics": [
      "Students will explore the field of immunoengineering, including basic and translational research for disease intervention and management, with rigorous investigation of the design principles underlying immunologically-based therapies and diagnostics",
      "Students will learn to critically analyze scientific findings and develop effective written and oral communication skills through lectures, literature discussions, in-class activities, and a project requiring students to develop and present novel solutions to address limitations in existing technology in the field"
    ],
    "embedding_text": "BIOE 434 Immunoengineering. Students will explore the field of immunoengineering, including basic and translational research for disease intervention and management, with rigorous investigation of the design principles underlying immunologically-based therapies and diagnostics. Students will learn to critically analyze scientific findings and develop effective written and oral communication skills through lectures, literature discussions, in-class activities, and a project requiring students to develop and present novel solutions to address limitations in existing technology in the field. Prerequisite: Background in advanced biology or related field."
  },
  {
    "course_instance_id": "BIOE 450 Intro to Quantitative Pharma QP1 79423",
    "course_id": "BIOE 450",
    "course_number": 450,
    "subject": "BIOE",
    "title": "Intro to Quantitative Pharma",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "QP1",
    "crn": 79423,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "The interaction between living organisms and substances (drugs) that impact physiology and disease are the focus areas of this course. Concepts are integrated across equilibrium thermodynamics, kinetics, mass transfer, organic chemistry, biochemistry, and structural biology to understand drug design and function. Students will develop skills in quantitative aspects of medicinal chemistry, pharmacodynamics, and pharmacokinetics through mathematical models and computer simulations.",
    "prerequisites": "CS 101 or CS 124, CHEM 232 or CHEM 236, MCB 150, MATH 231",
    "admin_notes": "3 undergraduate hours. 4 graduate hours. Credit is not given toward graduation for BIOE 450 and either BIOE 498 QP or BIOE 598 QP. Prerequisite: CS 101 or CS 124, CHEM 232 or CHEM 236, MCB 150, MATH 231.",
    "topics": [
      "The interaction between living organisms and substances (drugs) that impact physiology and disease are the focus areas of this course",
      "Concepts are integrated across equilibrium thermodynamics, kinetics, mass transfer, organic chemistry, biochemistry, and structural biology to understand drug design and function",
      "Students will develop skills in quantitative aspects of medicinal chemistry, pharmacodynamics, and pharmacokinetics through mathematical models and computer simulations"
    ],
    "embedding_text": "BIOE 450 Intro to Quantitative Pharma. The interaction between living organisms and substances (drugs) that impact physiology and disease are the focus areas of this course. Concepts are integrated across equilibrium thermodynamics, kinetics, mass transfer, organic chemistry, biochemistry, and structural biology to understand drug design and function. Students will develop skills in quantitative aspects of medicinal chemistry, pharmacodynamics, and pharmacokinetics through mathematical models and computer simulations. Prerequisite: CS 101 or CS 124, CHEM 232 or CHEM 236, MCB 150, MATH 231."
  },
  {
    "course_instance_id": "BIOE 467 Biophotonics A 61522",
    "course_id": "BIOE 467",
    "course_number": 467,
    "subject": "BIOE",
    "title": "Biophotonics",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "A",
    "crn": 61522,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Overview of the field of biophotonics, in three segments: (1) fundamental principles of light, optics, lasers, biology, and medicine; (2) diagnostic biophotonics including imaging, spectroscopy, and optical biosensors; (3) therapeutic applications of biophotonics including laser ablation and photodynamic therapies. Reviews and presentations of current scientific literature by students. Tours of microscopy facilities. Same as  * HYPERLINK \"https://catalog.illinois.edu/search/?P=BIOE%20467\" BIOE 467 . 3 undergraduate hours. 3 graduate hours. Prerequisite: One of  * HYPERLINK \"https://catalog.illinois.edu/search/?P=ECE%20455\" ECE 455 ,  * HYPERLINK \"https://catalog.illinois.edu/search/?P=ECE%20460\" ECE 460 ,  * HYPERLINK \"https://catalog.illinois.edu/search/?P=PHYS%20402\" PHYS 402 .",
    "prerequisites": null,
    "admin_notes": null,
    "topics": [
      "Overview of the field of biophotonics, in three segments: (1) fundamental principles of light, optics, lasers, biology, and medicine",
      "(2) diagnostic biophotonics including imaging, spectroscopy, and optical biosensors",
      "(3) therapeutic applications of biophotonics including laser ablation and photodynamic therapies",
      "Reviews and presentations of current scientific literature by students",
      "Tours of microscopy facilities",
      "Same as  * HYPERLINK \"https://catalog",
      "edu/search/?P=BIOE%20467\" BIOE 467",
      "3 undergraduate hours",
      "3 graduate hours",
      "Prerequisite: One of  * HYPERLINK \"https://catalog",
      "edu/search/?P=ECE%20455\" ECE 455 ,  * HYPERLINK \"https://catalog",
      "edu/search/?P=ECE%20460\" ECE 460 ,  * HYPERLINK \"https://catalog",
      "edu/search/?P=PHYS%20402\" PHYS 402"
    ],
    "embedding_text": "BIOE 467 Biophotonics. Overview of the field of biophotonics, in three segments: (1) fundamental principles of light, optics, lasers, biology, and medicine; (2) diagnostic biophotonics including imaging, spectroscopy, and optical biosensors; (3) therapeutic applications of biophotonics including laser ablation and photodynamic therapies. Reviews and presentations of current scientific literature by students. Tours of microscopy facilities. Same as  * HYPERLINK \"https://catalog.illinois.edu/search/?P=BIOE%20467\" BIOE 467 . 3 undergraduate hours. 3 graduate hours. Prerequisite: One of  * HYPERLINK \"https://catalog.illinois.edu/search/?P=ECE%20455\" ECE 455 ,  * HYPERLINK \"https://catalog.illinois.edu/search/?P=ECE%20460\" ECE 460 ,  * HYPERLINK \"https://catalog.illinois.edu/search/?P=PHYS%20402\" PHYS 402 ."
  },
  {
    "course_instance_id": "BIOE 476 Tissue Engineering ONL 69353",
    "course_id": "BIOE 476",
    "course_number": 476,
    "subject": "BIOE",
    "title": "Tissue Engineering",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "ONL",
    "crn": 69353,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Tissue engineering therapies for cell-based, material-based, and therapeutic-based solutions. Stem cells, immunology, and clinical applications.",
    "prerequisites": "MCB 150 and BIOE 206",
    "admin_notes": "3 undergraduate hours. 3 graduate hours. Prerequisite: MCB 150 and BIOE 206. Please note that this section is only for online students who meet the course program restrictions, as noted.",
    "topics": [
      "Tissue engineering therapies for cell-based, material-based, and therapeutic-based solutions",
      "Stem cells, immunology, and clinical applications"
    ],
    "embedding_text": "BIOE 476 Tissue Engineering. Tissue engineering therapies for cell-based, material-based, and therapeutic-based solutions. Stem cells, immunology, and clinical applications. Prerequisite: MCB 150 and BIOE 206."
  },
  {
    "course_instance_id": "BIOE 479 Cancer Nanotechnology AL1 64046",
    "course_id": "BIOE 479",
    "course_number": 479,
    "subject": "BIOE",
    "title": "Cancer Nanotechnology",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "AL1",
    "crn": 64046,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "An elective course for undergraduate students who are interested in learning nanotechnology and its applications in biology and medicine. Key topics include: (1) cancer biology and clinical oncology, (2) fundamentals of nanoscience, (3) principles of nanoscale engineering, (4) major classes of nanoparticles and nanostructures, and (5) nanomedicine - technologies and applications",
    "prerequisites": "BIOE 206, CHEM 232",
    "admin_notes": "3 undergraduate hours. No graduate credit. Approved for Letter and S/U grading. Prerequisite: BIOE 206, CHEM 232. Some seats will remain held for majors. Additional seats will be released to non-majors on December 1, 2025. Please contact the department with any questions. No closed overrides will be given. Graduate student should enroll in BIOE 598, CRN 64638 to enroll in this course.",
    "topics": [
      "An elective course for undergraduate students who are interested in learning nanotechnology and its applications in biology and medicine",
      "Key topics include: (1) cancer biology and clinical oncology, (2) fundamentals of nanoscience, (3) principles of nanoscale engineering, (4) major classes of nanoparticles and nanostructures, and (5) nanomedicine - technologies and applications"
    ],
    "embedding_text": "BIOE 479 Cancer Nanotechnology. An elective course for undergraduate students who are interested in learning nanotechnology and its applications in biology and medicine. Key topics include: (1) cancer biology and clinical oncology, (2) fundamentals of nanoscience, (3) principles of nanoscale engineering, (4) major classes of nanoparticles and nanostructures, and (5) nanomedicine - technologies and applications Prerequisite: BIOE 206, CHEM 232."
  },
  {
    "course_instance_id": "BIOE 480 Magnetic Resonance Imaging GR 78076",
    "course_id": "BIOE 480",
    "course_number": 480,
    "subject": "BIOE",
    "title": "Magnetic Resonance Imaging",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "GR",
    "crn": 78076,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Fundamental physical, mathematical, and computational principles governing the data acquisition and image reconstruction of magnetic resonance imaging. Same as  * HYPERLINK \"https://catalog.illinois.edu/search/?P=BIOE%20480\" BIOE 480 . 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: Recommended:  * HYPERLINK \"https://catalog.illinois.edu/search/?P=ECE%20310\" ECE 310 .",
    "prerequisites": null,
    "admin_notes": null,
    "topics": [
      "Fundamental physical, mathematical, and computational principles governing the data acquisition and image reconstruction of magnetic resonance imaging",
      "Same as  * HYPERLINK \"https://catalog",
      "edu/search/?P=BIOE%20480\" BIOE 480",
      "3 undergraduate hours",
      "3 or 4 graduate hours",
      "Prerequisite: Recommended:  * HYPERLINK \"https://catalog",
      "edu/search/?P=ECE%20310\" ECE 310"
    ],
    "embedding_text": "BIOE 480 Magnetic Resonance Imaging. Fundamental physical, mathematical, and computational principles governing the data acquisition and image reconstruction of magnetic resonance imaging. Same as  * HYPERLINK \"https://catalog.illinois.edu/search/?P=BIOE%20480\" BIOE 480 . 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: Recommended:  * HYPERLINK \"https://catalog.illinois.edu/search/?P=ECE%20310\" ECE 310 ."
  },
  {
    "course_instance_id": "BIOE 481 Whole-Body Musculoskel Biomech WMG 66065",
    "course_id": "BIOE 481",
    "course_number": 481,
    "subject": "BIOE",
    "title": "Whole-Body Musculoskel Biomech",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "WMG",
    "crn": 66065,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Exploration of the human musculoskeletal system with an emphasis on the whole-body or organism level; modeling and analysis techniques for examining human movement, such as rigid-body modeling techniques, forward and inverse dynamics, and Lagrangian mechanics; examination of current topics, such as orthopedic biomechanics, prosthetics and orthotics, postural control, and locomotion; use of computerized motion-capture equipment and software to examine, simulate, and analyze human movement. Same as  * HYPERLINK \"https://catalog.illinois.edu/search/?P=BIOE%20481\" BIOE 481 . 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite:  * HYPERLINK \"https://catalog.illinois.edu/search/?P=TAM%20212\" TAM 212 and  * HYPERLINK \"https://catalog.illinois.edu/search/?P=TAM%20251\" TAM 251 .",
    "prerequisites": null,
    "admin_notes": null,
    "topics": [
      "Exploration of the human musculoskeletal system with an emphasis on the whole-body or organism level",
      "modeling and analysis techniques for examining human movement, such as rigid-body modeling techniques, forward and inverse dynamics, and Lagrangian mechanics",
      "examination of current topics, such as orthopedic biomechanics, prosthetics and orthotics, postural control, and locomotion",
      "use of computerized motion-capture equipment and software to examine, simulate, and analyze human movement",
      "Same as  * HYPERLINK \"https://catalog",
      "edu/search/?P=BIOE%20481\" BIOE 481",
      "3 undergraduate hours",
      "3 or 4 graduate hours",
      "Prerequisite:  * HYPERLINK \"https://catalog",
      "edu/search/?P=TAM%20212\" TAM 212 and  * HYPERLINK \"https://catalog",
      "edu/search/?P=TAM%20251\" TAM 251"
    ],
    "embedding_text": "BIOE 481 Whole-Body Musculoskel Biomech. Exploration of the human musculoskeletal system with an emphasis on the whole-body or organism level; modeling and analysis techniques for examining human movement, such as rigid-body modeling techniques, forward and inverse dynamics, and Lagrangian mechanics; examination of current topics, such as orthopedic biomechanics, prosthetics and orthotics, postural control, and locomotion; use of computerized motion-capture equipment and software to examine, simulate, and analyze human movement. Same as  * HYPERLINK \"https://catalog.illinois.edu/search/?P=BIOE%20481\" BIOE 481 . 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite:  * HYPERLINK \"https://catalog.illinois.edu/search/?P=TAM%20212\" TAM 212 and  * HYPERLINK \"https://catalog.illinois.edu/search/?P=TAM%20251\" TAM 251 ."
  },
  {
    "course_instance_id": "BIOE 482 Musculoskel Tissue Mechanics AB1 60168",
    "course_id": "BIOE 482",
    "course_number": 482,
    "subject": "BIOE",
    "title": "Musculoskel Tissue Mechanics",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Laboratory",
    "section_number": "AB1",
    "crn": 60168,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Composition-structure-function relationships for musculoskeletal tissues, including bone, tendon, ligament, cartilage, and muscle; hierarchical structure of tissues from the macro- to nano-scales; relation of composition to mechanical properties of health and diseased tissue; experimental methods used to obtain mechanical properties. Same as  * HYPERLINK \"https://catalog.illinois.edu/search/?P=BIOE%20482\" BIOE 482 . 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite:  * HYPERLINK \"https://catalog.illinois.edu/search/?P=TAM%20251\" TAM 251 .",
    "prerequisites": null,
    "admin_notes": null,
    "topics": [
      "Composition-structure-function relationships for musculoskeletal tissues, including bone, tendon, ligament, cartilage, and muscle",
      "hierarchical structure of tissues from the macro- to nano-scales",
      "relation of composition to mechanical properties of health and diseased tissue",
      "experimental methods used to obtain mechanical properties",
      "Same as  * HYPERLINK \"https://catalog",
      "edu/search/?P=BIOE%20482\" BIOE 482",
      "3 undergraduate hours",
      "3 or 4 graduate hours",
      "Prerequisite:  * HYPERLINK \"https://catalog",
      "edu/search/?P=TAM%20251\" TAM 251"
    ],
    "embedding_text": "BIOE 482 Musculoskel Tissue Mechanics. Composition-structure-function relationships for musculoskeletal tissues, including bone, tendon, ligament, cartilage, and muscle; hierarchical structure of tissues from the macro- to nano-scales; relation of composition to mechanical properties of health and diseased tissue; experimental methods used to obtain mechanical properties. Same as  * HYPERLINK \"https://catalog.illinois.edu/search/?P=BIOE%20482\" BIOE 482 . 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite:  * HYPERLINK \"https://catalog.illinois.edu/search/?P=TAM%20251\" TAM 251 ."
  },
  {
    "course_instance_id": "BIOE 483 Biomed Computed Imaging System IP2 76080",
    "course_id": "BIOE 483",
    "course_number": 483,
    "subject": "BIOE",
    "title": "Biomed Computed Imaging System",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "IP2",
    "crn": 76080,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "The frontier of biomedical imaging is computed imaging where multi-dimensional images must be reconstructed from measured data that is otherwise not meaningful to human observers. In this course, computational image reconstruction techniques will be developed and employed across a broad range of radiographic, magnetic resonance, and nuclear imaging modalities. General imaging and detection principles common to all computational modalities will be covered in context of specific biomedical imaging scenarios. X-ray computed tomography will be covered in depth and in the context of the imaging science principles presented the co-requisites; this also includes practical concerns about computing resources and modern GPU-based computing. The physics of magnetic resonance imaging will be presented and related to specific mathematical issues of image reconstruction and under-sampled measurement space. Positron emission tomography (PET) will be covered and specific clinical issues discussed in terms of reconstruction algorithm and parameter choices.",
    "prerequisites": "BIOE 205, BIOE 210, ECE 380/BIOE 380",
    "admin_notes": "3 undergraduate hours. 4 graduate hours. Prerequisite: BIOE 205, BIOE 210, ECE 380/BIOE 380. Concurrent enrollment in BIOE 485 and BIOE 580; or instructor approval.",
    "topics": [
      "The frontier of biomedical imaging is computed imaging where multi-dimensional images must be reconstructed from measured data that is otherwise not meaningful to human observers",
      "In this course, computational image reconstruction techniques will be developed and employed across a broad range of radiographic, magnetic resonance, and nuclear imaging modalities",
      "General imaging and detection principles common to all computational modalities will be covered in context of specific biomedical imaging scenarios",
      "X-ray computed tomography will be covered in depth and in the context of the imaging science principles presented the co-requisites",
      "this also includes practical concerns about computing resources and modern GPU-based computing",
      "The physics of magnetic resonance imaging will be presented and related to specific mathematical issues of image reconstruction and under-sampled measurement space",
      "Positron emission tomography (PET) will be covered and specific clinical issues discussed in terms of reconstruction algorithm and parameter choices"
    ],
    "embedding_text": "BIOE 483 Biomed Computed Imaging System. The frontier of biomedical imaging is computed imaging where multi-dimensional images must be reconstructed from measured data that is otherwise not meaningful to human observers. In this course, computational image reconstruction techniques will be developed and employed across a broad range of radiographic, magnetic resonance, and nuclear imaging modalities. General imaging and detection principles common to all computational modalities will be covered in context of specific biomedical imaging scenarios. X-ray computed tomography will be covered in depth and in the context of the imaging science principles presented the co-requisites; this also includes practical concerns about computing resources and modern GPU-based computing. The physics of magnetic resonance imaging will be presented and related to specific mathematical issues of image reconstruction and under-sampled measurement space. Positron emission tomography (PET) will be covered and specific clinical issues discussed in terms of reconstruction algorithm and parameter choices. Prerequisite: BIOE 205, BIOE 210, ECE 380/BIOE 380."
  },
  {
    "course_instance_id": "BIOE 484 Stat Analys Biomed Images AL1 72054",
    "course_id": "BIOE 484",
    "course_number": 484,
    "subject": "BIOE",
    "title": "Stat Analys Biomed Images",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "AL1",
    "crn": 72054,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Biomedical image data often come in extreme numbers: there is either so many of them that humans can't analyze them in reasonable time (e.g., three-dimensional light sheet microscopy data) or they are few, highly varied and of limited spatial and intensity resolutions (e.g., positron emission tomography scans). Furthermore, the extraction of image features and the characterization of modality-dependent background noise can be particularly challenging in typical biomedical scenarios. In this course, several applications of statistical learning to biomedical image data will be covered in depth from first principles. Analyses will be done in Python using the Scikit-learn package and all homework assignments comprise statistical analyses of biomedical image data in real decision scenarios. Histogram transforms and the fundamental properties of image texture will be introduced and revisited throughout the course. The extraction of both low- and high-order spatial features at multiple scales will be demonstrated and employed throughout the course. Support vector machines will be introduced and applied to image classification and interpretation tasks. The random forest algorithm will be introduced and used on a number of large- and small-data tasks. Multiple linear regression will be applied to neuroimaging data and some common methods of assessing model robustness shown. Cross-validation of image-derived decisions and some common methods of assessing model robustness will be shown. Feature selection and dimensionality will be discussed in terms of diagnostic task performance. The effects of inter-feature correlation upon prediction confidence will be discussed. Principal component analysis will be described and applied to various image processing tasks. Unsupervised clustering and cluster analysis of extracted image features will be introduced. Stochastic object models will be introduced and applied in various validation tasks.",
    "prerequisites": "BIOE 485 or permission of the instructor",
    "admin_notes": "3 undergraduate hours. 4 graduate hours. Prerequisite: BIOE 485 or permission of the instructor. Students are expected to be familiar with calculus, basic probability & sampling, vector spaces, matrix algebra and constrained optimization. Several NumPy objects and manipulations will be reviewed, and all necessary Sci-kit functions introduced; however, students are expected to have substantial experience with Python programming as the basics of such will not be covered. Registration will open to non-BIOE students on January 12, 2026.",
    "topics": [
      "Biomedical image data often come in extreme numbers: there is either so many of them that humans can't analyze them in reasonable time (e",
      ", three-dimensional light sheet microscopy data) or they are few, highly varied and of limited spatial and intensity resolutions (e",
      ", positron emission tomography scans)",
      "Furthermore, the extraction of image features and the characterization of modality-dependent background noise can be particularly challenging in typical biomedical scenarios",
      "In this course, several applications of statistical learning to biomedical image data will be covered in depth from first principles",
      "Analyses will be done in Python using the Scikit-learn package and all homework assignments comprise statistical analyses of biomedical image data in real decision scenarios",
      "Histogram transforms and the fundamental properties of image texture will be introduced and revisited throughout the course",
      "The extraction of both low- and high-order spatial features at multiple scales will be demonstrated and employed throughout the course",
      "Support vector machines will be introduced and applied to image classification and interpretation tasks",
      "The random forest algorithm will be introduced and used on a number of large- and small-data tasks",
      "Multiple linear regression will be applied to neuroimaging data and some common methods of assessing model robustness shown",
      "Cross-validation of image-derived decisions and some common methods of assessing model robustness will be shown",
      "Feature selection and dimensionality will be discussed in terms of diagnostic task performance",
      "The effects of inter-feature correlation upon prediction confidence will be discussed",
      "Principal component analysis will be described and applied to various image processing tasks",
      "Unsupervised clustering and cluster analysis of extracted image features will be introduced",
      "Stochastic object models will be introduced and applied in various validation tasks"
    ],
    "embedding_text": "BIOE 484 Stat Analys Biomed Images. Biomedical image data often come in extreme numbers: there is either so many of them that humans can't analyze them in reasonable time (e.g., three-dimensional light sheet microscopy data) or they are few, highly varied and of limited spatial and intensity resolutions (e.g., positron emission tomography scans). Furthermore, the extraction of image features and the characterization of modality-dependent background noise can be particularly challenging in typical biomedical scenarios. In this course, several applications of statistical learning to biomedical image data will be covered in depth from first principles. Analyses will be done in Python using the Scikit-learn package and all homework assignments comprise statistical analyses of biomedical image data in real decision scenarios. Histogram transforms and the fundamental properties of image texture will be introduced and revisited throughout the course. The extraction of both low- and high-order spatial features at multiple scales will be demonstrated and employed throughout the course. Support vector machines will be introduced and applied to image classification and interpretation tasks. The random forest algorithm will be introduced and used on a number of large- and small-data tasks. Multiple linear regression will be applied to neuroimaging data and some common methods of assessing model robustness shown. Cross-validation of image-derived decisions and some common methods of assessing model robustness will be shown. Feature selection and dimensionality will be discussed in terms of diagnostic task performance. The effects of inter-feature correlation upon prediction confidence will be discussed. Principal component analysis will be described and applied to various image processing tasks. Unsupervised clustering and cluster analysis of extracted image features will be introduced. Stochastic object models will be introduced and applied in various validation tasks. Prerequisite: BIOE 485 or permission of the instructor."
  },
  {
    "course_instance_id": "BIOE 485 Comp Math for ML and Imaging CMO 79866",
    "course_id": "BIOE 485",
    "course_number": 485,
    "subject": "BIOE",
    "title": "Comp Math for ML and Imaging",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "CMO",
    "crn": 79866,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Covers fundamental mathematical and computational methods needed to implement computational imaging and machine learning solutions. First, relevant aspects of probability theory, matrix decompositions, and vector calculus will be introduced. Subsequently, methods that underline approximate inference, such as stochastic sampling methods, are introduced. Finally, numerical optimization methods that represent core components of computed imaging and machine learning will be introduced. This will include numerical optimization-based formulations of inverse problems. An emphasis will be placed on first order deterministic and stochastic gradient-based methods. Second order optimization techniques including quasi-Newton and Hessian free methods will also be surveyed. The application of these methods to computed imaging and machine learning problems will be addressed in detail.",
    "prerequisites": "Restricted to senior undergraduate or graduate standing in an engineering degree program or consent of instructor",
    "admin_notes": "4 undergraduate hours. 4 graduate hours. Prerequisite: Restricted to senior undergraduate or graduate standing in an engineering degree program or consent of instructor.",
    "topics": [
      "Covers fundamental mathematical and computational methods needed to implement computational imaging and machine learning solutions",
      "First, relevant aspects of probability theory, matrix decompositions, and vector calculus will be introduced",
      "Subsequently, methods that underline approximate inference, such as stochastic sampling methods, are introduced",
      "Finally, numerical optimization methods that represent core components of computed imaging and machine learning will be introduced",
      "This will include numerical optimization-based formulations of inverse problems",
      "An emphasis will be placed on first order deterministic and stochastic gradient-based methods",
      "Second order optimization techniques including quasi-Newton and Hessian free methods will also be surveyed",
      "The application of these methods to computed imaging and machine learning problems will be addressed in detail"
    ],
    "embedding_text": "BIOE 485 Comp Math for ML and Imaging. Covers fundamental mathematical and computational methods needed to implement computational imaging and machine learning solutions. First, relevant aspects of probability theory, matrix decompositions, and vector calculus will be introduced. Subsequently, methods that underline approximate inference, such as stochastic sampling methods, are introduced. Finally, numerical optimization methods that represent core components of computed imaging and machine learning will be introduced. This will include numerical optimization-based formulations of inverse problems. An emphasis will be placed on first order deterministic and stochastic gradient-based methods. Second order optimization techniques including quasi-Newton and Hessian free methods will also be surveyed. The application of these methods to computed imaging and machine learning problems will be addressed in detail. Prerequisite: Restricted to senior undergraduate or graduate standing in an engineering degree program or consent of instructor."
  },
  {
    "course_instance_id": "BIOE 486 Appl Deep Learn Biomed Imaging DL1 72055",
    "course_id": "BIOE 486",
    "course_number": 486,
    "subject": "BIOE",
    "title": "Appl Deep Learn Biomed Imaging",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "DL1",
    "crn": 72055,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Covers basic concepts, methodology and algorithms in deep learning and their applications to solve various biomedical imaging problems. Introduction to neural networks and their application to supervised and unsupervised learning problems formulated for biomedical imaging will be provided. Connections between general learning methodologies and specific challenges in the field of biomedical imaging, and design, implementation and evaluation of deep neural network-based solutions to imaging problems will be emphasized. Problems covered will include imaging system design and optimization, image recovery and reconstruction (built on the imaging physics and system course BIOE 483), image processing (e.g., denoising, super-resolution and enhancement) and image analysis (e.g., same-contrast, multi-contrast and multimodal image registration, segmentation, classification and quality assessment). Biomedical application specific problems and solutions will be covered via hands-on problems and team-based projects.",
    "prerequisites": "MATH 241 or equivalent; BIOE 210, MATH 415 or equivalent; BIOE 310, ECE 310, STAT 410 or equivalent; BIOE 198, CS 101 or equivalent; BIOE 483; BIOE 485; or consent of the instructor",
    "admin_notes": "3 undergraduate hours. 4 graduate hours. Prerequisite: MATH 241 or equivalent; BIOE 210, MATH 415 or equivalent; BIOE 310, ECE 310, STAT 410 or equivalent; BIOE 198, CS 101 or equivalent; BIOE 483; BIOE 485; or consent of the instructor. Registration will open to non-BIOE students on January 12, 2026.",
    "topics": [
      "Covers basic concepts, methodology and algorithms in deep learning and their applications to solve various biomedical imaging problems",
      "Introduction to neural networks and their application to supervised and unsupervised learning problems formulated for biomedical imaging will be provided",
      "Connections between general learning methodologies and specific challenges in the field of biomedical imaging, and design, implementation and evaluation of deep neural network-based solutions to imaging problems will be emphasized",
      "Problems covered will include imaging system design and optimization, image recovery and reconstruction (built on the imaging physics and system course BIOE 483), image processing (e",
      ", denoising, super-resolution and enhancement) and image analysis (e",
      ", same-contrast, multi-contrast and multimodal image registration, segmentation, classification and quality assessment)",
      "Biomedical application specific problems and solutions will be covered via hands-on problems and team-based projects"
    ],
    "embedding_text": "BIOE 486 Appl Deep Learn Biomed Imaging. Covers basic concepts, methodology and algorithms in deep learning and their applications to solve various biomedical imaging problems. Introduction to neural networks and their application to supervised and unsupervised learning problems formulated for biomedical imaging will be provided. Connections between general learning methodologies and specific challenges in the field of biomedical imaging, and design, implementation and evaluation of deep neural network-based solutions to imaging problems will be emphasized. Problems covered will include imaging system design and optimization, image recovery and reconstruction (built on the imaging physics and system course BIOE 483), image processing (e.g., denoising, super-resolution and enhancement) and image analysis (e.g., same-contrast, multi-contrast and multimodal image registration, segmentation, classification and quality assessment). Biomedical application specific problems and solutions will be covered via hands-on problems and team-based projects. Prerequisite: MATH 241 or equivalent; BIOE 210, MATH 415 or equivalent; BIOE 310, ECE 310, STAT 410 or equivalent; BIOE 198, CS 101 or equivalent; BIOE 483; BIOE 485; or consent of the instructor."
  },
  {
    "course_instance_id": "BIOE 487 Stem Cell Bioengineering SC1 68802",
    "course_id": "BIOE 487",
    "course_number": 487,
    "subject": "BIOE",
    "title": "Stem Cell Bioengineering",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "SC1",
    "crn": 68802,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Stem Cell Bioengineering will provide a foundation in the application of engineering approaches for the quantitative analysis of stem cell biology and the translation of stem cells into therapies. There will be 4 main sections of the course; (i) Stem Cell Basics, (ii) Stem Cell Genetics, (iii) Stem Cell Microenvironments, and (iv) Stem Cell Applications. The course will be targeted for first year graduate students and senior-level undergraduate students. The course will use a lecture and discussion format to effectively present relevant information.",
    "prerequisites": "BIOE 476",
    "admin_notes": "3 undergraduate hours. 4 graduate hours. Prerequisite: BIOE 476. Some seats will remain held for majors. Additional seats will be released to non-majors on December 1, 2025. Please contact the department with any questions. No overrides will be given.",
    "topics": [
      "Stem Cell Bioengineering will provide a foundation in the application of engineering approaches for the quantitative analysis of stem cell biology and the translation of stem cells into therapies",
      "There will be 4 main sections of the course",
      "(i) Stem Cell Basics, (ii) Stem Cell Genetics, (iii) Stem Cell Microenvironments, and (iv) Stem Cell Applications",
      "The course will be targeted for first year graduate students and senior-level undergraduate students",
      "The course will use a lecture and discussion format to effectively present relevant information"
    ],
    "embedding_text": "BIOE 487 Stem Cell Bioengineering. Stem Cell Bioengineering will provide a foundation in the application of engineering approaches for the quantitative analysis of stem cell biology and the translation of stem cells into therapies. There will be 4 main sections of the course; (i) Stem Cell Basics, (ii) Stem Cell Genetics, (iii) Stem Cell Microenvironments, and (iv) Stem Cell Applications. The course will be targeted for first year graduate students and senior-level undergraduate students. The course will use a lecture and discussion format to effectively present relevant information. Prerequisite: BIOE 476."
  },
  {
    "course_instance_id": "BIOE 488 Applied Hi-Per Comp Image Sci ACI 77416",
    "course_id": "BIOE 488",
    "course_number": 488,
    "subject": "BIOE",
    "title": "Applied Hi-Per Comp Image Sci",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "ACI",
    "crn": 77416,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Will introduce students to basic principles and practical applications of scientific computing as they relate to problems in machine learning and computed imaging. In this self-contained course, students will be introduced to a variety of important topics that underlie real-world machine learning and biomedical image computing tasks that are not typically comprised in a single course. The material will be presented in a practical way that will be accessible to engineering students who have a moderate level of experience in scientific computing but lack specific training in computer science. The emphasis will be on immediate applicability of scientific computing techniques as opposed to theoretical knowledge. The course will begin with an overview of good scientific coding practices in Python and introductions to canonical computing architectures. Subsequently, parallel computing concepts will be surveyed that address multi-core CPU and GPU-enabled systems. Distributed GPU computing on a cluster will also be covered. The salient aspects of TensorFlow and/or other relevant machine learning programming environments will be introduced and utilized in applications of machine learning.",
    "prerequisites": "Familiarity with the Python programming language",
    "admin_notes": "3 undergraduate hours. 3 graduate hours. Prerequisite: Familiarity with the Python programming language. Restricted to students with senior undergraduate or graduate standing in an engineering major. Undergraduate students interested in enrolling should contact Stacy Fournier at sh4nier3@illinois.edu to request an override.",
    "topics": [
      "Will introduce students to basic principles and practical applications of scientific computing as they relate to problems in machine learning and computed imaging",
      "In this self-contained course, students will be introduced to a variety of important topics that underlie real-world machine learning and biomedical image computing tasks that are not typically comprised in a single course",
      "The material will be presented in a practical way that will be accessible to engineering students who have a moderate level of experience in scientific computing but lack specific training in computer science",
      "The emphasis will be on immediate applicability of scientific computing techniques as opposed to theoretical knowledge",
      "The course will begin with an overview of good scientific coding practices in Python and introductions to canonical computing architectures",
      "Subsequently, parallel computing concepts will be surveyed that address multi-core CPU and GPU-enabled systems",
      "Distributed GPU computing on a cluster will also be covered",
      "The salient aspects of TensorFlow and/or other relevant machine learning programming environments will be introduced and utilized in applications of machine learning"
    ],
    "embedding_text": "BIOE 488 Applied Hi-Per Comp Image Sci. Will introduce students to basic principles and practical applications of scientific computing as they relate to problems in machine learning and computed imaging. In this self-contained course, students will be introduced to a variety of important topics that underlie real-world machine learning and biomedical image computing tasks that are not typically comprised in a single course. The material will be presented in a practical way that will be accessible to engineering students who have a moderate level of experience in scientific computing but lack specific training in computer science. The emphasis will be on immediate applicability of scientific computing techniques as opposed to theoretical knowledge. The course will begin with an overview of good scientific coding practices in Python and introductions to canonical computing architectures. Subsequently, parallel computing concepts will be surveyed that address multi-core CPU and GPU-enabled systems. Distributed GPU computing on a cluster will also be covered. The salient aspects of TensorFlow and/or other relevant machine learning programming environments will be introduced and utilized in applications of machine learning. Prerequisite: Familiarity with the Python programming language."
  },
  {
    "course_instance_id": "BIOE 489 Ethics in Biomed App of ML EB1 80483",
    "course_id": "BIOE 489",
    "course_number": 489,
    "subject": "BIOE",
    "title": "Ethics in Biomed App of ML",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "EB1",
    "crn": 80483,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "The application of machine learning (ML) to medical image data is an area of intense, well-funded research. Due to practical logistics, however, the ideas expounded in published research articles do not necessarily translate perfectly into clinical implementation. The purposeful design and assessment of machine learning experiments will be introduced and revisited throughout the course. The financial cost of training, data acquisition and expert labelling will be considered in the context of product delivery. Some relevant university, corporate and governmental regulatory policies will be presented by expert guest lecturers. Specific issues of clinical implementation and adoption of new technology will be covered. The ethics of using images influenced or analyzed by ML in patient care and/or medical research will be explored in depth. Topics include: diagnosis accuracy, mandated system upgrades, informed consent, patient privacy, researcher/vendor liability and the role and reliability of federal regulations in ethical application of ML to biomedical data. The policies and procedures of NIH study sections and internal review boards will be highlighted and some key issues related to intellectual property will be surveyed.",
    "prerequisites": "Restricted to students with senior undergraduate or graduate standing and familiarity with machine learning principles",
    "admin_notes": "3 undergraduate hours. 4 graduate hours. Prerequisite: Restricted to students with senior undergraduate or graduate standing and familiarity with machine learning principles.",
    "topics": [
      "The application of machine learning (ML) to medical image data is an area of intense, well-funded research",
      "Due to practical logistics, however, the ideas expounded in published research articles do not necessarily translate perfectly into clinical implementation",
      "The purposeful design and assessment of machine learning experiments will be introduced and revisited throughout the course",
      "The financial cost of training, data acquisition and expert labelling will be considered in the context of product delivery",
      "Some relevant university, corporate and governmental regulatory policies will be presented by expert guest lecturers",
      "Specific issues of clinical implementation and adoption of new technology will be covered",
      "The ethics of using images influenced or analyzed by ML in patient care and/or medical research will be explored in depth",
      "Topics include: diagnosis accuracy, mandated system upgrades, informed consent, patient privacy, researcher/vendor liability and the role and reliability of federal regulations in ethical application of ML to biomedical data",
      "The policies and procedures of NIH study sections and internal review boards will be highlighted and some key issues related to intellectual property will be surveyed"
    ],
    "embedding_text": "BIOE 489 Ethics in Biomed App of ML. The application of machine learning (ML) to medical image data is an area of intense, well-funded research. Due to practical logistics, however, the ideas expounded in published research articles do not necessarily translate perfectly into clinical implementation. The purposeful design and assessment of machine learning experiments will be introduced and revisited throughout the course. The financial cost of training, data acquisition and expert labelling will be considered in the context of product delivery. Some relevant university, corporate and governmental regulatory policies will be presented by expert guest lecturers. Specific issues of clinical implementation and adoption of new technology will be covered. The ethics of using images influenced or analyzed by ML in patient care and/or medical research will be explored in depth. Topics include: diagnosis accuracy, mandated system upgrades, informed consent, patient privacy, researcher/vendor liability and the role and reliability of federal regulations in ethical application of ML to biomedical data. The policies and procedures of NIH study sections and internal review boards will be highlighted and some key issues related to intellectual property will be surveyed. Prerequisite: Restricted to students with senior undergraduate or graduate standing and familiarity with machine learning principles."
  },
  {
    "course_instance_id": "BIOE 497 Individual Study 0 47930",
    "course_id": "BIOE 497",
    "course_number": 497,
    "subject": "BIOE",
    "title": "Individual Study",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Independent Study",
    "section_number": "0",
    "crn": 47930,
    "credit_hours": 1,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Special project or reading activity.",
    "prerequisites": "Approved written application to department as specified by department or instructor",
    "admin_notes": "1 to 4 undergraduate hours. 1 to 4 graduate hours. May be repeated up to 8 hours in a term to a maximum of 12 total hours. Prerequisite: Approved written application to department as specified by department or instructor.",
    "topics": [
      "Special project or reading activity"
    ],
    "embedding_text": "BIOE 497 Individual Study. Special project or reading activity. Prerequisite: Approved written application to department as specified by department or instructor."
  },
  {
    "course_instance_id": "BIOE 498 Soft Robotics SR1 58781",
    "course_id": "BIOE 498",
    "course_number": 498,
    "subject": "BIOE",
    "title": "Soft Robotics",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "SR1",
    "crn": 58781,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Subject offerings of new and developing areas of knowledge in bioengineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites.",
    "prerequisites": null,
    "admin_notes": "1 to 4 undergraduate hours. 1 to 4 graduate hours. May be repeated if topics vary. In this design course, we will explore soft materials used for devices to interface with humans, mimic natural systems, and improve upon traditional robots. Students will: (1) Explore fundamentals of polymer chemistry and flexible sensors. (2) Read and discuss current literature in the field. (3) Build actuators and sensors using polymer molding, Arduino controls (no prior experience necessary). (4) Design novel advances in bioinspired, wearable, or implantable soft robots.",
    "topics": [
      "Subject offerings of new and developing areas of knowledge in bioengineering intended to augment the existing curriculum",
      "See Class Schedule or departmental course information for topics and prerequisites"
    ],
    "embedding_text": "BIOE 498 Soft Robotics. Subject offerings of new and developing areas of knowledge in bioengineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites."
  },
  {
    "course_instance_id": "BIOE 498 Surgical Technologies ST1 70240",
    "course_id": "BIOE 498",
    "course_number": 498,
    "subject": "BIOE",
    "title": "Surgical Technologies",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "ST1",
    "crn": 70240,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Subject offerings of new and developing areas of knowledge in bioengineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites.",
    "prerequisites": null,
    "admin_notes": "1 to 4 undergraduate hours. 1 to 4 graduate hours. May be repeated if topics vary. This course will introduce students to technologies in use and in development for surgical procedures. Content will span surgical methodologies, instruments, and biomaterials, including advanced topics in intraoperative imaging, minimally invasive procedures, and surgical robotics. The course will focus on engineering and design principles with guest lectures by clinicians and MedTech industry specialists. Prerequisites: BIOE 205, BIOE 302, BIOE 303, and BIOE 414, or their equivalents.",
    "topics": [
      "Subject offerings of new and developing areas of knowledge in bioengineering intended to augment the existing curriculum",
      "See Class Schedule or departmental course information for topics and prerequisites"
    ],
    "embedding_text": "BIOE 498 Surgical Technologies. Subject offerings of new and developing areas of knowledge in bioengineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites."
  },
  {
    "course_instance_id": "BIOE 499 Senior Thesis 0 62533",
    "course_id": "BIOE 499",
    "course_number": 499,
    "subject": "BIOE",
    "title": "Senior Thesis",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Independent Study",
    "section_number": "0",
    "crn": 62533,
    "credit_hours": 1,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Limited in general to seniors in the curriculum in bioengineering. Any others must have the consent of the department chief advisor. Each student taking the course must register in a minimum of 5 hours either in one term or divided over two terms.",
    "prerequisites": "Senior Standing",
    "admin_notes": "1 to 5 undergraduate hours. No graduate credit. May be repeated to a maximum of 10 hours between two semesters. Prerequisite: Senior Standing.",
    "topics": [
      "Limited in general to seniors in the curriculum in bioengineering",
      "Any others must have the consent of the department chief advisor",
      "Each student taking the course must register in a minimum of 5 hours either in one term or divided over two terms"
    ],
    "embedding_text": "BIOE 499 Senior Thesis. Limited in general to seniors in the curriculum in bioengineering. Any others must have the consent of the department chief advisor. Each student taking the course must register in a minimum of 5 hours either in one term or divided over two terms. Prerequisite: Senior Standing."
  },
  {
    "course_instance_id": "BIOE 500 Graduate Seminar A 47917",
    "course_id": "BIOE 500",
    "course_number": 500,
    "subject": "BIOE",
    "title": "Graduate Seminar",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "A",
    "crn": 47917,
    "credit_hours": 1,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Lecture surveying a broad range of Bioengineering topics.",
    "prerequisites": null,
    "admin_notes": "Approved for S/U grading only. May be repeated in separate terms to a maximum of 4 hours.",
    "topics": [
      "Lecture surveying a broad range of Bioengineering topics"
    ],
    "embedding_text": "BIOE 500 Graduate Seminar. Lecture surveying a broad range of Bioengineering topics."
  },
  {
    "course_instance_id": "BIOE 502 Bioengineering Professionalism B 67463",
    "course_id": "BIOE 502",
    "course_number": 502,
    "subject": "BIOE",
    "title": "Bioengineering Professionalism",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "B",
    "crn": 67463,
    "credit_hours": 2,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Ethical questions and conduct, procedures, and professional standards in the practice of bioengineering. Authorship and mentoring, use of animal and human subjects, conflict of interest, ethical behavior in scientific research, intellectual property, and approval processes for drugs and biomedical devices.",
    "prerequisites": null,
    "admin_notes": null,
    "topics": [
      "Ethical questions and conduct, procedures, and professional standards in the practice of bioengineering",
      "Authorship and mentoring, use of animal and human subjects, conflict of interest, ethical behavior in scientific research, intellectual property, and approval processes for drugs and biomedical devices"
    ],
    "embedding_text": "BIOE 502 Bioengineering Professionalism. Ethical questions and conduct, procedures, and professional standards in the practice of bioengineering. Authorship and mentoring, use of animal and human subjects, conflict of interest, ethical behavior in scientific research, intellectual property, and approval processes for drugs and biomedical devices."
  },
  {
    "course_instance_id": "BIOE 505 Computational Bioengineering CB 54270",
    "course_id": "BIOE 505",
    "course_number": 505,
    "subject": "BIOE",
    "title": "Computational Bioengineering",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "CB",
    "crn": 54270,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Mathematical and statistical models plus accompanying computational techniques central to many aspects of systems biology and bioengineering research. Theory of supervised and unsupervised learning; linear models; dimension reduction; Monte Carlo computation; analysis of gene expression data and genome sequence data; modeling of gene transcription network signaling pathways.",
    "prerequisites": "STAT 400",
    "admin_notes": "Same as CSE 505. Prerequisite: STAT 400. Seats will be released to non-majors on Monday, August 18, 2025.",
    "topics": [
      "Mathematical and statistical models plus accompanying computational techniques central to many aspects of systems biology and bioengineering research",
      "Theory of supervised and unsupervised learning",
      "dimension reduction",
      "Monte Carlo computation",
      "analysis of gene expression data and genome sequence data",
      "modeling of gene transcription network signaling pathways"
    ],
    "embedding_text": "BIOE 505 Computational Bioengineering. Mathematical and statistical models plus accompanying computational techniques central to many aspects of systems biology and bioengineering research. Theory of supervised and unsupervised learning; linear models; dimension reduction; Monte Carlo computation; analysis of gene expression data and genome sequence data; modeling of gene transcription network signaling pathways. Prerequisite: STAT 400."
  },
  {
    "course_instance_id": "BIOE 516 Advanced Biosensors AL1 79777",
    "course_id": "BIOE 516",
    "course_number": 516,
    "subject": "BIOE",
    "title": "Advanced Biosensors",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "AL1",
    "crn": 79777,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Fundamental principles at the intersection of engineering, biology, and data science that are pushing the forefront of biosensor technology used for diagnostics and life science research Same as  * HYPERLINK \"https://catalog.illinois.edu/search/?P=BIOE%20516\" BIOE 516 . Prerequisite:  * HYPERLINK \"https://catalog.illinois.edu/search/?P=ECE%20416\" ECE 416 .",
    "prerequisites": null,
    "admin_notes": null,
    "topics": [
      "Fundamental principles at the intersection of engineering, biology, and data science that are pushing the forefront of biosensor technology used for diagnostics and life science research Same as  * HYPERLINK \"https://catalog",
      "edu/search/?P=BIOE%20516\" BIOE 516",
      "Prerequisite:  * HYPERLINK \"https://catalog",
      "edu/search/?P=ECE%20416\" ECE 416"
    ],
    "embedding_text": "BIOE 516 Advanced Biosensors. Fundamental principles at the intersection of engineering, biology, and data science that are pushing the forefront of biosensor technology used for diagnostics and life science research Same as  * HYPERLINK \"https://catalog.illinois.edu/search/?P=BIOE%20516\" BIOE 516 . Prerequisite:  * HYPERLINK \"https://catalog.illinois.edu/search/?P=ECE%20416\" ECE 416 ."
  },
  {
    "course_instance_id": "BIOE 526 Advances in Biotechnology AB1 76518",
    "course_id": "BIOE 526",
    "course_number": 526,
    "subject": "BIOE",
    "title": "Advances in Biotechnology",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "AB1",
    "crn": 76518,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "From protein design to genetic engineering and regenerative medicine to spatial omics, Advances in Biotechnology will expose students to many of the cutting-edge technologies that are revolutionizing the study of biological systems and the detection and treatment of diseases.",
    "prerequisites": "Knowledge equivalent to an advanced molecular and cellular biology course is recommended",
    "admin_notes": "Prerequisite: Knowledge equivalent to an advanced molecular and cellular biology course is recommended.",
    "topics": [
      "From protein design to genetic engineering and regenerative medicine to spatial omics, Advances in Biotechnology will expose students to many of the cutting-edge technologies that are revolutionizing the study of biological systems and the detection and treatment of diseases"
    ],
    "embedding_text": "BIOE 526 Advances in Biotechnology. From protein design to genetic engineering and regenerative medicine to spatial omics, Advances in Biotechnology will expose students to many of the cutting-edge technologies that are revolutionizing the study of biological systems and the detection and treatment of diseases. Prerequisite: Knowledge equivalent to an advanced molecular and cellular biology course is recommended."
  },
  {
    "course_instance_id": "BIOE 570 Seminar Series SSC 63432",
    "course_id": "BIOE 570",
    "course_number": 570,
    "subject": "BIOE",
    "title": "Seminar Series",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "SSC",
    "crn": 63432,
    "credit_hours": 1,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Guest topics will vary, but will typically cover topics of current interest relevant to the bioengineering field. Lecture and discussion on topics relevant to the development, regulatory approval, marketing, and application of systems used in the fields of biomedical imaging, life science research, and pharmaceutical discovery. Emphasis upon case studies on topics that will include regulatory approval, intellectual property, strategy, and technology innovation.",
    "prerequisites": "For students enrolled in the M",
    "admin_notes": "Approved for S/U grading only. May be repeated up to 2 hours in separate terms. Prerequisite: For students enrolled in the M.Eng. in Bioengineering degree program.",
    "topics": [
      "Guest topics will vary, but will typically cover topics of current interest relevant to the bioengineering field",
      "Lecture and discussion on topics relevant to the development, regulatory approval, marketing, and application of systems used in the fields of biomedical imaging, life science research, and pharmaceutical discovery",
      "Emphasis upon case studies on topics that will include regulatory approval, intellectual property, strategy, and technology innovation"
    ],
    "embedding_text": "BIOE 570 Seminar Series. Guest topics will vary, but will typically cover topics of current interest relevant to the bioengineering field. Lecture and discussion on topics relevant to the development, regulatory approval, marketing, and application of systems used in the fields of biomedical imaging, life science research, and pharmaceutical discovery. Emphasis upon case studies on topics that will include regulatory approval, intellectual property, strategy, and technology innovation. Prerequisite: For students enrolled in the M."
  },
  {
    "course_instance_id": "BIOE 572 Biological Measurement II BM2 63435",
    "course_id": "BIOE 572",
    "course_number": 572,
    "subject": "BIOE",
    "title": "Biological Measurement II",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "BM2",
    "crn": 63435,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "With special focus on medical imaging, learn about advanced techniques relating to state-of-the-art bioinstrumentation technologies. Topics will broadly include fluorescence, genomic and proteomic diagnostics, biosensors, ultrasound imaging, microscopy and their uses relevant to physiological changes related to major human diseases.",
    "prerequisites": "BIOE 571",
    "admin_notes": "Prerequisite: BIOE 571. For students enrolled in the M.Eng in Bioengineering degree program.",
    "topics": [
      "With special focus on medical imaging, learn about advanced techniques relating to state-of-the-art bioinstrumentation technologies",
      "Topics will broadly include fluorescence, genomic and proteomic diagnostics, biosensors, ultrasound imaging, microscopy and their uses relevant to physiological changes related to major human diseases"
    ],
    "embedding_text": "BIOE 572 Biological Measurement II. With special focus on medical imaging, learn about advanced techniques relating to state-of-the-art bioinstrumentation technologies. Topics will broadly include fluorescence, genomic and proteomic diagnostics, biosensors, ultrasound imaging, microscopy and their uses relevant to physiological changes related to major human diseases. Prerequisite: BIOE 571."
  },
  {
    "course_instance_id": "BIOE 573 Managing Business Operations MB 64758",
    "course_id": "BIOE 573",
    "course_number": 573,
    "subject": "BIOE",
    "title": "Managing Business Operations",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "MB",
    "crn": 64758,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Introduction to fundamental principles of design, management, and improvement of business operations and product innovations. Strategies and techniques for managing processes, projects, process improvement and new product development.",
    "prerequisites": "For students enrolled in the M",
    "admin_notes": "Prerequisite: For students enrolled in the M.Eng in Bioengineering degree program.",
    "topics": [
      "Introduction to fundamental principles of design, management, and improvement of business operations and product innovations",
      "Strategies and techniques for managing processes, projects, process improvement and new product development"
    ],
    "embedding_text": "BIOE 573 Managing Business Operations. Introduction to fundamental principles of design, management, and improvement of business operations and product innovations. Strategies and techniques for managing processes, projects, process improvement and new product development. Prerequisite: For students enrolled in the M."
  },
  {
    "course_instance_id": "BIOE 574 Inno/Financial Decision Making LEC 63437",
    "course_id": "BIOE 574",
    "course_number": 574,
    "subject": "BIOE",
    "title": "Inno/Financial Decision Making",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "LEC",
    "crn": 63437,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Tools, concepts, and analytical frameworks that enhance the ability to define and analyze strategic problems stemming from innovation and technological change, and to identify sources of competitive advantage from both an industry and firm-level perspective. Introduction to financial decision making, including topics in valuation, project analysis and risk-return relationships.",
    "prerequisites": "For students enrolled in the M",
    "admin_notes": "Prerequisite: For students enrolled in the M.Eng. in Bioengineering degree program only.",
    "topics": [
      "Tools, concepts, and analytical frameworks that enhance the ability to define and analyze strategic problems stemming from innovation and technological change, and to identify sources of competitive advantage from both an industry and firm-level perspective",
      "Introduction to financial decision making, including topics in valuation, project analysis and risk-return relationships"
    ],
    "embedding_text": "BIOE 574 Inno/Financial Decision Making. Tools, concepts, and analytical frameworks that enhance the ability to define and analyze strategic problems stemming from innovation and technological change, and to identify sources of competitive advantage from both an industry and firm-level perspective. Introduction to financial decision making, including topics in valuation, project analysis and risk-return relationships. Prerequisite: For students enrolled in the M."
  },
  {
    "course_instance_id": "BIOE 575 Capstone Project CPC 66788",
    "course_id": "BIOE 575",
    "course_number": 575,
    "subject": "BIOE",
    "title": "Capstone Project",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "CPC",
    "crn": 66788,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Students in the Master of Engineering (M.Eng.) in Bioengineering program will demonstrate their proficiency through a capstone project, where students will work on a translational project to develop solutions for real world problems utilizing principles of design, engineering analysis, and functional operation of engineering systems. Depending on the student's flexibility and availability, capstone projects may include collaboration with other online M.Eng. students on a team-based project, analysis of case studies, or even a self-directed project that directly relates to a specific area of interest or on behalf of their employer. Project presentations and demonstrations may be required at the end of the program.",
    "prerequisites": "Proficiency in MATLAB and completion of or concurrent enrollment in core classes required for the Master of Engineering (M",
    "admin_notes": "May be repeated for 6 hours in separate semesters. Students in the Master of Engineering program will be required to sign up for BIOE 575 in both the Fall and Spring semesters. Prerequisite: Proficiency in MATLAB and completion of or concurrent enrollment in core classes required for the Master of Engineering (M.Eng.) in Bioengineering program. Class only available to students in the M.Eng. in Bioengineering degree program. Location will be arranged by your instructor.",
    "topics": [
      "Students in the Master of Engineering (M",
      ") in Bioengineering program will demonstrate their proficiency through a capstone project, where students will work on a translational project to develop solutions for real world problems utilizing principles of design, engineering analysis, and functional operation of engineering systems",
      "Depending on the student's flexibility and availability, capstone projects may include collaboration with other online M",
      "students on a team-based project, analysis of case studies, or even a self-directed project that directly relates to a specific area of interest or on behalf of their employer",
      "Project presentations and demonstrations may be required at the end of the program"
    ],
    "embedding_text": "BIOE 575 Capstone Project. Students in the Master of Engineering (M.Eng.) in Bioengineering program will demonstrate their proficiency through a capstone project, where students will work on a translational project to develop solutions for real world problems utilizing principles of design, engineering analysis, and functional operation of engineering systems. Depending on the student's flexibility and availability, capstone projects may include collaboration with other online M.Eng. students on a team-based project, analysis of case studies, or even a self-directed project that directly relates to a specific area of interest or on behalf of their employer. Project presentations and demonstrations may be required at the end of the program. Prerequisite: Proficiency in MATLAB and completion of or concurrent enrollment in core classes required for the Master of Engineering (M."
  },
  {
    "course_instance_id": "BIOE 580 Foundations of Imaging Science FIO 77093",
    "course_id": "BIOE 580",
    "course_number": 580,
    "subject": "BIOE",
    "title": "Foundations of Imaging Science",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "FIO",
    "crn": 77093,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Exposes students to a broad treatment of the mathematical and statistical principles of biomedical imaging. In addition to providing a foundation for understanding general principles of image formation and objective image quality assessment that are widely applicable, this material will be essential for the principled and successful application of artificial intelligence methods in biomedical imaging. This course will cover the mathematical concepts needed for the deterministic analysis of imaging systems. Linear operator theory will be employed to describe continuous-to-continuous, continuous-to-discrete, and discrete-to-discrete mappings from objects to images. In addition, imaging systems will be analyzed in a statistical framework where stochastic models for objects and images will be introduced. Methodologies for objective assessment of image quality (OAIQ) will be introduced, which will address classification tasks, receiver operator characteristic (ROC) analysis, and salient aspects estimation theory. An introduction to numerical observers for quantification of OAIQ will be provided.",
    "prerequisites": "Concurrent enrollment in BIOE 485 and BIOE 483; or instructor approval",
    "admin_notes": "Prerequisite: Concurrent enrollment in BIOE 485 and BIOE 483; or instructor approval. Restricted to students with graduate standing or consent of instructor.",
    "topics": [
      "Exposes students to a broad treatment of the mathematical and statistical principles of biomedical imaging",
      "In addition to providing a foundation for understanding general principles of image formation and objective image quality assessment that are widely applicable, this material will be essential for the principled and successful application of artificial intelligence methods in biomedical imaging",
      "This course will cover the mathematical concepts needed for the deterministic analysis of imaging systems",
      "Linear operator theory will be employed to describe continuous-to-continuous, continuous-to-discrete, and discrete-to-discrete mappings from objects to images",
      "In addition, imaging systems will be analyzed in a statistical framework where stochastic models for objects and images will be introduced",
      "Methodologies for objective assessment of image quality (OAIQ) will be introduced, which will address classification tasks, receiver operator characteristic (ROC) analysis, and salient aspects estimation theory",
      "An introduction to numerical observers for quantification of OAIQ will be provided"
    ],
    "embedding_text": "BIOE 580 Foundations of Imaging Science. Exposes students to a broad treatment of the mathematical and statistical principles of biomedical imaging. In addition to providing a foundation for understanding general principles of image formation and objective image quality assessment that are widely applicable, this material will be essential for the principled and successful application of artificial intelligence methods in biomedical imaging. This course will cover the mathematical concepts needed for the deterministic analysis of imaging systems. Linear operator theory will be employed to describe continuous-to-continuous, continuous-to-discrete, and discrete-to-discrete mappings from objects to images. In addition, imaging systems will be analyzed in a statistical framework where stochastic models for objects and images will be introduced. Methodologies for objective assessment of image quality (OAIQ) will be introduced, which will address classification tasks, receiver operator characteristic (ROC) analysis, and salient aspects estimation theory. An introduction to numerical observers for quantification of OAIQ will be provided. Prerequisite: Concurrent enrollment in BIOE 485 and BIOE 483; or instructor approval."
  },
  {
    "course_instance_id": "BIOE 588 Biomedical Image Computing Cap CL1 74085",
    "course_id": "BIOE 588",
    "course_number": 588,
    "subject": "BIOE",
    "title": "Biomedical Image Computing Cap",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "CL1",
    "crn": 74085,
    "credit_hours": 1,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "This journal-club style course will expose students to the modern literature on biomedical imaging and machine learning. Students will be exposed to cutting edge topics in the rapidly evolving field of biomedical image computing. Additionally, the course will prepare students for the capstone project in the Biomedical Image Computing MS degree program that will take place in the third semester of the program. During this course, students will interact with potential project mentors and engage in detailed literature reviews related to potential projects.",
    "prerequisites": "Graduate student standing",
    "admin_notes": "Approved for S/U grading only. Prerequisite: Graduate student standing. Concurrent enrollment in BIOE 484 and BIOE 486 is required. Restricted to students in the Biomedical Image Computing M.S. degree program only.",
    "topics": [
      "This journal-club style course will expose students to the modern literature on biomedical imaging and machine learning",
      "Students will be exposed to cutting edge topics in the rapidly evolving field of biomedical image computing",
      "Additionally, the course will prepare students for the capstone project in the Biomedical Image Computing MS degree program that will take place in the third semester of the program",
      "During this course, students will interact with potential project mentors and engage in detailed literature reviews related to potential projects"
    ],
    "embedding_text": "BIOE 588 Biomedical Image Computing Cap. This journal-club style course will expose students to the modern literature on biomedical imaging and machine learning. Students will be exposed to cutting edge topics in the rapidly evolving field of biomedical image computing. Additionally, the course will prepare students for the capstone project in the Biomedical Image Computing MS degree program that will take place in the third semester of the program. During this course, students will interact with potential project mentors and engage in detailed literature reviews related to potential projects. Prerequisite: Graduate student standing."
  },
  {
    "course_instance_id": "BIOE 589 Biomed Img Comp Capstone Prjct BIC 78141",
    "course_id": "BIOE 589",
    "course_number": 589,
    "subject": "BIOE",
    "title": "Biomed Img Comp Capstone Prjct",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "BIC",
    "crn": 78141,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "In this course students will complete a project that utilizes machine learning methods and advanced computational tools to solve a problem related to bioimaging. The projects will utilize experimental bioimage data that is contributed by a project sponsor and/or available via open source databases. While these projects need not be publishable or perfectly novel, they will involve the systematic application and evaluation of machine learning and image computing methods. It is expected that, by solving actual problems posed by industry or clinical partners, students will gain marketable experience but, ideally, also will make inroads with their future employers.",
    "prerequisites": "BIOE 588, BIOE 484, BIOE 486, BIOE 580",
    "admin_notes": "Prerequisite: BIOE 588, BIOE 484, BIOE 486, BIOE 580. Concurrent enrollmment in BIOE 489 is required. Restricted to students enrolled in the Biomedical Image Computing MS degree program only.",
    "topics": [
      "In this course students will complete a project that utilizes machine learning methods and advanced computational tools to solve a problem related to bioimaging",
      "The projects will utilize experimental bioimage data that is contributed by a project sponsor and/or available via open source databases",
      "While these projects need not be publishable or perfectly novel, they will involve the systematic application and evaluation of machine learning and image computing methods",
      "It is expected that, by solving actual problems posed by industry or clinical partners, students will gain marketable experience but, ideally, also will make inroads with their future employers"
    ],
    "embedding_text": "BIOE 589 Biomed Img Comp Capstone Prjct. In this course students will complete a project that utilizes machine learning methods and advanced computational tools to solve a problem related to bioimaging. The projects will utilize experimental bioimage data that is contributed by a project sponsor and/or available via open source databases. While these projects need not be publishable or perfectly novel, they will involve the systematic application and evaluation of machine learning and image computing methods. It is expected that, by solving actual problems posed by industry or clinical partners, students will gain marketable experience but, ideally, also will make inroads with their future employers. Prerequisite: BIOE 588, BIOE 484, BIOE 486, BIOE 580."
  },
  {
    "course_instance_id": "BIOE 597 Individual Study 0 10413",
    "course_id": "BIOE 597",
    "course_number": 597,
    "subject": "BIOE",
    "title": "Individual Study",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Independent Study",
    "section_number": "0",
    "crn": 10413,
    "credit_hours": 1,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Special project or reading activity.",
    "prerequisites": "Approved written application to department as specified by department or instructor",
    "admin_notes": "May be repeated. Prerequisite: Approved written application to department as specified by department or instructor.",
    "topics": [
      "Special project or reading activity"
    ],
    "embedding_text": "BIOE 597 Individual Study. Special project or reading activity. Prerequisite: Approved written application to department as specified by department or instructor."
  },
  {
    "course_instance_id": "BIOE 598 Principles of Bioinstrumentati PBG 58418",
    "course_id": "BIOE 598",
    "course_number": 598,
    "subject": "BIOE",
    "title": "Principles of Bioinstrumentati",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "PBG",
    "crn": 58418,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Subject offerings of new and developing areas of knowledge in bioengineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites.",
    "prerequisites": null,
    "admin_notes": "May be repeated in the same or separate terms if topics vary. This course will provide a refresher and expansion of engineering aspects of the detection, acquisition, processing, and display of signals from living systems, including the use of biomedical sensors for the measurements of biopotentials, ions, and gases in aqueous solution, force, displacement, blood pressure, blood flow, the electrical activity of the heart, respiration, and temperature. Students will learn and practice the medical instrumentation design and function through case-based learning, broadening the knowledge of engineering fundamentals in circuit and systems theory and hands-on activities. This class is only for on campus graduate students interested in enrolling.",
    "topics": [
      "Subject offerings of new and developing areas of knowledge in bioengineering intended to augment the existing curriculum",
      "See Class Schedule or departmental course information for topics and prerequisites"
    ],
    "embedding_text": "BIOE 598 Principles of Bioinstrumentati. Subject offerings of new and developing areas of knowledge in bioengineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites."
  },
  {
    "course_instance_id": "BIOE 598 Soft Robotics SR1 64185",
    "course_id": "BIOE 598",
    "course_number": 598,
    "subject": "BIOE",
    "title": "Soft Robotics",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "SR1",
    "crn": 64185,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Subject offerings of new and developing areas of knowledge in bioengineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites.",
    "prerequisites": null,
    "admin_notes": "May be repeated in the same or separate terms if topics vary. In this design course, we will explore soft materials used for devices to interface with humans, mimic natural systems, and improve upon traditional robots. Students will: (1) Explore fundamentals of polymer chemistry and flexible sensors. (2) Read and discuss current literature in the field. (3) Build actuators and sensors using polymer molding, Arduino controls (no prior experience necessary). (4) Design novel advances in bioinspired, wearable, or implantable soft robots. Please contact sh4nier3@illinois.edu to enroll in this course and request an override. Seats will be released to non-majors on Monday, August 18, 2025.",
    "topics": [
      "Subject offerings of new and developing areas of knowledge in bioengineering intended to augment the existing curriculum",
      "See Class Schedule or departmental course information for topics and prerequisites"
    ],
    "embedding_text": "BIOE 598 Soft Robotics. Subject offerings of new and developing areas of knowledge in bioengineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites."
  },
  {
    "course_instance_id": "BIOE 598 Surgical Technologies ST1 70280",
    "course_id": "BIOE 598",
    "course_number": 598,
    "subject": "BIOE",
    "title": "Surgical Technologies",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "ST1",
    "crn": 70280,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Subject offerings of new and developing areas of knowledge in bioengineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites.",
    "prerequisites": null,
    "admin_notes": "May be repeated in the same or separate terms if topics vary. This course will introduce students to technologies in use and in development for surgical procedures. Content will span surgical methodologies, instruments, and biomaterials, including advanced topics in intraoperative imaging, minimally invasive procedures, and surgical robotics. The course will focus on engineering and design principles with guest lectures by clinicians and MedTech industry specialists. Seats will be released to non-majors on Monday, August 18, 2025.",
    "topics": [
      "Subject offerings of new and developing areas of knowledge in bioengineering intended to augment the existing curriculum",
      "See Class Schedule or departmental course information for topics and prerequisites"
    ],
    "embedding_text": "BIOE 598 Surgical Technologies. Subject offerings of new and developing areas of knowledge in bioengineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites."
  },
  {
    "course_instance_id": "BIOE 598 Tech for Cancer Diag & Therapy TC1 65893",
    "course_id": "BIOE 598",
    "course_number": 598,
    "subject": "BIOE",
    "title": "Tech for Cancer Diag & Therapy",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "TC1",
    "crn": 65893,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Subject offerings of new and developing areas of knowledge in bioengineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites.",
    "prerequisites": null,
    "admin_notes": "May be repeated in the same or separate terms if topics vary. Technologies for Cancer Diagnosis and Therapy provides an introduction to how cancer is diagnosed and treated, focusing on related fundamental concepts in cancer biology and bioengineering. One major goal is for students to become comfortable integrating principles from physics, chemistry, engineering, and biology related to current strategies for understanding, detecting, and treating cancer. A second major goal is for students to understand and assess innovative solutions to current limitations in the field, and to use this information to generate a research proposal in the format of an NIH R21, which will be written and reviewed throughout the course term. The materials and content are designed for first year graduate students and senior undergraduate students from diverse majors. Recommended Prerequisites: BIOE 206 and CHEM 232, or equivalent knowledge. Seats will be released to non-majors on Monday, August 18, 2025.",
    "topics": [
      "Subject offerings of new and developing areas of knowledge in bioengineering intended to augment the existing curriculum",
      "See Class Schedule or departmental course information for topics and prerequisites"
    ],
    "embedding_text": "BIOE 598 Tech for Cancer Diag & Therapy. Subject offerings of new and developing areas of knowledge in bioengineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites."
  }
]