[
  {
    "course_instance_id": "CEE 190 Project-Based Intro to CEE PBL 75476",
    "course_id": "CEE 190",
    "course_number": 190,
    "subject": "CEE",
    "title": "Project-Based Intro to CEE",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "PBL",
    "crn": 75476,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Allows first year and transfer students to explore topics in Civil and Environmental Engineering through a project-based learning format. The course also develops competencies in critical skills such as technical writing in CEE, data management and computation, and design thinking in a collaborative team environment.",
    "prerequisites": null,
    "admin_notes": "Credit is not given for both CEE 190 and CEE 195. Due to high enrollment, CEE 190 will use room 1017 - Civil and Environmental Engineering Building (CEEB) as an overflow room.",
    "topics": [
      "Allows first year and transfer students to explore topics in Civil and Environmental Engineering through a project-based learning format",
      "The course also develops competencies in critical skills such as technical writing in CEE, data management and computation, and design thinking in a collaborative team environment"
    ],
    "embedding_text": "CEE 190 Project-Based Intro to CEE. Allows first year and transfer students to explore topics in Civil and Environmental Engineering through a project-based learning format. The course also develops competencies in critical skills such as technical writing in CEE, data management and computation, and design thinking in a collaborative team environment."
  },
  {
    "course_instance_id": "CEE 201 Systems Engrg & Economics NP 29694",
    "course_id": "CEE 201",
    "course_number": 201,
    "subject": "CEE",
    "title": "Systems Engrg & Economics",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "NP",
    "crn": 29694,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Introduction to the formulation and solution of optimization problems in civil engineering from a quantitative economics-based perspective, integrated with the computational tool Python. Topics include engineering economics, classical optimization, linear and integer programming, network optimization problems, critical path methods, and decision theory.",
    "prerequisites": "MATH 231; CS 101 or CS 124; credit or concurrent registration in MATH 257 or MATH 415",
    "admin_notes": "Credit is not given for both CEE 201 and IE 310. Prerequisite: MATH 231; CS 101 or CS 124; credit or concurrent registration in MATH 257 or MATH 415. Prerequisites and concurrent registration will be enforced. Student who have not met these will be removed from this course.",
    "topics": [
      "Introduction to the formulation and solution of optimization problems in civil engineering from a quantitative economics-based perspective, integrated with the computational tool Python",
      "Topics include engineering economics, classical optimization, linear and integer programming, network optimization problems, critical path methods, and decision theory"
    ],
    "embedding_text": "CEE 201 Systems Engrg & Economics. Introduction to the formulation and solution of optimization problems in civil engineering from a quantitative economics-based perspective, integrated with the computational tool Python. Topics include engineering economics, classical optimization, linear and integer programming, network optimization problems, critical path methods, and decision theory. Prerequisite: MATH 231; CS 101 or CS 124; credit or concurrent registration in MATH 257 or MATH 415."
  },
  {
    "course_instance_id": "CEE 202 Engineering Risk & Uncertainty LM 29696",
    "course_id": "CEE 202",
    "course_number": 202,
    "subject": "CEE",
    "title": "Engineering Risk & Uncertainty",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "LM",
    "crn": 29696,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Identification and modeling of non-deterministic problems in civil engineering design and decision making integrated with the computational tool R. Introductory course on development of stochastic concepts and simulation models with application to design and decision problems in various areas of civil engineering.",
    "prerequisites": "Credit in CS 101 or CS 124; Credit or concurrent registration in MATH 241",
    "admin_notes": "Credit is not given for both CEE 202 and IE 300. Prerequisite: Credit in CS 101 or CS 124; Credit or concurrent registration in MATH 241. Prerequisites and concurrent registration will be enforced. Student who have not met these will be removed from this course.",
    "topics": [
      "Identification and modeling of non-deterministic problems in civil engineering design and decision making integrated with the computational tool R",
      "Introductory course on development of stochastic concepts and simulation models with application to design and decision problems in various areas of civil engineering"
    ],
    "embedding_text": "CEE 202 Engineering Risk & Uncertainty. Identification and modeling of non-deterministic problems in civil engineering design and decision making integrated with the computational tool R. Introductory course on development of stochastic concepts and simulation models with application to design and decision problems in various areas of civil engineering. Prerequisite: Credit in CS 101 or CS 124; Credit or concurrent registration in MATH 241."
  },
  {
    "course_instance_id": "CEE 300 Behavior of Materials AB1 33358",
    "course_id": "CEE 300",
    "course_number": 300,
    "subject": "CEE",
    "title": "Behavior of Materials",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Laboratory",
    "section_number": "AB1",
    "crn": 33358,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Macroscopic mechanical behavior in terms of phenomena at the nanometer and micrometer levels for the three types of engineering materials (metals, ceramics, and polymers) with emphasis on specific materials used in civil engineering -- steel, rocks, clay, portland cement concrete, asphaltic concrete, and wood.",
    "prerequisites": "Completion of Composition I general education requirement; CHEM 104; TAM 251",
    "admin_notes": "Same as TAM 324. Credit is not given for both CEE 300 and either ME 330 or MSE 280. Prerequisite: Completion of Composition I general education requirement; CHEM 104; TAM 251. Class Schedule Information: Students must register for one lab and one lecture section.",
    "topics": [
      "Macroscopic mechanical behavior in terms of phenomena at the nanometer and micrometer levels for the three types of engineering materials (metals, ceramics, and polymers) with emphasis on specific materials used in civil engineering -- steel, rocks, clay, portland cement concrete, asphaltic concrete, and wood"
    ],
    "embedding_text": "CEE 300 Behavior of Materials. Macroscopic mechanical behavior in terms of phenomena at the nanometer and micrometer levels for the three types of engineering materials (metals, ceramics, and polymers) with emphasis on specific materials used in civil engineering -- steel, rocks, clay, portland cement concrete, asphaltic concrete, and wood. Prerequisite: Completion of Composition I general education requirement; CHEM 104; TAM 251."
  },
  {
    "course_instance_id": "CEE 310 Transportation Engineering TE 29699",
    "course_id": "CEE 310",
    "course_number": 310,
    "subject": "CEE",
    "title": "Transportation Engineering",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "TE",
    "crn": 29699,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Design, planning, operation, management, and maintenance of transportation systems; integrated multi-modal transportation systems (highways, air, rail, etc.); layout of highways, airports, and railroads with traffic flow models, capacity analysis, and safety. Design of facilities and systems with life cycle costing procedures and criteria for optimization.",
    "prerequisites": "TAM 251; credit or concurrent registration in CEE 202",
    "admin_notes": "Prerequisite: TAM 251; credit or concurrent registration in CEE 202.",
    "topics": [
      "Design, planning, operation, management, and maintenance of transportation systems",
      "integrated multi-modal transportation systems (highways, air, rail, etc",
      "layout of highways, airports, and railroads with traffic flow models, capacity analysis, and safety",
      "Design of facilities and systems with life cycle costing procedures and criteria for optimization"
    ],
    "embedding_text": "CEE 310 Transportation Engineering. Design, planning, operation, management, and maintenance of transportation systems; integrated multi-modal transportation systems (highways, air, rail, etc.); layout of highways, airports, and railroads with traffic flow models, capacity analysis, and safety. Design of facilities and systems with life cycle costing procedures and criteria for optimization. Prerequisite: TAM 251; credit or concurrent registration in CEE 202."
  },
  {
    "course_instance_id": "CEE 320 Construction Engineering CE 29701",
    "course_id": "CEE 320",
    "course_number": 320,
    "subject": "CEE",
    "title": "Construction Engineering",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "CE",
    "crn": 29701,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Construction engineering processes: contracting and bonding, planning and scheduling, estimating and project control, productivity models, and construction econometrics.",
    "prerequisites": "CEE 201; credit or concurrent registration in CS 101 and CEE 202",
    "admin_notes": "Prerequisite: CEE 201; credit or concurrent registration in CS 101 and CEE 202.",
    "topics": [
      "Construction engineering processes: contracting and bonding, planning and scheduling, estimating and project control, productivity models, and construction econometrics"
    ],
    "embedding_text": "CEE 320 Construction Engineering. Construction engineering processes: contracting and bonding, planning and scheduling, estimating and project control, productivity models, and construction econometrics. Prerequisite: CEE 201; credit or concurrent registration in CS 101 and CEE 202."
  },
  {
    "course_instance_id": "CEE 330 Environmental Engineering EES 29702",
    "course_id": "CEE 330",
    "course_number": 330,
    "subject": "CEE",
    "title": "Environmental Engineering",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "EES",
    "crn": 29702,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Sources, characteristics, transport, and effects of air and water contaminants; biological, chemical, and physical processes in water; atmospheric structure and composition; unit operations for air and water quality control; solid waste management; environmental quality standards.",
    "prerequisites": "CHEM 104 or CHEM 204",
    "admin_notes": "Prerequisite: CHEM 104 or CHEM 204.",
    "topics": [
      "Sources, characteristics, transport, and effects of air and water contaminants",
      "biological, chemical, and physical processes in water",
      "atmospheric structure and composition",
      "unit operations for air and water quality control",
      "solid waste management",
      "environmental quality standards"
    ],
    "embedding_text": "CEE 330 Environmental Engineering. Sources, characteristics, transport, and effects of air and water contaminants; biological, chemical, and physical processes in water; atmospheric structure and composition; unit operations for air and water quality control; solid waste management; environmental quality standards. Prerequisite: CHEM 104 or CHEM 204."
  },
  {
    "course_instance_id": "CEE 331 Fluid Dynamics in the Environm FD1 78437",
    "course_id": "CEE 331",
    "course_number": 331,
    "subject": "CEE",
    "title": "Fluid Dynamics in the Environm",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Packaged Section",
    "section_number": "FD1",
    "crn": 78437,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Fundamentals of fluid motion and transport processes in the natural, managed, and built environment. Focus on physical understanding of the behavior of fluids for applications in natural and engineering challenges. Hydrostatics, dimensional analysis, equations of incompressible fluid motion, open channel flow, flow in porous media, groundwater, pipe flow, boundary layers, drag and lift, turbulence, fluids and energy, are covered within a global context to emphasize the role of fluid dynamics on the environment within the framework of the hydrologic cycle in nature and in the built environment.",
    "prerequisites": "TAM 211",
    "admin_notes": "Credit is not given for CEE 331 and either TAM 335 or ME 310. Prerequisite: TAM 211. Credit or concurrent registration in TAM 212.",
    "topics": [
      "Fundamentals of fluid motion and transport processes in the natural, managed, and built environment",
      "Focus on physical understanding of the behavior of fluids for applications in natural and engineering challenges",
      "Hydrostatics, dimensional analysis, equations of incompressible fluid motion, open channel flow, flow in porous media, groundwater, pipe flow, boundary layers, drag and lift, turbulence, fluids and energy, are covered within a global context to emphasize the role of fluid dynamics on the environment within the framework of the hydrologic cycle in nature and in the built environment"
    ],
    "embedding_text": "CEE 331 Fluid Dynamics in the Environm. Fundamentals of fluid motion and transport processes in the natural, managed, and built environment. Focus on physical understanding of the behavior of fluids for applications in natural and engineering challenges. Hydrostatics, dimensional analysis, equations of incompressible fluid motion, open channel flow, flow in porous media, groundwater, pipe flow, boundary layers, drag and lift, turbulence, fluids and energy, are covered within a global context to emphasize the role of fluid dynamics on the environment within the framework of the hydrologic cycle in nature and in the built environment. Prerequisite: TAM 211."
  },
  {
    "course_instance_id": "CEE 340 Energy and Global Environment EGE 64871",
    "course_id": "CEE 340",
    "course_number": 340,
    "subject": "CEE",
    "title": "Energy and Global Environment",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "EGE",
    "crn": 64871,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Introduction to evaluating multiple impacts of engineering decisions. Topics include mass and chemical balances; effects of engineered systems on local and global environment, health, and risk; economic, consumer, and social considerations; provision of conventional and renewable energy; and future projections. Design projects emphasize making appropriate decisions by quantifying total impact and evaluating social environment.",
    "prerequisites": "PHYS 211; PHYS 213 or ME200; CEE 201 or IE 310; CEE 202, IE 300, or STAT 200",
    "admin_notes": "Approved for Letter and S/U grading. Prerequisite: PHYS 211; PHYS 213 or ME200; CEE 201 or IE 310; CEE 202, IE 300, or STAT 200.",
    "topics": [
      "Introduction to evaluating multiple impacts of engineering decisions",
      "Topics include mass and chemical balances",
      "effects of engineered systems on local and global environment, health, and risk",
      "economic, consumer, and social considerations",
      "provision of conventional and renewable energy",
      "and future projections",
      "Design projects emphasize making appropriate decisions by quantifying total impact and evaluating social environment"
    ],
    "embedding_text": "CEE 340 Energy and Global Environment. Introduction to evaluating multiple impacts of engineering decisions. Topics include mass and chemical balances; effects of engineered systems on local and global environment, health, and risk; economic, consumer, and social considerations; provision of conventional and renewable energy; and future projections. Design projects emphasize making appropriate decisions by quantifying total impact and evaluating social environment. Prerequisite: PHYS 211; PHYS 213 or ME200; CEE 201 or IE 310; CEE 202, IE 300, or STAT 200."
  },
  {
    "course_instance_id": "CEE 350 Water Resources Engineering WRE 29704",
    "course_id": "CEE 350",
    "course_number": 350,
    "subject": "CEE",
    "title": "Water Resources Engineering",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "WRE",
    "crn": 29704,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Quantitative aspects of water in the earth's environment and its engineering implications, including design and analysis of systems directly concerned with use and control of water; quantitative introduction to hydrology, hydraulic engineering, and water resources planning.",
    "prerequisites": "CEE 202; credit or concurrent registration in CEE 201",
    "admin_notes": "Prerequisite: CEE 202; credit or concurrent registration in CEE 201.",
    "topics": [
      "Quantitative aspects of water in the earth's environment and its engineering implications, including design and analysis of systems directly concerned with use and control of water",
      "quantitative introduction to hydrology, hydraulic engineering, and water resources planning"
    ],
    "embedding_text": "CEE 350 Water Resources Engineering. Quantitative aspects of water in the earth's environment and its engineering implications, including design and analysis of systems directly concerned with use and control of water; quantitative introduction to hydrology, hydraulic engineering, and water resources planning. Prerequisite: CEE 202; credit or concurrent registration in CEE 201."
  },
  {
    "course_instance_id": "CEE 360 Structural Engineering ST 29706",
    "course_id": "CEE 360",
    "course_number": 360,
    "subject": "CEE",
    "title": "Structural Engineering",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "ST",
    "crn": 29706,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Analysis, behavior, and design of trusses and framed structures under static loads; member forces in trusses, shear and moment diagrams, deflections, simple applications of the force method and slope-deflection; computer applications.",
    "prerequisites": "TAM 251",
    "admin_notes": "Prerequisite: TAM 251.",
    "topics": [
      "Analysis, behavior, and design of trusses and framed structures under static loads",
      "member forces in trusses, shear and moment diagrams, deflections, simple applications of the force method and slope-deflection",
      "computer applications"
    ],
    "embedding_text": "CEE 360 Structural Engineering. Analysis, behavior, and design of trusses and framed structures under static loads; member forces in trusses, shear and moment diagrams, deflections, simple applications of the force method and slope-deflection; computer applications. Prerequisite: TAM 251."
  },
  {
    "course_instance_id": "CEE 380 Geotechnical Engineering B 29708",
    "course_id": "CEE 380",
    "course_number": 380,
    "subject": "CEE",
    "title": "Geotechnical Engineering",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "B",
    "crn": 29708,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Classification of soils, compaction in the laboratory and in the field, soil exploration, boring and sampling, permeability of soils, one-dimensional settlement analyses, strength of soil, and foundations.",
    "prerequisites": "TAM 251",
    "admin_notes": "Prerequisite: TAM 251.",
    "topics": [
      "Classification of soils, compaction in the laboratory and in the field, soil exploration, boring and sampling, permeability of soils, one-dimensional settlement analyses, strength of soil, and foundations"
    ],
    "embedding_text": "CEE 380 Geotechnical Engineering. Classification of soils, compaction in the laboratory and in the field, soil exploration, boring and sampling, permeability of soils, one-dimensional settlement analyses, strength of soil, and foundations. Prerequisite: TAM 251."
  },
  {
    "course_instance_id": "CEE 401 Concrete Properties & 3D Print AB1 29713",
    "course_id": "CEE 401",
    "course_number": 401,
    "subject": "CEE",
    "title": "Concrete Properties & 3D Print",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Laboratory",
    "section_number": "AB1",
    "crn": 29713,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Engineering application of cementitious materials requires a deep understanding of concrete properties and the role of each of its constituents (cements, water, aggregates, and admixtures) and examination of the underlying hydration behavior for desired fresh (workability and placement) and hardened (strength, volumetric stability, and durability) concrete properties. These fundamental topics are reinforced through hands-on laboratory exercises and a concrete 3D printing design challenge.",
    "prerequisites": "CEE 300",
    "admin_notes": "4 undergraduate hours. 4 graduate hours. Prerequisite: CEE 300.",
    "topics": [
      "Engineering application of cementitious materials requires a deep understanding of concrete properties and the role of each of its constituents (cements, water, aggregates, and admixtures) and examination of the underlying hydration behavior for desired fresh (workability and placement) and hardened (strength, volumetric stability, and durability) concrete properties",
      "These fundamental topics are reinforced through hands-on laboratory exercises and a concrete 3D printing design challenge"
    ],
    "embedding_text": "CEE 401 Concrete Properties & 3D Print. Engineering application of cementitious materials requires a deep understanding of concrete properties and the role of each of its constituents (cements, water, aggregates, and admixtures) and examination of the underlying hydration behavior for desired fresh (workability and placement) and hardened (strength, volumetric stability, and durability) concrete properties. These fundamental topics are reinforced through hands-on laboratory exercises and a concrete 3D printing design challenge. Prerequisite: CEE 300."
  },
  {
    "course_instance_id": "CEE 405 Asphalt Materials I 3A 31541",
    "course_id": "CEE 405",
    "course_number": 405,
    "subject": "CEE",
    "title": "Asphalt Materials I",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Packaged Section",
    "section_number": "3A",
    "crn": 31541,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Properties and control testing of bituminous materials, aggregates for bituminous mixtures, and analysis and design of asphalt concrete and liquid asphalt cold mixtures; structural properties of bituminous mixes; surface treatment design; recycling of mixtures.",
    "prerequisites": "CEE 310",
    "admin_notes": "3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CEE 310.",
    "topics": [
      "Properties and control testing of bituminous materials, aggregates for bituminous mixtures, and analysis and design of asphalt concrete and liquid asphalt cold mixtures",
      "structural properties of bituminous mixes",
      "surface treatment design",
      "recycling of mixtures"
    ],
    "embedding_text": "CEE 405 Asphalt Materials I. Properties and control testing of bituminous materials, aggregates for bituminous mixtures, and analysis and design of asphalt concrete and liquid asphalt cold mixtures; structural properties of bituminous mixes; surface treatment design; recycling of mixtures. Prerequisite: CEE 310."
  },
  {
    "course_instance_id": "CEE 406 Pavement Design I 3 29731",
    "course_id": "CEE 406",
    "course_number": 406,
    "subject": "CEE",
    "title": "Pavement Design I",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "3",
    "crn": 29731,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Analysis, behavior, performance, and structural design of highway flexible and rigid pavements; climate factors, drainage, traffic loading analysis, and life cycle cost analysis.",
    "prerequisites": "CEE 310",
    "admin_notes": "3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CEE 310.",
    "topics": [
      "Analysis, behavior, performance, and structural design of highway flexible and rigid pavements",
      "climate factors, drainage, traffic loading analysis, and life cycle cost analysis"
    ],
    "embedding_text": "CEE 406 Pavement Design I. Analysis, behavior, performance, and structural design of highway flexible and rigid pavements; climate factors, drainage, traffic loading analysis, and life cycle cost analysis. Prerequisite: CEE 310."
  },
  {
    "course_instance_id": "CEE 407 Airport Design C3 60579",
    "course_id": "CEE 407",
    "course_number": 407,
    "subject": "CEE",
    "title": "Airport Design",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "C3",
    "crn": 60579,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Basic principles of airport facilities design to include aircraft operational characteristics, noise, site selection, land use compatibility, operational area, ground access and egress, terminals, ground service areas, airport capacity, and special types of airports.",
    "prerequisites": null,
    "admin_notes": "3 undergraduate hours. 3 or 4 graduate hours.",
    "topics": [
      "Basic principles of airport facilities design to include aircraft operational characteristics, noise, site selection, land use compatibility, operational area, ground access and egress, terminals, ground service areas, airport capacity, and special types of airports"
    ],
    "embedding_text": "CEE 407 Airport Design. Basic principles of airport facilities design to include aircraft operational characteristics, noise, site selection, land use compatibility, operational area, ground access and egress, terminals, ground service areas, airport capacity, and special types of airports."
  },
  {
    "course_instance_id": "CEE 408 Railroad Transportation Engrg E3 53742",
    "course_id": "CEE 408",
    "course_number": 408,
    "subject": "CEE",
    "title": "Railroad Transportation Engrg",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "E3",
    "crn": 53742,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Principles and analysis of railroad transportation efficiency, economics, energy, and engineering; effect on production and markets. Railroad infrastructure; locomotive and rolling stock design, function, and operation. Computation of train speed, power, and acceleration requirements; railway traffic control and signaling. Quantitative analytical tools for rail-transportation decision-making and optimization. Field trip to observe railroad infrastructure, equipment and operations.",
    "prerequisites": "CEE 310",
    "admin_notes": "3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CEE 310.",
    "topics": [
      "Principles and analysis of railroad transportation efficiency, economics, energy, and engineering",
      "effect on production and markets",
      "Railroad infrastructure",
      "locomotive and rolling stock design, function, and operation",
      "Computation of train speed, power, and acceleration requirements",
      "railway traffic control and signaling",
      "Quantitative analytical tools for rail-transportation decision-making and optimization",
      "Field trip to observe railroad infrastructure, equipment and operations"
    ],
    "embedding_text": "CEE 408 Railroad Transportation Engrg. Principles and analysis of railroad transportation efficiency, economics, energy, and engineering; effect on production and markets. Railroad infrastructure; locomotive and rolling stock design, function, and operation. Computation of train speed, power, and acceleration requirements; railway traffic control and signaling. Quantitative analytical tools for rail-transportation decision-making and optimization. Field trip to observe railroad infrastructure, equipment and operations. Prerequisite: CEE 310."
  },
  {
    "course_instance_id": "CEE 409 Railroad Track Engineering ONC 78536",
    "course_id": "CEE 409",
    "course_number": 409,
    "subject": "CEE",
    "title": "Railroad Track Engineering",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "ONC",
    "crn": 78536,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Railroad track engineering concepts including track component and system design, construction, evaluation, maintenance, load distribution, and wheel-rail interaction. Design and analysis tools for railroad track engineering and maintenance. Field trip to observe railroad track system and components.",
    "prerequisites": "CEE 310",
    "admin_notes": "3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CEE 310.",
    "topics": [
      "Railroad track engineering concepts including track component and system design, construction, evaluation, maintenance, load distribution, and wheel-rail interaction",
      "Design and analysis tools for railroad track engineering and maintenance",
      "Field trip to observe railroad track system and components"
    ],
    "embedding_text": "CEE 409 Railroad Track Engineering. Railroad track engineering concepts including track component and system design, construction, evaluation, maintenance, load distribution, and wheel-rail interaction. Design and analysis tools for railroad track engineering and maintenance. Field trip to observe railroad track system and components. Prerequisite: CEE 310."
  },
  {
    "course_instance_id": "CEE 410 Railway Signaling & Control ONL 60842",
    "course_id": "CEE 410",
    "course_number": 410,
    "subject": "CEE",
    "title": "Railway Signaling & Control",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "ONL",
    "crn": 60842,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Railway traffic control and signaling systems; train performance and scheduling tools; analysis of temporal and spatial separation of trains for safety and efficiency; train movement authority and operating rules, track circuit and wireless train position monitoring technology; interlocking design; railroad capacity modeling tools; economic analysis of traffic control system design, optimization, and selection. Field trip to observe signal system infrastructure and railway traffic operations control center.",
    "prerequisites": "CEE 310",
    "admin_notes": "3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CEE 310. Restricted to online non-degree, online MSCE, online MSEE, online MCS, online MSAE, online MSME, online MSIE, online ME, and online MEng students. For more details on this course section, please see http://engineering.illinois.edu/online/courses/. Non-Degree students may enroll on a space-available basis with consent of Program Coordinator, Meg Griffin (mgriffin@illinois.edu).",
    "topics": [
      "Railway traffic control and signaling systems",
      "train performance and scheduling tools",
      "analysis of temporal and spatial separation of trains for safety and efficiency",
      "train movement authority and operating rules, track circuit and wireless train position monitoring technology",
      "interlocking design",
      "railroad capacity modeling tools",
      "economic analysis of traffic control system design, optimization, and selection",
      "Field trip to observe signal system infrastructure and railway traffic operations control center"
    ],
    "embedding_text": "CEE 410 Railway Signaling & Control. Railway traffic control and signaling systems; train performance and scheduling tools; analysis of temporal and spatial separation of trains for safety and efficiency; train movement authority and operating rules, track circuit and wireless train position monitoring technology; interlocking design; railroad capacity modeling tools; economic analysis of traffic control system design, optimization, and selection. Field trip to observe signal system infrastructure and railway traffic operations control center. Prerequisite: CEE 310."
  },
  {
    "course_instance_id": "CEE 411 RR Project Design & Constr ONC 71007",
    "course_id": "CEE 411",
    "course_number": 411,
    "subject": "CEE",
    "title": "RR Project Design & Constr",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "ONC",
    "crn": 71007,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Critical elements in the development and planning of railroad construction projects; project economic justification; route alternative analysis procedures; cost estimation; site civil design; computer-aided track design; surveying; construction management; construction procedures for typical railroad projects. Design project covering a typical railroad capital construction projects. Field trip to observe the construction of a railroad capital project.",
    "prerequisites": "CEE 310",
    "admin_notes": "3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CEE 310. Students in this section will complete this course completely online except for the following which must be completed on-campus: Exams (will be completed in the classroom with the instructor/TA), Homework/exam sessions, Office Hours. Contact Becky Stillwell (rborden@illinois.edu), Meg Griffin (mgriffn@illinois.edu), and the course instructor for permission to register.",
    "topics": [
      "Critical elements in the development and planning of railroad construction projects",
      "project economic justification",
      "route alternative analysis procedures",
      "cost estimation",
      "site civil design",
      "computer-aided track design",
      "construction management",
      "construction procedures for typical railroad projects",
      "Design project covering a typical railroad capital construction projects",
      "Field trip to observe the construction of a railroad capital project"
    ],
    "embedding_text": "CEE 411 RR Project Design & Constr. Critical elements in the development and planning of railroad construction projects; project economic justification; route alternative analysis procedures; cost estimation; site civil design; computer-aided track design; surveying; construction management; construction procedures for typical railroad projects. Design project covering a typical railroad capital construction projects. Field trip to observe the construction of a railroad capital project. Prerequisite: CEE 310."
  },
  {
    "course_instance_id": "CEE 412 High-Speed Rail Engineering E3 71926",
    "course_id": "CEE 412",
    "course_number": 412,
    "subject": "CEE",
    "title": "High-Speed Rail Engineering",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "E3",
    "crn": 71926,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Development, engineering, design and construction of high-speed rail (HSR) passenger transport systems with particular emphasis on the unique engineering elements of HSR technology. Key elements of HSR systems and subsystems including: core systems (trains, power, signal, communication and control), track system and civil infrastructure (earthwork, bridges, viaducts and tunnels). Also covered are basic design and construction of HSR stations and rolling stock maintenance facilities.",
    "prerequisites": null,
    "admin_notes": "3 undergraduate hours. 4 graduate hours.",
    "topics": [
      "Development, engineering, design and construction of high-speed rail (HSR) passenger transport systems with particular emphasis on the unique engineering elements of HSR technology",
      "Key elements of HSR systems and subsystems including: core systems (trains, power, signal, communication and control), track system and civil infrastructure (earthwork, bridges, viaducts and tunnels)",
      "Also covered are basic design and construction of HSR stations and rolling stock maintenance facilities"
    ],
    "embedding_text": "CEE 412 High-Speed Rail Engineering. Development, engineering, design and construction of high-speed rail (HSR) passenger transport systems with particular emphasis on the unique engineering elements of HSR technology. Key elements of HSR systems and subsystems including: core systems (trains, power, signal, communication and control), track system and civil infrastructure (earthwork, bridges, viaducts and tunnels). Also covered are basic design and construction of HSR stations and rolling stock maintenance facilities."
  },
  {
    "course_instance_id": "CEE 415 Geometric Design of Roads ONC 77561",
    "course_id": "CEE 415",
    "course_number": 415,
    "subject": "CEE",
    "title": "Geometric Design of Roads",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "ONC",
    "crn": 77561,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Highway classification; analysis of factors in developing a transportation facility; highway geometrics design and safety standards; roadway design element; human factors in roadway design; roadway location principles; intersection, interchange, and ramp design; drainage factors.",
    "prerequisites": "CEE 310",
    "admin_notes": "4 undergraduate hours. 4 graduate hours. Prerequisite: CEE 310.",
    "topics": [
      "Highway classification",
      "analysis of factors in developing a transportation facility",
      "highway geometrics design and safety standards",
      "roadway design element",
      "human factors in roadway design",
      "roadway location principles",
      "intersection, interchange, and ramp design",
      "drainage factors"
    ],
    "embedding_text": "CEE 415 Geometric Design of Roads. Highway classification; analysis of factors in developing a transportation facility; highway geometrics design and safety standards; roadway design element; human factors in roadway design; roadway location principles; intersection, interchange, and ramp design; drainage factors. Prerequisite: CEE 310."
  },
  {
    "course_instance_id": "CEE 416 Traffic Capacity Analysis 3 29733",
    "course_id": "CEE 416",
    "course_number": 416,
    "subject": "CEE",
    "title": "Traffic Capacity Analysis",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "3",
    "crn": 29733,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Fundamentals of traffic engineering; analysis of traffic stream characteristics; capacity of urban and rural highways; design and analysis of traffic signals and intersections; traffic control; traffic impact studies; traffic accidents.",
    "prerequisites": "CEE 310",
    "admin_notes": "3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CEE 310.",
    "topics": [
      "Fundamentals of traffic engineering",
      "analysis of traffic stream characteristics",
      "capacity of urban and rural highways",
      "design and analysis of traffic signals and intersections",
      "traffic control",
      "traffic impact studies",
      "traffic accidents"
    ],
    "embedding_text": "CEE 416 Traffic Capacity Analysis. Fundamentals of traffic engineering; analysis of traffic stream characteristics; capacity of urban and rural highways; design and analysis of traffic signals and intersections; traffic control; traffic impact studies; traffic accidents. Prerequisite: CEE 310."
  },
  {
    "course_instance_id": "CEE 417 Urban Transportation Planning LB 66565",
    "course_id": "CEE 417",
    "course_number": 417,
    "subject": "CEE",
    "title": "Urban Transportation Planning",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "LB",
    "crn": 66565,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Role of transportation in urban development and planning; characteristics of urban-person transportation systems and methods of analysis and forecasting of urban-person transportation demand; transportation systems management and capital improvement programming; and emphasis on the needs and activities of metropolitan planning organizations. Same as  * HYPERLINK \"https://catalog.illinois.edu/search/?P=CEE%20417\" CEE 417 . 4 undergraduate hours. 4 graduate hours.",
    "prerequisites": null,
    "admin_notes": null,
    "topics": [
      "Role of transportation in urban development and planning",
      "characteristics of urban-person transportation systems and methods of analysis and forecasting of urban-person transportation demand",
      "transportation systems management and capital improvement programming",
      "and emphasis on the needs and activities of metropolitan planning organizations",
      "Same as  * HYPERLINK \"https://catalog",
      "edu/search/?P=CEE%20417\" CEE 417",
      "4 undergraduate hours",
      "4 graduate hours"
    ],
    "embedding_text": "CEE 417 Urban Transportation Planning. Role of transportation in urban development and planning; characteristics of urban-person transportation systems and methods of analysis and forecasting of urban-person transportation demand; transportation systems management and capital improvement programming; and emphasis on the needs and activities of metropolitan planning organizations. Same as  * HYPERLINK \"https://catalog.illinois.edu/search/?P=CEE%20417\" CEE 417 . 4 undergraduate hours. 4 graduate hours."
  },
  {
    "course_instance_id": "CEE 418 Public Transportation Systems ONC 68213",
    "course_id": "CEE 418",
    "course_number": 418,
    "subject": "CEE",
    "title": "Public Transportation Systems",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "ONC",
    "crn": 68213,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Transit systems basics, demand issues, design standards, economic and sustainability implications. Transit service planning for shuttle, corridor, and network systems, hybrid hierarchical systems, paratransit and demand-responsive services. Management of transit systems, fleet operations, and crew scheduling. Operational issues, vehicle movement, headway and schedule control.",
    "prerequisites": "CEE 310 or equivalent",
    "admin_notes": "3 undergraduate hours. 4 graduate hours. Prerequisite: CEE 310 or equivalent. Students in this section will complete this course completely online except for the following which must be completed on-campus: Exams (will be completed in the classroom with the instructor/TA), Homework/exam sessions, Office Hours. Contact Becky Stillwell (rborden@illinois.edu), Meg Griffin (mgriffn@illinois.edu), and the course instructor for permission to register.",
    "topics": [
      "Transit systems basics, demand issues, design standards, economic and sustainability implications",
      "Transit service planning for shuttle, corridor, and network systems, hybrid hierarchical systems, paratransit and demand-responsive services",
      "Management of transit systems, fleet operations, and crew scheduling",
      "Operational issues, vehicle movement, headway and schedule control"
    ],
    "embedding_text": "CEE 418 Public Transportation Systems. Transit systems basics, demand issues, design standards, economic and sustainability implications. Transit service planning for shuttle, corridor, and network systems, hybrid hierarchical systems, paratransit and demand-responsive services. Management of transit systems, fleet operations, and crew scheduling. Operational issues, vehicle movement, headway and schedule control. Prerequisite: CEE 310 or equivalent."
  },
  {
    "course_instance_id": "CEE 419 Transportation Economics ONC 76136",
    "course_id": "CEE 419",
    "course_number": 419,
    "subject": "CEE",
    "title": "Transportation Economics",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "ONC",
    "crn": 76136,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Uses analytical and numerical models of decision-making to analyze phenomena such as traffic congestion, apply vocabulary and techniques from economics, and to explore ways to provide and regulate transportation. Students will write Python code for optimization, simulation, visualization and choice modelling. Engineers will gain from learning to think rigorously about the fact that the humans in the systems they design make their own choices.",
    "prerequisites": "CEE 310",
    "admin_notes": "4 undergraduate hours. 4 graduate hours. Prerequisite: CEE 310.",
    "topics": [
      "Uses analytical and numerical models of decision-making to analyze phenomena such as traffic congestion, apply vocabulary and techniques from economics, and to explore ways to provide and regulate transportation",
      "Students will write Python code for optimization, simulation, visualization and choice modelling",
      "Engineers will gain from learning to think rigorously about the fact that the humans in the systems they design make their own choices"
    ],
    "embedding_text": "CEE 419 Transportation Economics. Uses analytical and numerical models of decision-making to analyze phenomena such as traffic congestion, apply vocabulary and techniques from economics, and to explore ways to provide and regulate transportation. Students will write Python code for optimization, simulation, visualization and choice modelling. Engineers will gain from learning to think rigorously about the fact that the humans in the systems they design make their own choices. Prerequisite: CEE 310."
  },
  {
    "course_instance_id": "CEE 420 Construction Productivity 3 39554",
    "course_id": "CEE 420",
    "course_number": 420,
    "subject": "CEE",
    "title": "Construction Productivity",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "3",
    "crn": 39554,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Application of scientific principles to the measurement and forecasting of productivity in construction engineering. Conceptual and mathematical formulation of labor, equipment, and material factors affecting productivity.",
    "prerequisites": "CEE 320",
    "admin_notes": "3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CEE 320.",
    "topics": [
      "Application of scientific principles to the measurement and forecasting of productivity in construction engineering",
      "Conceptual and mathematical formulation of labor, equipment, and material factors affecting productivity"
    ],
    "embedding_text": "CEE 420 Construction Productivity. Application of scientific principles to the measurement and forecasting of productivity in construction engineering. Conceptual and mathematical formulation of labor, equipment, and material factors affecting productivity. Prerequisite: CEE 320."
  },
  {
    "course_instance_id": "CEE 421 Construction Planning LM3 31712",
    "course_id": "CEE 421",
    "course_number": 421,
    "subject": "CEE",
    "title": "Construction Planning",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "LM3",
    "crn": 31712,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Project definition; scheduling and control models; material, labor, and equipment allocation; optimal schedules; project organization; documentation and reporting systems; management and control.",
    "prerequisites": "CEE 320",
    "admin_notes": "3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CEE 320.",
    "topics": [
      "Project definition",
      "scheduling and control models",
      "material, labor, and equipment allocation",
      "optimal schedules",
      "project organization",
      "documentation and reporting systems",
      "management and control"
    ],
    "embedding_text": "CEE 421 Construction Planning. Project definition; scheduling and control models; material, labor, and equipment allocation; optimal schedules; project organization; documentation and reporting systems; management and control. Prerequisite: CEE 320."
  },
  {
    "course_instance_id": "CEE 422 Construction Cost Analysis 3 29740",
    "course_id": "CEE 422",
    "course_number": 422,
    "subject": "CEE",
    "title": "Construction Cost Analysis",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "3",
    "crn": 29740,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Application of scientific principles to costs and estimates of costs in construction engineering; concepts and statistical measurements of the factors involved in direct costs, general overhead costs, cost markups, and profits; the fundamentals of cost recording for construction cost accounts and cost controls.",
    "prerequisites": "CEE 320",
    "admin_notes": "3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CEE 320.",
    "topics": [
      "Application of scientific principles to costs and estimates of costs in construction engineering",
      "concepts and statistical measurements of the factors involved in direct costs, general overhead costs, cost markups, and profits",
      "the fundamentals of cost recording for construction cost accounts and cost controls"
    ],
    "embedding_text": "CEE 422 Construction Cost Analysis. Application of scientific principles to costs and estimates of costs in construction engineering; concepts and statistical measurements of the factors involved in direct costs, general overhead costs, cost markups, and profits; the fundamentals of cost recording for construction cost accounts and cost controls. Prerequisite: CEE 320."
  },
  {
    "course_instance_id": "CEE 433 Water Technology and Policy ONC 79787",
    "course_id": "CEE 433",
    "course_number": 433,
    "subject": "CEE",
    "title": "Water Technology and Policy",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "ONC",
    "crn": 79787,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "This course will cover technical and social concepts of water and wastewater treatment; water resources; water law, policy, and economics; and water in integrated systems. Emphasis will be on the intersection between engineering and policy. Communication is an important element of this course: engineers will learn to \"speak\" policy via writing assignments, multimedia presentation, and briefings. Course activities include lecture, discussion, presentations, and field trips.",
    "prerequisites": "CEE 340 or CEE 350",
    "admin_notes": "3 undergraduate hours. 4 graduate hours. Prerequisite: CEE 340 or CEE 350.",
    "topics": [
      "This course will cover technical and social concepts of water and wastewater treatment",
      "water resources",
      "water law, policy, and economics",
      "and water in integrated systems",
      "Emphasis will be on the intersection between engineering and policy",
      "Communication is an important element of this course: engineers will learn to \"speak\" policy via writing assignments, multimedia presentation, and briefings",
      "Course activities include lecture, discussion, presentations, and field trips"
    ],
    "embedding_text": "CEE 433 Water Technology and Policy. This course will cover technical and social concepts of water and wastewater treatment; water resources; water law, policy, and economics; and water in integrated systems. Emphasis will be on the intersection between engineering and policy. Communication is an important element of this course: engineers will learn to \"speak\" policy via writing assignments, multimedia presentation, and briefings. Course activities include lecture, discussion, presentations, and field trips. Prerequisite: CEE 340 or CEE 350."
  },
  {
    "course_instance_id": "CEE 434 Environmental Systems I C 29744",
    "course_id": "CEE 434",
    "course_number": 434,
    "subject": "CEE",
    "title": "Environmental Systems I",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "C",
    "crn": 29744,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Introduction to the concepts and applications of environmental systems analysis. Application of mathematical programming and modeling to the design, planning, and management of engineered environmental systems, regional environmental systems, and environmental policy. Economic analysis, including benefit-cost analysis and management strategies. Concepts of tradeoff, non-inferior sets, single- and multi-objective optimization. Practical application to case studies to convey an understanding of the complexity and data collection challenges of actual design practice.",
    "prerequisites": "CEE 201 and CEE 330",
    "admin_notes": "3 undergraduate hours. 3 graduate hours. Prerequisite: CEE 201 and CEE 330.",
    "topics": [
      "Introduction to the concepts and applications of environmental systems analysis",
      "Application of mathematical programming and modeling to the design, planning, and management of engineered environmental systems, regional environmental systems, and environmental policy",
      "Economic analysis, including benefit-cost analysis and management strategies",
      "Concepts of tradeoff, non-inferior sets, single- and multi-objective optimization",
      "Practical application to case studies to convey an understanding of the complexity and data collection challenges of actual design practice"
    ],
    "embedding_text": "CEE 434 Environmental Systems I. Introduction to the concepts and applications of environmental systems analysis. Application of mathematical programming and modeling to the design, planning, and management of engineered environmental systems, regional environmental systems, and environmental policy. Economic analysis, including benefit-cost analysis and management strategies. Concepts of tradeoff, non-inferior sets, single- and multi-objective optimization. Practical application to case studies to convey an understanding of the complexity and data collection challenges of actual design practice. Prerequisite: CEE 201 and CEE 330."
  },
  {
    "course_instance_id": "CEE 435 Public Health Engineering ONC 78818",
    "course_id": "CEE 435",
    "course_number": 435,
    "subject": "CEE",
    "title": "Public Health Engineering",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "ONC",
    "crn": 78818,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Aimed at building a next generation of engineers who are able to incorporate the principles of public health in all engineering designs. The course starts with the basic principles of epidemiology (types, methods, models and limitations). Next, the course covers various modes of environmental toxicity and the models to represent these modes. The course then covers infectious diseases, various models to represent their spread, the effect of environmental factors and the role of public health in breaking the chain of infection. The course also discusses environmental, social and behavioral factors in public health (e.g. environmental tobacco smoke including E-vaping) in the prevalence of chronic diseases. Finally, we cover the topics on public health risk assessment and management. In every aspect of the topic, the role of engineering in solving the problems of public health is explored and emphasized.",
    "prerequisites": "CEE 330",
    "admin_notes": "3 undergraduate hours. 4 graduate hours. Prerequisite: CEE 330. Students in this section will complete this course completely online except for the following which must be completed on-campus: Exams (will be completed in the classroom with the instructor/TA), Homework/exam sessions, Office Hours. Contact Becky Stillwell (rborden@illinois.edu), Meg Griffin (mgriffn@illinois.edu), and the course instructor for permission to register.",
    "topics": [
      "Aimed at building a next generation of engineers who are able to incorporate the principles of public health in all engineering designs",
      "The course starts with the basic principles of epidemiology (types, methods, models and limitations)",
      "Next, the course covers various modes of environmental toxicity and the models to represent these modes",
      "The course then covers infectious diseases, various models to represent their spread, the effect of environmental factors and the role of public health in breaking the chain of infection",
      "The course also discusses environmental, social and behavioral factors in public health (e",
      "environmental tobacco smoke including E-vaping) in the prevalence of chronic diseases",
      "Finally, we cover the topics on public health risk assessment and management",
      "In every aspect of the topic, the role of engineering in solving the problems of public health is explored and emphasized"
    ],
    "embedding_text": "CEE 435 Public Health Engineering. Aimed at building a next generation of engineers who are able to incorporate the principles of public health in all engineering designs. The course starts with the basic principles of epidemiology (types, methods, models and limitations). Next, the course covers various modes of environmental toxicity and the models to represent these modes. The course then covers infectious diseases, various models to represent their spread, the effect of environmental factors and the role of public health in breaking the chain of infection. The course also discusses environmental, social and behavioral factors in public health (e.g. environmental tobacco smoke including E-vaping) in the prevalence of chronic diseases. Finally, we cover the topics on public health risk assessment and management. In every aspect of the topic, the role of engineering in solving the problems of public health is explored and emphasized. Prerequisite: CEE 330."
  },
  {
    "course_instance_id": "CEE 437 Water Quality Engineering F 29749",
    "course_id": "CEE 437",
    "course_number": 437,
    "subject": "CEE",
    "title": "Water Quality Engineering",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "F",
    "crn": 29749,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Fundamental theory underlying the unit processes utilized in the treatment of water for domestic and industrial usage, and in the treatment of domestic and industrial wastewaters.",
    "prerequisites": "CEE 330; credit or concurrent registration CEE 331 or TAM 335",
    "admin_notes": "3 undergraduate hours. 3 graduate hours. Prerequisite: CEE 330; credit or concurrent registration CEE 331 or TAM 335.",
    "topics": [
      "Fundamental theory underlying the unit processes utilized in the treatment of water for domestic and industrial usage, and in the treatment of domestic and industrial wastewaters"
    ],
    "embedding_text": "CEE 437 Water Quality Engineering. Fundamental theory underlying the unit processes utilized in the treatment of water for domestic and industrial usage, and in the treatment of domestic and industrial wastewaters. Prerequisite: CEE 330; credit or concurrent registration CEE 331 or TAM 335."
  },
  {
    "course_instance_id": "CEE 438 Science & Environmental Policy G 63664",
    "course_id": "CEE 438",
    "course_number": 438,
    "subject": "CEE",
    "title": "Science & Environmental Policy",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "G",
    "crn": 63664,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Environmental treaties, the role of science and scientists in managing the national and global environment, effective science communication, scientific assessments, and the use of quantitative tools to inform policy decisions.",
    "prerequisites": "CEE 202 or IE 300, STAT 400, or equivalent introductory probability and statistics course",
    "admin_notes": "3 undergraduate hours. 3 graduate hours. Prerequisite: CEE 202 or IE 300, STAT 400, or equivalent introductory probability and statistics course. Senior and Graduate students.",
    "topics": [
      "Environmental treaties, the role of science and scientists in managing the national and global environment, effective science communication, scientific assessments, and the use of quantitative tools to inform policy decisions"
    ],
    "embedding_text": "CEE 438 Science & Environmental Policy. Environmental treaties, the role of science and scientists in managing the national and global environment, effective science communication, scientific assessments, and the use of quantitative tools to inform policy decisions. Prerequisite: CEE 202 or IE 300, STAT 400, or equivalent introductory probability and statistics course."
  },
  {
    "course_instance_id": "CEE 440 Fate Cleanup Environ Pollutant NP 31718",
    "course_id": "CEE 440",
    "course_number": 440,
    "subject": "CEE",
    "title": "Fate Cleanup Environ Pollutant",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "NP",
    "crn": 31718,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Investigation of the regulatory and technical issues affecting solid and hazardous waste management, with an emphasis on the principles governing the transport, fate, and remediation of solid and hazardous waste in the subsurface, including advection, dispersion, sorption, interphase mass transfer, and transformation reactions.",
    "prerequisites": "CEE 330",
    "admin_notes": "4 undergraduate hours. 4 graduate hours. Prerequisite: CEE 330.",
    "topics": [
      "Investigation of the regulatory and technical issues affecting solid and hazardous waste management, with an emphasis on the principles governing the transport, fate, and remediation of solid and hazardous waste in the subsurface, including advection, dispersion, sorption, interphase mass transfer, and transformation reactions"
    ],
    "embedding_text": "CEE 440 Fate Cleanup Environ Pollutant. Investigation of the regulatory and technical issues affecting solid and hazardous waste management, with an emphasis on the principles governing the transport, fate, and remediation of solid and hazardous waste in the subsurface, including advection, dispersion, sorption, interphase mass transfer, and transformation reactions. Prerequisite: CEE 330."
  },
  {
    "course_instance_id": "CEE 441 Air Pollution AP 77421",
    "course_id": "CEE 441",
    "course_number": 441,
    "subject": "CEE",
    "title": "Air Pollution",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "AP",
    "crn": 77421,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "A design approach to air pollution fate and control for the protection of human health and welfare. Air pollution transport and deposition. Gaussian plume, chemical mass balance models. Gaseous and particulate air pollutant physical and chemical properties and control. Evaluation of air pollutant emission control strategies based on cost and regulatory requirements for compliance with regulatory ambient air quality standards.",
    "prerequisites": "CEE 331 or equivalent; CEE 202 or equivalent",
    "admin_notes": "4 undergraduate hours. 4 graduate hours. Prerequisite: CEE 331 or equivalent; CEE 202 or equivalent.",
    "topics": [
      "A design approach to air pollution fate and control for the protection of human health and welfare",
      "Air pollution transport and deposition",
      "Gaussian plume, chemical mass balance models",
      "Gaseous and particulate air pollutant physical and chemical properties and control",
      "Evaluation of air pollutant emission control strategies based on cost and regulatory requirements for compliance with regulatory ambient air quality standards"
    ],
    "embedding_text": "CEE 441 Air Pollution. A design approach to air pollution fate and control for the protection of human health and welfare. Air pollution transport and deposition. Gaussian plume, chemical mass balance models. Gaseous and particulate air pollutant physical and chemical properties and control. Evaluation of air pollutant emission control strategies based on cost and regulatory requirements for compliance with regulatory ambient air quality standards. Prerequisite: CEE 331 or equivalent; CEE 202 or equivalent."
  },
  {
    "course_instance_id": "CEE 442 Env Eng Principles, Physical B 29746",
    "course_id": "CEE 442",
    "course_number": 442,
    "subject": "CEE",
    "title": "Env Eng Principles, Physical",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "B",
    "crn": 29746,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Analysis of the physical principles which form the basis of many water and air quality-control operations; sedimentation, filtration, inertial separations, flocculation, mixing, and principles of reactor design; energy flows, thermal pollution, earth's energy balance.",
    "prerequisites": "CEE 437",
    "admin_notes": "4 undergraduate hours. 4 graduate hours. Prerequisite: CEE 437.",
    "topics": [
      "Analysis of the physical principles which form the basis of many water and air quality-control operations",
      "sedimentation, filtration, inertial separations, flocculation, mixing, and principles of reactor design",
      "energy flows, thermal pollution, earth's energy balance"
    ],
    "embedding_text": "CEE 442 Env Eng Principles, Physical. Analysis of the physical principles which form the basis of many water and air quality-control operations; sedimentation, filtration, inertial separations, flocculation, mixing, and principles of reactor design; energy flows, thermal pollution, earth's energy balance. Prerequisite: CEE 437."
  },
  {
    "course_instance_id": "CEE 443 Env Eng Principles, Chemical NP 29750",
    "course_id": "CEE 443",
    "course_number": 443,
    "subject": "CEE",
    "title": "Env Eng Principles, Chemical",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "NP",
    "crn": 29750,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Application of principles of chemical equilibrium and chemical kinetics to air and water quality. Thermodynamics, kinetics, acid-base chemistry, complexation, precipitation, dissolution, and oxidation-reduction. Applications.",
    "prerequisites": "CEE 330",
    "admin_notes": "4 undergraduate hours. 4 graduate hours. Prerequisite: CEE 330.",
    "topics": [
      "Application of principles of chemical equilibrium and chemical kinetics to air and water quality",
      "Thermodynamics, kinetics, acid-base chemistry, complexation, precipitation, dissolution, and oxidation-reduction"
    ],
    "embedding_text": "CEE 443 Env Eng Principles, Chemical. Application of principles of chemical equilibrium and chemical kinetics to air and water quality. Thermodynamics, kinetics, acid-base chemistry, complexation, precipitation, dissolution, and oxidation-reduction. Applications. Prerequisite: CEE 330."
  },
  {
    "course_instance_id": "CEE 444 Env Eng Principles, Biological B 69981",
    "course_id": "CEE 444",
    "course_number": 444,
    "subject": "CEE",
    "title": "Env Eng Principles, Biological",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "B",
    "crn": 69981,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Application of principles of biochemistry and microbiology to air and water quality, wastes, and their engineering management; biological mediated changes in water and in domestic and industrial wastewater.",
    "prerequisites": "CEE 443 or CHEM 360",
    "admin_notes": "4 undergraduate hours. 4 graduate hours. Prerequisite: CEE 443 or CHEM 360.",
    "topics": [
      "Application of principles of biochemistry and microbiology to air and water quality, wastes, and their engineering management",
      "biological mediated changes in water and in domestic and industrial wastewater"
    ],
    "embedding_text": "CEE 444 Env Eng Principles, Biological. Application of principles of biochemistry and microbiology to air and water quality, wastes, and their engineering management; biological mediated changes in water and in domestic and industrial wastewater. Prerequisite: CEE 443 or CHEM 360."
  },
  {
    "course_instance_id": "CEE 449 Environmental Engineering Lab AB1 31717",
    "course_id": "CEE 449",
    "course_number": 449,
    "subject": "CEE",
    "title": "Environmental Engineering Lab",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Packaged Section",
    "section_number": "AB1",
    "crn": 31717,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Traditional analysis tools and techniques in analysis, control, and design of natural and engineered environmental systems including air, water, wastewater, solid and hazardous waste, and ecological systems.",
    "prerequisites": "CEE 330",
    "admin_notes": "3 undergraduate hours. 3 graduate hours. Prerequisite: CEE 330.",
    "topics": [
      "Traditional analysis tools and techniques in analysis, control, and design of natural and engineered environmental systems including air, water, wastewater, solid and hazardous waste, and ecological systems"
    ],
    "embedding_text": "CEE 449 Environmental Engineering Lab. Traditional analysis tools and techniques in analysis, control, and design of natural and engineered environmental systems including air, water, wastewater, solid and hazardous waste, and ecological systems. Prerequisite: CEE 330."
  },
  {
    "course_instance_id": "CEE 450 Surface Hydrology F 29758",
    "course_id": "CEE 450",
    "course_number": 450,
    "subject": "CEE",
    "title": "Surface Hydrology",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "F",
    "crn": 29758,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Descriptive and quantitative hydrology dealing with the distribution, circulation, and storage of water on the earth's surface; principles of hydrologic processes; methods of analysis and their applications to engineering and environmental problems.",
    "prerequisites": "CEE 350",
    "admin_notes": "3 undergraduate hours. 3 graduate hours. Prerequisite: CEE 350.",
    "topics": [
      "Descriptive and quantitative hydrology dealing with the distribution, circulation, and storage of water on the earth's surface",
      "principles of hydrologic processes",
      "methods of analysis and their applications to engineering and environmental problems"
    ],
    "embedding_text": "CEE 450 Surface Hydrology. Descriptive and quantitative hydrology dealing with the distribution, circulation, and storage of water on the earth's surface; principles of hydrologic processes; methods of analysis and their applications to engineering and environmental problems. Prerequisite: CEE 350."
  },
  {
    "course_instance_id": "CEE 451 Environmental Fluid Mechanics G 29761",
    "course_id": "CEE 451",
    "course_number": 451,
    "subject": "CEE",
    "title": "Environmental Fluid Mechanics",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "G",
    "crn": 29761,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Incompressible fluid mechanics with particular emphasis on topics in analysis and applications in civil engineering areas; principles of continuity, momentum and energy, kinematics of flow and stream functions, potential flow, laminar motion, turbulence, and boundary-layer theory.",
    "prerequisites": "CEE 331 or TAM 335",
    "admin_notes": "3 undergraduate hours. 3 graduate hours. Prerequisite: CEE 331 or TAM 335.",
    "topics": [
      "Incompressible fluid mechanics with particular emphasis on topics in analysis and applications in civil engineering areas",
      "principles of continuity, momentum and energy, kinematics of flow and stream functions, potential flow, laminar motion, turbulence, and boundary-layer theory"
    ],
    "embedding_text": "CEE 451 Environmental Fluid Mechanics. Incompressible fluid mechanics with particular emphasis on topics in analysis and applications in civil engineering areas; principles of continuity, momentum and energy, kinematics of flow and stream functions, potential flow, laminar motion, turbulence, and boundary-layer theory. Prerequisite: CEE 331 or TAM 335."
  },
  {
    "course_instance_id": "CEE 452 Hydraulic Analysis and Design C 31727",
    "course_id": "CEE 452",
    "course_number": 452,
    "subject": "CEE",
    "title": "Hydraulic Analysis and Design",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "C",
    "crn": 31727,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Hydraulic analysis and design of engineering systems: closed conduits and pipe networks; hydraulic structures, including spillways, stilling basins, and embankment seepage; selection and installation of hydraulic machinery.",
    "prerequisites": "CEE 331 or TAM 335",
    "admin_notes": "3 undergraduate hours. 3 graduate hours. Prerequisite: CEE 331 or TAM 335.",
    "topics": [
      "Hydraulic analysis and design of engineering systems: closed conduits and pipe networks",
      "hydraulic structures, including spillways, stilling basins, and embankment seepage",
      "selection and installation of hydraulic machinery"
    ],
    "embedding_text": "CEE 452 Hydraulic Analysis and Design. Hydraulic analysis and design of engineering systems: closed conduits and pipe networks; hydraulic structures, including spillways, stilling basins, and embankment seepage; selection and installation of hydraulic machinery. Prerequisite: CEE 331 or TAM 335."
  },
  {
    "course_instance_id": "CEE 453 Urban Hydrology and Hydraulics ONC 78221",
    "course_id": "CEE 453",
    "course_number": 453,
    "subject": "CEE",
    "title": "Urban Hydrology and Hydraulics",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "ONC",
    "crn": 78221,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Hydraulic analysis and design of urban, highway, airport, and small rural watershed drainage problems; discussion of overland and drainage channel flows; hydraulics of storm-drain systems and culverts; determination of design flow; runoff for highways, airports, and urban areas; design of drainage gutters, channels, sewer networks, and culverts.",
    "prerequisites": "CEE 350",
    "admin_notes": "4 undergraduate hours. 4 graduate hours. Prerequisite: CEE 350.",
    "topics": [
      "Hydraulic analysis and design of urban, highway, airport, and small rural watershed drainage problems",
      "discussion of overland and drainage channel flows",
      "hydraulics of storm-drain systems and culverts",
      "determination of design flow",
      "runoff for highways, airports, and urban areas",
      "design of drainage gutters, channels, sewer networks, and culverts"
    ],
    "embedding_text": "CEE 453 Urban Hydrology and Hydraulics. Hydraulic analysis and design of urban, highway, airport, and small rural watershed drainage problems; discussion of overland and drainage channel flows; hydraulics of storm-drain systems and culverts; determination of design flow; runoff for highways, airports, and urban areas; design of drainage gutters, channels, sewer networks, and culverts. Prerequisite: CEE 350."
  },
  {
    "course_instance_id": "CEE 457 Groundwater ONC 78597",
    "course_id": "CEE 457",
    "course_number": 457,
    "subject": "CEE",
    "title": "Groundwater",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "ONC",
    "crn": 78597,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Physical properties of groundwater and aquifers, principles and fundamental equations of porous media flow and mass transport, well hydraulics and pumping test analysis, role of groundwater in the hydrologic cycle, groundwater quality and contamination.",
    "prerequisites": "CEE 350 and CEE 331 or TAM 335",
    "admin_notes": "3 undergraduate hours. 3 graduate hours. Prerequisite: CEE 350 and CEE 331 or TAM 335.",
    "topics": [
      "Physical properties of groundwater and aquifers, principles and fundamental equations of porous media flow and mass transport, well hydraulics and pumping test analysis, role of groundwater in the hydrologic cycle, groundwater quality and contamination"
    ],
    "embedding_text": "CEE 457 Groundwater. Physical properties of groundwater and aquifers, principles and fundamental equations of porous media flow and mass transport, well hydraulics and pumping test analysis, role of groundwater in the hydrologic cycle, groundwater quality and contamination. Prerequisite: CEE 350 and CEE 331 or TAM 335."
  },
  {
    "course_instance_id": "CEE 458 Water Resources Field Methods FM1 68124",
    "course_id": "CEE 458",
    "course_number": 458,
    "subject": "CEE",
    "title": "Water Resources Field Methods",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Packaged Section",
    "section_number": "FM1",
    "crn": 68124,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Scientific principles of measurement technologies and protocols used for water-resources measurements and experimental design of field-scale water-resources and environmental studies. Planning field studies; instruments and protocols for surface-water, and water-quality sampling; description of data quality. One-half-day laboratory field trips to streamflow monitoring stations and groundwater monitoring wells nearby.",
    "prerequisites": "CEE 350",
    "admin_notes": "4 undergraduate hours. 4 graduate hours. Prerequisite: CEE 350",
    "topics": [
      "Scientific principles of measurement technologies and protocols used for water-resources measurements and experimental design of field-scale water-resources and environmental studies",
      "Planning field studies",
      "instruments and protocols for surface-water, and water-quality sampling",
      "description of data quality",
      "One-half-day laboratory field trips to streamflow monitoring stations and groundwater monitoring wells nearby"
    ],
    "embedding_text": "CEE 458 Water Resources Field Methods. Scientific principles of measurement technologies and protocols used for water-resources measurements and experimental design of field-scale water-resources and environmental studies. Planning field studies; instruments and protocols for surface-water, and water-quality sampling; description of data quality. One-half-day laboratory field trips to streamflow monitoring stations and groundwater monitoring wells nearby. Prerequisite: CEE 350."
  },
  {
    "course_instance_id": "CEE 460 Steel Structures I LM 29767",
    "course_id": "CEE 460",
    "course_number": 460,
    "subject": "CEE",
    "title": "Steel Structures I",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "LM",
    "crn": 29767,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Introduction to the design of metal structures; behavior of members and their connections; theoretical, experimental, and practical bases for proportioning members and their connections.",
    "prerequisites": "CEE 360",
    "admin_notes": "3 undergraduate hours. No graduate credit. Prerequisite: CEE 360.",
    "topics": [
      "Introduction to the design of metal structures",
      "behavior of members and their connections",
      "theoretical, experimental, and practical bases for proportioning members and their connections"
    ],
    "embedding_text": "CEE 460 Steel Structures I. Introduction to the design of metal structures; behavior of members and their connections; theoretical, experimental, and practical bases for proportioning members and their connections. Prerequisite: CEE 360."
  },
  {
    "course_instance_id": "CEE 461 Reinforced Concrete I NP 29770",
    "course_id": "CEE 461",
    "course_number": 461,
    "subject": "CEE",
    "title": "Reinforced Concrete I",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "NP",
    "crn": 29770,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Strength, behavior, and design of reinforced concrete members subjected to moments, shear, and axial forces; emphasis on the influence of the material properties on behavior.",
    "prerequisites": "CEE 360",
    "admin_notes": "3 undergraduate hours. No graduate credit. Prerequisite: CEE 360.",
    "topics": [
      "Strength, behavior, and design of reinforced concrete members subjected to moments, shear, and axial forces",
      "emphasis on the influence of the material properties on behavior"
    ],
    "embedding_text": "CEE 461 Reinforced Concrete I. Strength, behavior, and design of reinforced concrete members subjected to moments, shear, and axial forces; emphasis on the influence of the material properties on behavior. Prerequisite: CEE 360."
  },
  {
    "course_instance_id": "CEE 462 Steel Structures II 3 62000",
    "course_id": "CEE 462",
    "course_number": 462,
    "subject": "CEE",
    "title": "Steel Structures II",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "3",
    "crn": 62000,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Metal members under combined loads; connections, welded and bolted; moment-resistant connections; plate girders, conventional behavior, and tension field action.",
    "prerequisites": "CEE 460",
    "admin_notes": "3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CEE 460.",
    "topics": [
      "Metal members under combined loads",
      "connections, welded and bolted",
      "moment-resistant connections",
      "plate girders, conventional behavior, and tension field action"
    ],
    "embedding_text": "CEE 462 Steel Structures II. Metal members under combined loads; connections, welded and bolted; moment-resistant connections; plate girders, conventional behavior, and tension field action. Prerequisite: CEE 460."
  },
  {
    "course_instance_id": "CEE 463 Reinforced Concrete II D3 29773",
    "course_id": "CEE 463",
    "course_number": 463,
    "subject": "CEE",
    "title": "Reinforced Concrete II",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "D3",
    "crn": 29773,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Strength, behavior, and design of indeterminate reinforced concrete structures, with primary emphasis on slab systems; emphasis on the strength of slabs and on the available methods of design of slabs spanning in two directions, with or without supporting beams.",
    "prerequisites": "CEE 461",
    "admin_notes": "3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CEE 461.",
    "topics": [
      "Strength, behavior, and design of indeterminate reinforced concrete structures, with primary emphasis on slab systems",
      "emphasis on the strength of slabs and on the available methods of design of slabs spanning in two directions, with or without supporting beams"
    ],
    "embedding_text": "CEE 463 Reinforced Concrete II. Strength, behavior, and design of indeterminate reinforced concrete structures, with primary emphasis on slab systems; emphasis on the strength of slabs and on the available methods of design of slabs spanning in two directions, with or without supporting beams. Prerequisite: CEE 461."
  },
  {
    "course_instance_id": "CEE 465 Design of Structural Systems TW3 31731",
    "course_id": "CEE 465",
    "course_number": 465,
    "subject": "CEE",
    "title": "Design of Structural Systems",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "TW3",
    "crn": 31731,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Examination of the whole structural design process including definition of functional requirements, selection of structural scheme, formulation of design criteria, preliminary and computer-aided proportioning, and analysis of response, cost, and value.",
    "prerequisites": "Credit in either CEE 460 or CEE 461 with concurrent registration in the other",
    "admin_notes": "3 undergraduate hours. No graduate credit. Prerequisite: Credit in either CEE 460 or CEE 461 with concurrent registration in the other.",
    "topics": [
      "Examination of the whole structural design process including definition of functional requirements, selection of structural scheme, formulation of design criteria, preliminary and computer-aided proportioning, and analysis of response, cost, and value"
    ],
    "embedding_text": "CEE 465 Design of Structural Systems. Examination of the whole structural design process including definition of functional requirements, selection of structural scheme, formulation of design criteria, preliminary and computer-aided proportioning, and analysis of response, cost, and value. Prerequisite: Credit in either CEE 460 or CEE 461 with concurrent registration in the other."
  },
  {
    "course_instance_id": "CEE 470 Structural Analysis ONC 68033",
    "course_id": "CEE 470",
    "course_number": 470,
    "subject": "CEE",
    "title": "Structural Analysis",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "ONC",
    "crn": 68033,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Direct stiffness method of structural analysis; fundamentals and algorithms; numerical analysis of plane trusses, grids and frames; virtual work and energy principles; finite element method for plane stress and plane strain.",
    "prerequisites": "CEE 360",
    "admin_notes": "4 undergraduate hours. 4 graduate hours. Credit is not given for both CEE 470 and ME 471. Prerequisite: CEE 360. Students in this section will complete this course completely online except for the following which must be completed on-campus: Exams (will be completed in the classroom with the instructor/TA), Homework/exam sessions, Office Hours. Contact Becky Stillwell (rborden@illinois.edu), Meg Griffin (mgriffn@illinois.edu), and the course instructor for permission to register.",
    "topics": [
      "Direct stiffness method of structural analysis",
      "fundamentals and algorithms",
      "numerical analysis of plane trusses, grids and frames",
      "virtual work and energy principles",
      "finite element method for plane stress and plane strain"
    ],
    "embedding_text": "CEE 470 Structural Analysis. Direct stiffness method of structural analysis; fundamentals and algorithms; numerical analysis of plane trusses, grids and frames; virtual work and energy principles; finite element method for plane stress and plane strain. Prerequisite: CEE 360."
  },
  {
    "course_instance_id": "CEE 471 Structural Mechanics 3 29780",
    "course_id": "CEE 471",
    "course_number": 471,
    "subject": "CEE",
    "title": "Structural Mechanics",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "3",
    "crn": 29780,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Beams under lateral load and thrust; beams on elastic foundations; virtual work and energy principles; principles of solid mechanics, stress and strain in three dimensions; static stability theory; torsion; computational methods.",
    "prerequisites": "MATH 285 and TAM 251",
    "admin_notes": "3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: MATH 285 and TAM 251.",
    "topics": [
      "Beams under lateral load and thrust",
      "beams on elastic foundations",
      "virtual work and energy principles",
      "principles of solid mechanics, stress and strain in three dimensions",
      "static stability theory",
      "computational methods"
    ],
    "embedding_text": "CEE 471 Structural Mechanics. Beams under lateral load and thrust; beams on elastic foundations; virtual work and energy principles; principles of solid mechanics, stress and strain in three dimensions; static stability theory; torsion; computational methods. Prerequisite: MATH 285 and TAM 251."
  },
  {
    "course_instance_id": "CEE 472 Structural Dynamics I ONC 80056",
    "course_id": "CEE 472",
    "course_number": 472,
    "subject": "CEE",
    "title": "Structural Dynamics I",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "ONC",
    "crn": 80056,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Analysis of the dynamic response of structures and structural components to transient loads and foundation excitation; single-degree-of-freedom and multi-degree-of-freedom systems; response spectrum concepts; simple inelastic structural systems; systems with distributed mass and flexibility.",
    "prerequisites": "CEE 360, MATH 285, and TAM 212",
    "admin_notes": "3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CEE 360, MATH 285, and TAM 212.",
    "topics": [
      "Analysis of the dynamic response of structures and structural components to transient loads and foundation excitation",
      "single-degree-of-freedom and multi-degree-of-freedom systems",
      "response spectrum concepts",
      "simple inelastic structural systems",
      "systems with distributed mass and flexibility"
    ],
    "embedding_text": "CEE 472 Structural Dynamics I. Analysis of the dynamic response of structures and structural components to transient loads and foundation excitation; single-degree-of-freedom and multi-degree-of-freedom systems; response spectrum concepts; simple inelastic structural systems; systems with distributed mass and flexibility. Prerequisite: CEE 360, MATH 285, and TAM 212."
  },
  {
    "course_instance_id": "CEE 474 Mechanics of Additive Manufact AM3 73604",
    "course_id": "CEE 474",
    "course_number": 474,
    "subject": "CEE",
    "title": "Mechanics of Additive Manufact",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "AM3",
    "crn": 73604,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Introduction to process physics for additive manufacturing (AM); Basic materials science for AM, cement-based materials, polymer-based materials. Fundamental mechanics principles involved in layered additive manufacturing; Mathematical models for AM, transport phenomena and flow modeling, curing and property evolution, residual stresses and fatigue effects; Introduction to the Role of Robotics, Machine Learning and Data Science in modern AM.",
    "prerequisites": "MSE 280, or CEE 300, or ME 330, or CEE 471, or consent of instructor",
    "admin_notes": "3 undergraduate hours. 4 graduate hours. Prerequisite: MSE 280, or CEE 300, or ME 330, or CEE 471, or consent of instructor.",
    "topics": [
      "Introduction to process physics for additive manufacturing (AM)",
      "Basic materials science for AM, cement-based materials, polymer-based materials",
      "Fundamental mechanics principles involved in layered additive manufacturing",
      "Mathematical models for AM, transport phenomena and flow modeling, curing and property evolution, residual stresses and fatigue effects",
      "Introduction to the Role of Robotics, Machine Learning and Data Science in modern AM"
    ],
    "embedding_text": "CEE 474 Mechanics of Additive Manufact. Introduction to process physics for additive manufacturing (AM); Basic materials science for AM, cement-based materials, polymer-based materials. Fundamental mechanics principles involved in layered additive manufacturing; Mathematical models for AM, transport phenomena and flow modeling, curing and property evolution, residual stresses and fatigue effects; Introduction to the Role of Robotics, Machine Learning and Data Science in modern AM. Prerequisite: MSE 280, or CEE 300, or ME 330, or CEE 471, or consent of instructor."
  },
  {
    "course_instance_id": "CEE 483 Soil Mechanics and Behavior AB1 31545",
    "course_id": "CEE 483",
    "course_number": 483,
    "subject": "CEE",
    "title": "Soil Mechanics and Behavior",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Laboratory",
    "section_number": "AB1",
    "crn": 31545,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Composition and structure of soil; water flow and hydraulic properties; stress in soil; compressibility behavior and properties of soils; consolidation and settlement analysis; shear strength of soils; compaction and unsaturated soils; experimental measurements.",
    "prerequisites": "CEE 380",
    "admin_notes": "4 undergraduate hours. 4 graduate hours. Prerequisite: CEE 380.",
    "topics": [
      "Composition and structure of soil",
      "water flow and hydraulic properties",
      "compressibility behavior and properties of soils",
      "consolidation and settlement analysis",
      "shear strength of soils",
      "compaction and unsaturated soils",
      "experimental measurements"
    ],
    "embedding_text": "CEE 483 Soil Mechanics and Behavior. Composition and structure of soil; water flow and hydraulic properties; stress in soil; compressibility behavior and properties of soils; consolidation and settlement analysis; shear strength of soils; compaction and unsaturated soils; experimental measurements. Prerequisite: CEE 380."
  },
  {
    "course_instance_id": "CEE 484 Applied Soil Mechanics F 31737",
    "course_id": "CEE 484",
    "course_number": 484,
    "subject": "CEE",
    "title": "Applied Soil Mechanics",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "F",
    "crn": 31737,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Application of soil mechanics to earth pressures and retaining walls, stability of slopes, foundations for structures, excavations; construction considerations; instrumentation.",
    "prerequisites": "Credit or Concurrent registration in CEE 483",
    "admin_notes": "3 or 4 undergraduate hours. 4 graduate hours. Prerequisite: Credit or Concurrent registration in CEE 483.",
    "topics": [
      "Application of soil mechanics to earth pressures and retaining walls, stability of slopes, foundations for structures, excavations",
      "construction considerations",
      "instrumentation"
    ],
    "embedding_text": "CEE 484 Applied Soil Mechanics. Application of soil mechanics to earth pressures and retaining walls, stability of slopes, foundations for structures, excavations; construction considerations; instrumentation. Prerequisite: Credit or Concurrent registration in CEE 483."
  },
  {
    "course_instance_id": "CEE 490 Computer Methods 3 73039",
    "course_id": "CEE 490",
    "course_number": 490,
    "subject": "CEE",
    "title": "Computer Methods",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "3",
    "crn": 73039,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Computer methods and their programming for solving common types of differential equations arising in civil and environmental engineering (hyperbolic, parabolic, and elliptic equations, with emphasis on prototypical cases, such as the convection-diffusion equation, as well as Laplace s / Poisson s equation). Exposure to state-of-the-art open-source numerical methods libraries. The course enables students in civil and environmental engineering to develop high-performance and high-purpose codes in these open-source frameworks for their research problems in an efficient way.",
    "prerequisites": "CEE 360 and TAM 335",
    "admin_notes": "3 undergraduate hours. 4 graduate hours. Prerequisite: CEE 360 and TAM 335.",
    "topics": [
      "Computer methods and their programming for solving common types of differential equations arising in civil and environmental engineering (hyperbolic, parabolic, and elliptic equations, with emphasis on prototypical cases, such as the convection-diffusion equation, as well as Laplace s / Poisson s equation)",
      "Exposure to state-of-the-art open-source numerical methods libraries",
      "The course enables students in civil and environmental engineering to develop high-performance and high-purpose codes in these open-source frameworks for their research problems in an efficient way"
    ],
    "embedding_text": "CEE 490 Computer Methods. Computer methods and their programming for solving common types of differential equations arising in civil and environmental engineering (hyperbolic, parabolic, and elliptic equations, with emphasis on prototypical cases, such as the convection-diffusion equation, as well as Laplace s / Poisson s equation). Exposure to state-of-the-art open-source numerical methods libraries. The course enables students in civil and environmental engineering to develop high-performance and high-purpose codes in these open-source frameworks for their research problems in an efficient way. Prerequisite: CEE 360 and TAM 335."
  },
  {
    "course_instance_id": "CEE 491 Decision and Risk Analysis D3 31740",
    "course_id": "CEE 491",
    "course_number": 491,
    "subject": "CEE",
    "title": "Decision and Risk Analysis",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "D3",
    "crn": 31740,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Development of modern statistical decision theory and risk analysis, and application of these concepts in civil engineering design and decision making; Bayesian statistical decision theory, decision tree, utility concepts, and multi-objective decision problems; modeling and analysis of uncertainties, practical risk evaluation, and formulation of risk-based design criteria, risk benefit trade-offs, and optimal decisions.",
    "prerequisites": "CEE 202",
    "admin_notes": "3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CEE 202.",
    "topics": [
      "Development of modern statistical decision theory and risk analysis, and application of these concepts in civil engineering design and decision making",
      "Bayesian statistical decision theory, decision tree, utility concepts, and multi-objective decision problems",
      "modeling and analysis of uncertainties, practical risk evaluation, and formulation of risk-based design criteria, risk benefit trade-offs, and optimal decisions"
    ],
    "embedding_text": "CEE 491 Decision and Risk Analysis. Development of modern statistical decision theory and risk analysis, and application of these concepts in civil engineering design and decision making; Bayesian statistical decision theory, decision tree, utility concepts, and multi-objective decision problems; modeling and analysis of uncertainties, practical risk evaluation, and formulation of risk-based design criteria, risk benefit trade-offs, and optimal decisions. Prerequisite: CEE 202."
  },
  {
    "course_instance_id": "CEE 492 Data Science for CEE DS3 77425",
    "course_id": "CEE 492",
    "course_number": 492,
    "subject": "CEE",
    "title": "Data Science for CEE",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "DS3",
    "crn": 77425,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Students will learn to leverage data to study civil and environmental engineering problems, identify patterns, and make actionable insights. This course includes training in computational thinking and exploratory data analysis; data processing techniques including singular value decomposition, principal component analysis, and Fourier and wavelet transforms; and machine learning techniques including k-means, classification trees, neural networks, and neural differential equations. Students are required to bring a laptop computer to class.",
    "prerequisites": "CS 101; CEE 202; and CEE 300, CEE 330, or CEE 360",
    "admin_notes": "3 undergraduate hours. 4 graduate hours. Prerequisite: CS 101; CEE 202; and CEE 300, CEE 330, or CEE 360.",
    "topics": [
      "Students will learn to leverage data to study civil and environmental engineering problems, identify patterns, and make actionable insights",
      "This course includes training in computational thinking and exploratory data analysis",
      "data processing techniques including singular value decomposition, principal component analysis, and Fourier and wavelet transforms",
      "and machine learning techniques including k-means, classification trees, neural networks, and neural differential equations",
      "Students are required to bring a laptop computer to class"
    ],
    "embedding_text": "CEE 492 Data Science for CEE. Students will learn to leverage data to study civil and environmental engineering problems, identify patterns, and make actionable insights. This course includes training in computational thinking and exploratory data analysis; data processing techniques including singular value decomposition, principal component analysis, and Fourier and wavelet transforms; and machine learning techniques including k-means, classification trees, neural networks, and neural differential equations. Students are required to bring a laptop computer to class. Prerequisite: CS 101; CEE 202; and CEE 300, CEE 330, or CEE 360."
  },
  {
    "course_instance_id": "CEE 493 Sustainable Design Eng Tech EWS 66346",
    "course_id": "CEE 493",
    "course_number": 493,
    "subject": "CEE",
    "title": "Sustainable Design Eng Tech",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "EWS",
    "crn": 66346,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Quantitative sustainable design (QSD) and how to navigate engineering decision-making. Economic (life cycle costing, techno-economic assessment) and environmental (life cycle assessment, LCA) sustainability assessments, and how to link these tools to design decisions under uncertainty. Design of engineered technologies individually and in teams, with special attention to water infrastructure and bioenergy production. Semester-long design project that includes components from two of the following three CEE sub-disciplines: environmental, hydraulic, geotechnical.",
    "prerequisites": "CEE 340 or Graduate Standing",
    "admin_notes": "4 undergraduate hours. 4 graduate hours. Prerequisite: CEE 340 or Graduate Standing.",
    "topics": [
      "Quantitative sustainable design (QSD) and how to navigate engineering decision-making",
      "Economic (life cycle costing, techno-economic assessment) and environmental (life cycle assessment, LCA) sustainability assessments, and how to link these tools to design decisions under uncertainty",
      "Design of engineered technologies individually and in teams, with special attention to water infrastructure and bioenergy production",
      "Semester-long design project that includes components from two of the following three CEE sub-disciplines: environmental, hydraulic, geotechnical"
    ],
    "embedding_text": "CEE 493 Sustainable Design Eng Tech. Quantitative sustainable design (QSD) and how to navigate engineering decision-making. Economic (life cycle costing, techno-economic assessment) and environmental (life cycle assessment, LCA) sustainability assessments, and how to link these tools to design decisions under uncertainty. Design of engineered technologies individually and in teams, with special attention to water infrastructure and bioenergy production. Semester-long design project that includes components from two of the following three CEE sub-disciplines: environmental, hydraulic, geotechnical. Prerequisite: CEE 340 or Graduate Standing."
  },
  {
    "course_instance_id": "CEE 495 Professional Practice H 29793",
    "course_id": "CEE 495",
    "course_number": 495,
    "subject": "CEE",
    "title": "Professional Practice",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture",
    "section_number": "H",
    "crn": 29793,
    "credit_hours": null,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Series of lectures by outstanding authorities on the practice of civil engineering and its relations to economics, sociology, and other fields of human endeavor.",
    "prerequisites": null,
    "admin_notes": "0 undergraduate hours. 0 graduate hours. Approved for S/U grading only.",
    "topics": [
      "Series of lectures by outstanding authorities on the practice of civil engineering and its relations to economics, sociology, and other fields of human endeavor"
    ],
    "embedding_text": "CEE 495 Professional Practice. Series of lectures by outstanding authorities on the practice of civil engineering and its relations to economics, sociology, and other fields of human endeavor."
  },
  {
    "course_instance_id": "CEE 497 Independent Study 0 10474",
    "course_id": "CEE 497",
    "course_number": 497,
    "subject": "CEE",
    "title": "Independent Study",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Independent Study",
    "section_number": "0",
    "crn": 10474,
    "credit_hours": 1,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Individual investigations or studies of any phase of civil engineering selected by the student and approved by the department.",
    "prerequisites": "Consent of instructor",
    "admin_notes": "1 to 4 undergraduate hours. 1 to 16 graduate hours. May be repeated. Prerequisite: Consent of instructor.",
    "topics": [
      "Individual investigations or studies of any phase of civil engineering selected by the student and approved by the department"
    ],
    "embedding_text": "CEE 497 Independent Study. Individual investigations or studies of any phase of civil engineering selected by the student and approved by the department. Prerequisite: Consent of instructor."
  },
  {
    "course_instance_id": "CEE 498 Choices & Consequences in CEE CC3 44194",
    "course_id": "CEE 498",
    "course_number": 498,
    "subject": "CEE",
    "title": "Choices & Consequences in CEE",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "CC3",
    "crn": 44194,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites.",
    "prerequisites": null,
    "admin_notes": "1 to 4 undergraduate hours. 1 to 4 graduate hours. May be repeated in the same or separate terms if topics vary. To introduce the principles of consequence modeling for structural and civil infrastructure systems, stakeholder-centered evaluation, and decision metrics; to provide tools for comparing decision alternatives across technical, social, and economic dimensions; and to offer insights into the role and limitations of these tools in real-world civil engineering decision-making.",
    "topics": [
      "Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum",
      "See Class Schedule or departmental course information for topics and prerequisites"
    ],
    "embedding_text": "CEE 498 Choices & Consequences in CEE. Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites."
  },
  {
    "course_instance_id": "CEE 498 Constr Equipment and Methods CE3 47398",
    "course_id": "CEE 498",
    "course_number": 498,
    "subject": "CEE",
    "title": "Constr Equipment and Methods",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "CE3",
    "crn": 47398,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites.",
    "prerequisites": null,
    "admin_notes": "1 to 4 undergraduate hours. 1 to 4 graduate hours. May be repeated in the same or separate terms if topics vary. Prerequisite: CEE 320",
    "topics": [
      "Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum",
      "See Class Schedule or departmental course information for topics and prerequisites"
    ],
    "embedding_text": "CEE 498 Constr Equipment and Methods. Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites."
  },
  {
    "course_instance_id": "CEE 498 Construction Safety CS3 58133",
    "course_id": "CEE 498",
    "course_number": 498,
    "subject": "CEE",
    "title": "Construction Safety",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "CS3",
    "crn": 58133,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites.",
    "prerequisites": null,
    "admin_notes": "1 to 4 undergraduate hours. 1 to 4 graduate hours. May be repeated in the same or separate terms if topics vary.",
    "topics": [
      "Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum",
      "See Class Schedule or departmental course information for topics and prerequisites"
    ],
    "embedding_text": "CEE 498 Construction Safety. Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites."
  },
  {
    "course_instance_id": "CEE 498 Geoenergy Systems GE3 51547",
    "course_id": "CEE 498",
    "course_number": 498,
    "subject": "CEE",
    "title": "Geoenergy Systems",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "GE3",
    "crn": 51547,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites.",
    "prerequisites": null,
    "admin_notes": "1 to 4 undergraduate hours. 1 to 4 graduate hours. May be repeated in the same or separate terms if topics vary.",
    "topics": [
      "Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum",
      "See Class Schedule or departmental course information for topics and prerequisites"
    ],
    "embedding_text": "CEE 498 Geoenergy Systems. Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites."
  },
  {
    "course_instance_id": "CEE 498 Rail Vehicle Technology RVO 59106",
    "course_id": "CEE 498",
    "course_number": 498,
    "subject": "CEE",
    "title": "Rail Vehicle Technology",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "RVO",
    "crn": 59106,
    "credit_hours": 3,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites.",
    "prerequisites": null,
    "admin_notes": "1 to 4 undergraduate hours. 1 to 4 graduate hours. May be repeated in the same or separate terms if topics vary. Restricted to online non-degree, online MCS, online MSAE, online MSME, and online MSCE students. Non-Degree students may enroll on a space-available basis with consent of Program Coordinator, Meg Griffin (mgriffn@illinois.edu).",
    "topics": [
      "Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum",
      "See Class Schedule or departmental course information for topics and prerequisites"
    ],
    "embedding_text": "CEE 498 Rail Vehicle Technology. Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites."
  },
  {
    "course_instance_id": "CEE 502 Advanced Cement Chemistry B 53026",
    "course_id": "CEE 502",
    "course_number": 502,
    "subject": "CEE",
    "title": "Advanced Cement Chemistry",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "B",
    "crn": 53026,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Advanced topics in chemistry of portland cement, chemistry and microstructure of cements, chemical reactions that lead to hardening, chemistry and microstructure of hydrated cements, effects of chemical and mineral admixtures, and chemical issues involved in the engineering behavior of the cements.",
    "prerequisites": "CEE 401",
    "admin_notes": "Prerequisite: CEE 401.",
    "topics": [
      "Advanced topics in chemistry of portland cement, chemistry and microstructure of cements, chemical reactions that lead to hardening, chemistry and microstructure of hydrated cements, effects of chemical and mineral admixtures, and chemical issues involved in the engineering behavior of the cements"
    ],
    "embedding_text": "CEE 502 Advanced Cement Chemistry. Advanced topics in chemistry of portland cement, chemistry and microstructure of cements, chemical reactions that lead to hardening, chemistry and microstructure of hydrated cements, effects of chemical and mineral admixtures, and chemical issues involved in the engineering behavior of the cements. Prerequisite: CEE 401."
  },
  {
    "course_instance_id": "CEE 504 Infrastructure NDE Methods AB1 75731",
    "course_id": "CEE 504",
    "course_number": 504,
    "subject": "CEE",
    "title": "Infrastructure NDE Methods",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Laboratory",
    "section_number": "AB1",
    "crn": 75731,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Fundamental bases and methodologies of non-destructive evaluation (NDE) techniques for infrastructure materials: methods for steel including ultrasound, radiography, eddy-current and magnetic-particles; methods for concrete including sounding, semi-destructive, ultrasound, seismic, impact-echo, impulse-response, ground-penetrating radar, infrared-thermography, and nuclear; planning and carrying out NDE structural investigations. Weekly laboratory sessions, a research paper, and an associated presentation related to NDE required.",
    "prerequisites": "CEE 401 or CEE 405",
    "admin_notes": "Prerequisite: CEE 401 or CEE 405.",
    "topics": [
      "Fundamental bases and methodologies of non-destructive evaluation (NDE) techniques for infrastructure materials: methods for steel including ultrasound, radiography, eddy-current and magnetic-particles",
      "methods for concrete including sounding, semi-destructive, ultrasound, seismic, impact-echo, impulse-response, ground-penetrating radar, infrared-thermography, and nuclear",
      "planning and carrying out NDE structural investigations",
      "Weekly laboratory sessions, a research paper, and an associated presentation related to NDE required"
    ],
    "embedding_text": "CEE 504 Infrastructure NDE Methods. Fundamental bases and methodologies of non-destructive evaluation (NDE) techniques for infrastructure materials: methods for steel including ultrasound, radiography, eddy-current and magnetic-particles; methods for concrete including sounding, semi-destructive, ultrasound, seismic, impact-echo, impulse-response, ground-penetrating radar, infrared-thermography, and nuclear; planning and carrying out NDE structural investigations. Weekly laboratory sessions, a research paper, and an associated presentation related to NDE required. Prerequisite: CEE 401 or CEE 405."
  },
  {
    "course_instance_id": "CEE 505 Transport Soil Stabilization ONL 74727",
    "course_id": "CEE 505",
    "course_number": 505,
    "subject": "CEE",
    "title": "Transport Soil Stabilization",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "ONL",
    "crn": 74727,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Aims to introduce theory, techniques and applications of chemical and mechanical stabilization of soils and aggregates used in construction and maintenance of roads, railroads, and airfields. Chemical stabilization includes use of lime, cement, fly ash, and emulsions as compaction aids to soils, as binders and water repellents, to treat weak soils and aggregates. Mechanical stabilization deals with the use of non-biodegradable reinforcement, such as geosynthetics and fibers, to improve strength and stiffness.",
    "prerequisites": "CEE 483",
    "admin_notes": "4 graduate hours. 4 professional hours. Prerequisite: CEE 483.",
    "topics": [
      "Aims to introduce theory, techniques and applications of chemical and mechanical stabilization of soils and aggregates used in construction and maintenance of roads, railroads, and airfields",
      "Chemical stabilization includes use of lime, cement, fly ash, and emulsions as compaction aids to soils, as binders and water repellents, to treat weak soils and aggregates",
      "Mechanical stabilization deals with the use of non-biodegradable reinforcement, such as geosynthetics and fibers, to improve strength and stiffness"
    ],
    "embedding_text": "CEE 505 Transport Soil Stabilization. Aims to introduce theory, techniques and applications of chemical and mechanical stabilization of soils and aggregates used in construction and maintenance of roads, railroads, and airfields. Chemical stabilization includes use of lime, cement, fly ash, and emulsions as compaction aids to soils, as binders and water repellents, to treat weak soils and aggregates. Mechanical stabilization deals with the use of non-biodegradable reinforcement, such as geosynthetics and fibers, to improve strength and stiffness. Prerequisite: CEE 483."
  },
  {
    "course_instance_id": "CEE 512 Logistics Systems Analysis ONL 62246",
    "course_id": "CEE 512",
    "course_number": 512,
    "subject": "CEE",
    "title": "Logistics Systems Analysis",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "ONL",
    "crn": 62246,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Planning, design and operations of complex logistics systems: logistics costs; production, transportation and distribution systems; lot-sizing; traveling salesman problem (TSP) and vehicle routing problem (VRP); transshipments; facility location problem; supply chain management and inventory control; order instability; analytical methods and practical solution techniques.",
    "prerequisites": "CEE 310 and IE 310",
    "admin_notes": "Prerequisite: CEE 310 and IE 310.",
    "topics": [
      "Planning, design and operations of complex logistics systems: logistics costs",
      "production, transportation and distribution systems",
      "traveling salesman problem (TSP) and vehicle routing problem (VRP)",
      "facility location problem",
      "supply chain management and inventory control",
      "order instability",
      "analytical methods and practical solution techniques"
    ],
    "embedding_text": "CEE 512 Logistics Systems Analysis. Planning, design and operations of complex logistics systems: logistics costs; production, transportation and distribution systems; lot-sizing; traveling salesman problem (TSP) and vehicle routing problem (VRP); transshipments; facility location problem; supply chain management and inventory control; order instability; analytical methods and practical solution techniques. Prerequisite: CEE 310 and IE 310."
  },
  {
    "course_instance_id": "CEE 526 Construction Optimization CO 66351",
    "course_id": "CEE 526",
    "course_number": 526,
    "subject": "CEE",
    "title": "Construction Optimization",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "CO",
    "crn": 66351,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Optimizing construction project decisions during the planning and construction phases including the optimization of bid decisions; contractor and material supplier selection; site layout planning; tradeoffs among construction time, cost and quality; repetitive construction scheduling; resource allocation and leveling; and building sustainability. Prerequisite: One of CEE 420, CEE 421 or CEE 422.",
    "prerequisites": null,
    "admin_notes": null,
    "topics": [
      "Optimizing construction project decisions during the planning and construction phases including the optimization of bid decisions",
      "contractor and material supplier selection",
      "site layout planning",
      "tradeoffs among construction time, cost and quality",
      "repetitive construction scheduling",
      "resource allocation and leveling",
      "and building sustainability",
      "Prerequisite: One of CEE 420, CEE 421 or CEE 422"
    ],
    "embedding_text": "CEE 526 Construction Optimization. Optimizing construction project decisions during the planning and construction phases including the optimization of bid decisions; contractor and material supplier selection; site layout planning; tradeoffs among construction time, cost and quality; repetitive construction scheduling; resource allocation and leveling; and building sustainability. Prerequisite: One of CEE 420, CEE 421 or CEE 422."
  },
  {
    "course_instance_id": "CEE 528 Construction Data Modeling ONC 73580",
    "course_id": "CEE 528",
    "course_number": 528,
    "subject": "CEE",
    "title": "Construction Data Modeling",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "ONC",
    "crn": 73580,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "State-of-the-art research and literature in the construction data modeling domain. Fundamental techniques of construction data modeling; existing construction data representation approaches and specifications for the architecture, engineering, and construction domain; building information models; capabilities and limitation of data process models and representation approaches and techniques.",
    "prerequisites": "Two of CEE 420, CEE 421, CEE 422",
    "admin_notes": "Prerequisite: Two of CEE 420, CEE 421, CEE 422. Students in this section will complete this course completely online except for the following which must be completed on-campus: Exams (will be completed in the classroom with the instructor/TA), Homework/exam sessions, Office Hours. Contact Becky Stillwell (rborden@illinois.edu), Meg Griffin (mgriffn@illinois.edu), and the course instructor for permission to register.",
    "topics": [
      "State-of-the-art research and literature in the construction data modeling domain",
      "Fundamental techniques of construction data modeling",
      "existing construction data representation approaches and specifications for the architecture, engineering, and construction domain",
      "building information models",
      "capabilities and limitation of data process models and representation approaches and techniques"
    ],
    "embedding_text": "CEE 528 Construction Data Modeling. State-of-the-art research and literature in the construction data modeling domain. Fundamental techniques of construction data modeling; existing construction data representation approaches and specifications for the architecture, engineering, and construction domain; building information models; capabilities and limitation of data process models and representation approaches and techniques. Prerequisite: Two of CEE 420, CEE 421, CEE 422."
  },
  {
    "course_instance_id": "CEE 538 Water Quality Control Proc II C 31746",
    "course_id": "CEE 538",
    "course_number": 538,
    "subject": "CEE",
    "title": "Water Quality Control Proc II",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "C",
    "crn": 31746,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Theory and its application for design and operation of processes used in water and wastewater treatment; emphasis is on biological treatment processes and related processes for gas transfer, sludge dewatering, sludge disposal, and solids separations.",
    "prerequisites": "CEE 442 and CEE 443; credit or concurrent registration in CEE 444",
    "admin_notes": "Prerequisite: CEE 442 and CEE 443; credit or concurrent registration in CEE 444.",
    "topics": [
      "Theory and its application for design and operation of processes used in water and wastewater treatment",
      "emphasis is on biological treatment processes and related processes for gas transfer, sludge dewatering, sludge disposal, and solids separations"
    ],
    "embedding_text": "CEE 538 Water Quality Control Proc II. Theory and its application for design and operation of processes used in water and wastewater treatment; emphasis is on biological treatment processes and related processes for gas transfer, sludge dewatering, sludge disposal, and solids separations. Prerequisite: CEE 442 and CEE 443; credit or concurrent registration in CEE 444."
  },
  {
    "course_instance_id": "CEE 544 Advanced Surfaces and Colloids ONL 80644",
    "course_id": "CEE 544",
    "course_number": 544,
    "subject": "CEE",
    "title": "Advanced Surfaces and Colloids",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "ONL",
    "crn": 80644,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "The overall goal of this course is to provide an in-depth knowledge of surface science principles. The specific goals are to elaborate the classical theories, to identify their limitations from a fundamental level, and to provide the state-of-the-art extensions of classical theories, and alternative approaches based on recent literature. The course also seeks to provide students with state-of-the-art experimental approaches, and to provide a link between surface science and the student's research project or other interests, which is pursued through literature discussion in presentations and term paper.",
    "prerequisites": "CEE 442",
    "admin_notes": "Prerequisite: CEE 442.",
    "topics": [
      "The overall goal of this course is to provide an in-depth knowledge of surface science principles",
      "The specific goals are to elaborate the classical theories, to identify their limitations from a fundamental level, and to provide the state-of-the-art extensions of classical theories, and alternative approaches based on recent literature",
      "The course also seeks to provide students with state-of-the-art experimental approaches, and to provide a link between surface science and the student's research project or other interests, which is pursued through literature discussion in presentations and term paper"
    ],
    "embedding_text": "CEE 544 Advanced Surfaces and Colloids. The overall goal of this course is to provide an in-depth knowledge of surface science principles. The specific goals are to elaborate the classical theories, to identify their limitations from a fundamental level, and to provide the state-of-the-art extensions of classical theories, and alternative approaches based on recent literature. The course also seeks to provide students with state-of-the-art experimental approaches, and to provide a link between surface science and the student's research project or other interests, which is pursued through literature discussion in presentations and term paper. Prerequisite: CEE 442."
  },
  {
    "course_instance_id": "CEE 549 Globalization of Water GW 80784",
    "course_id": "CEE 549",
    "course_number": 549,
    "subject": "CEE",
    "title": "Globalization of Water",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "GW",
    "crn": 80784,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "This course focuses on water, food, and trade at the global scale. The course draws from hydrology, engineering, economics, causal inference, and complex systems analysis. Focus on global water resources, water footprints, network statistics, and causal inference. This class will enable graduate students to understand and contribute to research in this domain.",
    "prerequisites": "CEE 450",
    "admin_notes": "Prerequisite: CEE 450.",
    "topics": [
      "This course focuses on water, food, and trade at the global scale",
      "The course draws from hydrology, engineering, economics, causal inference, and complex systems analysis",
      "Focus on global water resources, water footprints, network statistics, and causal inference",
      "This class will enable graduate students to understand and contribute to research in this domain"
    ],
    "embedding_text": "CEE 549 Globalization of Water. This course focuses on water, food, and trade at the global scale. The course draws from hydrology, engineering, economics, causal inference, and complex systems analysis. Focus on global water resources, water footprints, network statistics, and causal inference. This class will enable graduate students to understand and contribute to research in this domain. Prerequisite: CEE 450."
  },
  {
    "course_instance_id": "CEE 553 River Morphodynamics G 58731",
    "course_id": "CEE 553",
    "course_number": 553,
    "subject": "CEE",
    "title": "River Morphodynamics",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "G",
    "crn": 58731,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "River morphology and characteristics of river sediment. Response of alluvial and bedrock rivers to changes in sediment supply, hydrology, and tectonics. Numerical modeling of river morphodynamics in gravel and sand bed rivers and deltas.",
    "prerequisites": "TAM 335",
    "admin_notes": "Same as GEOL 573. Prerequisite: TAM 335.",
    "topics": [
      "River morphology and characteristics of river sediment",
      "Response of alluvial and bedrock rivers to changes in sediment supply, hydrology, and tectonics",
      "Numerical modeling of river morphodynamics in gravel and sand bed rivers and deltas"
    ],
    "embedding_text": "CEE 553 River Morphodynamics. River morphology and characteristics of river sediment. Response of alluvial and bedrock rivers to changes in sediment supply, hydrology, and tectonics. Numerical modeling of river morphodynamics in gravel and sand bed rivers and deltas. Prerequisite: TAM 335."
  },
  {
    "course_instance_id": "CEE 554 Hydrologic Variability B 61986",
    "course_id": "CEE 554",
    "course_number": 554,
    "subject": "CEE",
    "title": "Hydrologic Variability",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "B",
    "crn": 61986,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Advanced quantitative treatment of catchment hydrology, focusing on analysis of observed hydrologic and hydroclimatic variability, and their interpretation in terms of the underlying processes. Concepts of heterogeneity and variability, scale and scaling, process change and process interactions will be emphasized. Theoretical foundations of hydrologic applications, such as flood estimation, water balance analyses, hydrologic modeling and associated scale problems will be discussed in sufficient detail to prepare students to undertake advanced research and professional practice.",
    "prerequisites": "CEE 450",
    "admin_notes": "Prerequisite: CEE 450.",
    "topics": [
      "Advanced quantitative treatment of catchment hydrology, focusing on analysis of observed hydrologic and hydroclimatic variability, and their interpretation in terms of the underlying processes",
      "Concepts of heterogeneity and variability, scale and scaling, process change and process interactions will be emphasized",
      "Theoretical foundations of hydrologic applications, such as flood estimation, water balance analyses, hydrologic modeling and associated scale problems will be discussed in sufficient detail to prepare students to undertake advanced research and professional practice"
    ],
    "embedding_text": "CEE 554 Hydrologic Variability. Advanced quantitative treatment of catchment hydrology, focusing on analysis of observed hydrologic and hydroclimatic variability, and their interpretation in terms of the underlying processes. Concepts of heterogeneity and variability, scale and scaling, process change and process interactions will be emphasized. Theoretical foundations of hydrologic applications, such as flood estimation, water balance analyses, hydrologic modeling and associated scale problems will be discussed in sufficient detail to prepare students to undertake advanced research and professional practice. Prerequisite: CEE 450."
  },
  {
    "course_instance_id": "CEE 555 Mixing in Environmental Flows J 46472",
    "course_id": "CEE 555",
    "course_number": 555,
    "subject": "CEE",
    "title": "Mixing in Environmental Flows",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "J",
    "crn": 46472,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Physical processes involved in transport of pollutants by water; turbulent diffusion and longitudinal dispersion in rivers, pipes, lakes, and the ocean; diffusion in turbulent jets, buoyant jets, and plumes.",
    "prerequisites": "MATH 285 and TAM 335",
    "admin_notes": "Prerequisite: MATH 285 and TAM 335.",
    "topics": [
      "Physical processes involved in transport of pollutants by water",
      "turbulent diffusion and longitudinal dispersion in rivers, pipes, lakes, and the ocean",
      "diffusion in turbulent jets, buoyant jets, and plumes"
    ],
    "embedding_text": "CEE 555 Mixing in Environmental Flows. Physical processes involved in transport of pollutants by water; turbulent diffusion and longitudinal dispersion in rivers, pipes, lakes, and the ocean; diffusion in turbulent jets, buoyant jets, and plumes. Prerequisite: MATH 285 and TAM 335."
  },
  {
    "course_instance_id": "CEE 556 Hydrocomplexity HC 73269",
    "course_id": "CEE 556",
    "course_number": 556,
    "subject": "CEE",
    "title": "Hydrocomplexity",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "HC",
    "crn": 73269,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Application of complex system science to water cycle and related processes in the atmosphere, ecosystems, critical zone and human systems. The course covers analytical and data driven approaches for characterization and understanding of non-linear systems, feedbacks and causality, chaos and fractals, complex network science, and emergent behavior. The course emphasizes emerging research frontiers along with traditional foundations through analytical understanding of non-linear dynamical systems, and their identification and characterization from observations.",
    "prerequisites": "CEE 450",
    "admin_notes": "Prerequisite: CEE 450.",
    "topics": [
      "Application of complex system science to water cycle and related processes in the atmosphere, ecosystems, critical zone and human systems",
      "The course covers analytical and data driven approaches for characterization and understanding of non-linear systems, feedbacks and causality, chaos and fractals, complex network science, and emergent behavior",
      "The course emphasizes emerging research frontiers along with traditional foundations through analytical understanding of non-linear dynamical systems, and their identification and characterization from observations"
    ],
    "embedding_text": "CEE 556 Hydrocomplexity. Application of complex system science to water cycle and related processes in the atmosphere, ecosystems, critical zone and human systems. The course covers analytical and data driven approaches for characterization and understanding of non-linear systems, feedbacks and causality, chaos and fractals, complex network science, and emergent behavior. The course emphasizes emerging research frontiers along with traditional foundations through analytical understanding of non-linear dynamical systems, and their identification and characterization from observations. Prerequisite: CEE 450."
  },
  {
    "course_instance_id": "CEE 557 Groundwater Modeling D 39559",
    "course_id": "CEE 557",
    "course_number": 557,
    "subject": "CEE",
    "title": "Groundwater Modeling",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "D",
    "crn": 39559,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Theory and application of numerical methods, finite differences and finite element, for solving the equations of groundwater flow and solute transport; transport of chemically reacting solutes; model calibration and verification.",
    "prerequisites": "CEE 457 and MATH 285",
    "admin_notes": "Prerequisite: CEE 457 and MATH 285.",
    "topics": [
      "Theory and application of numerical methods, finite differences and finite element, for solving the equations of groundwater flow and solute transport",
      "transport of chemically reacting solutes",
      "model calibration and verification"
    ],
    "embedding_text": "CEE 557 Groundwater Modeling. Theory and application of numerical methods, finite differences and finite element, for solving the equations of groundwater flow and solute transport; transport of chemically reacting solutes; model calibration and verification. Prerequisite: CEE 457 and MATH 285."
  },
  {
    "course_instance_id": "CEE 558 Environmental Hydrodynamics MG 78144",
    "course_id": "CEE 558",
    "course_number": 558,
    "subject": "CEE",
    "title": "Environmental Hydrodynamics",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "MG",
    "crn": 78144,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Introduction to dynamics, control, and modeling of flows in natural aquatic environments in the presence of space and time variations in density stratification caused by temperature, salinity, and suspended particles. Tools include scaling, dimensional analysis and turbulent boundary-layer theory leading to integral methods for solving flows such as plumes, density currents, thermal pollution, lake stratification, air-entrainment in spillways and salt wedges in estuaries. Integral methods are used to obtain engineering solutions followed by numerical modeling of turbulent boundary-layer flows in rivers, lakes and oceans.",
    "prerequisites": "CEE 451",
    "admin_notes": "Prerequisite: CEE 451.",
    "topics": [
      "Introduction to dynamics, control, and modeling of flows in natural aquatic environments in the presence of space and time variations in density stratification caused by temperature, salinity, and suspended particles",
      "Tools include scaling, dimensional analysis and turbulent boundary-layer theory leading to integral methods for solving flows such as plumes, density currents, thermal pollution, lake stratification, air-entrainment in spillways and salt wedges in estuaries",
      "Integral methods are used to obtain engineering solutions followed by numerical modeling of turbulent boundary-layer flows in rivers, lakes and oceans"
    ],
    "embedding_text": "CEE 558 Environmental Hydrodynamics. Introduction to dynamics, control, and modeling of flows in natural aquatic environments in the presence of space and time variations in density stratification caused by temperature, salinity, and suspended particles. Tools include scaling, dimensional analysis and turbulent boundary-layer theory leading to integral methods for solving flows such as plumes, density currents, thermal pollution, lake stratification, air-entrainment in spillways and salt wedges in estuaries. Integral methods are used to obtain engineering solutions followed by numerical modeling of turbulent boundary-layer flows in rivers, lakes and oceans. Prerequisite: CEE 451."
  },
  {
    "course_instance_id": "CEE 559 Sediment Transport E 39913",
    "course_id": "CEE 559",
    "course_number": 559,
    "subject": "CEE",
    "title": "Sediment Transport",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "E",
    "crn": 39913,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Physical processes of transportation and deposition of sediment particles in liquid bodies with particular emphasis on fluvial sediment problems; sediment in desilting basins; reservoirs and delta formation; erosion; stable channel design; river morphology.",
    "prerequisites": "CEE 451",
    "admin_notes": "Prerequisite: CEE 451.",
    "topics": [
      "Physical processes of transportation and deposition of sediment particles in liquid bodies with particular emphasis on fluvial sediment problems",
      "sediment in desilting basins",
      "reservoirs and delta formation",
      "stable channel design",
      "river morphology"
    ],
    "embedding_text": "CEE 559 Sediment Transport. Physical processes of transportation and deposition of sediment particles in liquid bodies with particular emphasis on fluvial sediment problems; sediment in desilting basins; reservoirs and delta formation; erosion; stable channel design; river morphology. Prerequisite: CEE 451."
  },
  {
    "course_instance_id": "CEE 560 Steel Structures III LM 50049",
    "course_id": "CEE 560",
    "course_number": 560,
    "subject": "CEE",
    "title": "Steel Structures III",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "LM",
    "crn": 50049,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Theories of ultimate behavior of metal structural members with emphasis on buckling and stability of members and frames; theory of torsion applied to beam torsion, lateral-torsional buckling, curved beams with emphasis on design criteria; post-buckling strength of plates and post-buckling versus column behavior.",
    "prerequisites": "CEE 462",
    "admin_notes": "Prerequisite: CEE 462.",
    "topics": [
      "Theories of ultimate behavior of metal structural members with emphasis on buckling and stability of members and frames",
      "theory of torsion applied to beam torsion, lateral-torsional buckling, curved beams with emphasis on design criteria",
      "post-buckling strength of plates and post-buckling versus column behavior"
    ],
    "embedding_text": "CEE 560 Steel Structures III. Theories of ultimate behavior of metal structural members with emphasis on buckling and stability of members and frames; theory of torsion applied to beam torsion, lateral-torsional buckling, curved beams with emphasis on design criteria; post-buckling strength of plates and post-buckling versus column behavior. Prerequisite: CEE 462."
  },
  {
    "course_instance_id": "CEE 562 Highway Bridge Design BA 69344",
    "course_id": "CEE 562",
    "course_number": 562,
    "subject": "CEE",
    "title": "Highway Bridge Design",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "BA",
    "crn": 69344,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "This course introduces current practices in highway bridge design. It provides students with the background to understand the American Association of State Highway and Transportation Officials (AASHTO) code. The course covers topics related the behavior, analysis, and design of bridge superstructure and substructure systems under various bridge loads. The course specifically addresses highway bridge types constructed using reinforced concrete, prestressed concrete, and steel. In addition, the course gets the students familiar with state-of-art methodologies adopted for bridge seismic retrofitting.",
    "prerequisites": "CEE 460, CEE 461, CEE 472",
    "admin_notes": "This class will meet twice a week for 80 minutes per class. Prerequisite: CEE 460, CEE 461, CEE 472.",
    "topics": [
      "This course introduces current practices in highway bridge design",
      "It provides students with the background to understand the American Association of State Highway and Transportation Officials (AASHTO) code",
      "The course covers topics related the behavior, analysis, and design of bridge superstructure and substructure systems under various bridge loads",
      "The course specifically addresses highway bridge types constructed using reinforced concrete, prestressed concrete, and steel",
      "In addition, the course gets the students familiar with state-of-art methodologies adopted for bridge seismic retrofitting"
    ],
    "embedding_text": "CEE 562 Highway Bridge Design. This course introduces current practices in highway bridge design. It provides students with the background to understand the American Association of State Highway and Transportation Officials (AASHTO) code. The course covers topics related the behavior, analysis, and design of bridge superstructure and substructure systems under various bridge loads. The course specifically addresses highway bridge types constructed using reinforced concrete, prestressed concrete, and steel. In addition, the course gets the students familiar with state-of-art methodologies adopted for bridge seismic retrofitting. Prerequisite: CEE 460, CEE 461, CEE 472."
  },
  {
    "course_instance_id": "CEE 570 Finite Element Methods D 31749",
    "course_id": "CEE 570",
    "course_number": 570,
    "subject": "CEE",
    "title": "Finite Element Methods",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "D",
    "crn": 31749,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Theory and application of the finite element method; stiffness matrices for triangular, quadrilateral, and isoparametric elements; two- and three-dimensional elements; algorithms necessary for the assembly and solution; direct stress and plate bending problems for static, nonlinear buckling and dynamic load conditions; displacement, hybrid, and mixed models together with their origin in variational methods.",
    "prerequisites": "CEE 471 or TAM 551",
    "admin_notes": "Same as CSE 551. Prerequisite: CEE 471 or TAM 551.",
    "topics": [
      "Theory and application of the finite element method",
      "stiffness matrices for triangular, quadrilateral, and isoparametric elements",
      "two- and three-dimensional elements",
      "algorithms necessary for the assembly and solution",
      "direct stress and plate bending problems for static, nonlinear buckling and dynamic load conditions",
      "displacement, hybrid, and mixed models together with their origin in variational methods"
    ],
    "embedding_text": "CEE 570 Finite Element Methods. Theory and application of the finite element method; stiffness matrices for triangular, quadrilateral, and isoparametric elements; two- and three-dimensional elements; algorithms necessary for the assembly and solution; direct stress and plate bending problems for static, nonlinear buckling and dynamic load conditions; displacement, hybrid, and mixed models together with their origin in variational methods. Prerequisite: CEE 471 or TAM 551."
  },
  {
    "course_instance_id": "CEE 575 Fracture and Fatigue D 29840",
    "course_id": "CEE 575",
    "course_number": 575,
    "subject": "CEE",
    "title": "Fracture and Fatigue",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "D",
    "crn": 29840,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Fatigue and fracture behavior of metallic structures and connections; fatigue and fracture mechanics theory; generation and use of laboratory data; background and application of international testing and assessment standards.",
    "prerequisites": "One of CEE 471, TAM 451, TAM 551",
    "admin_notes": "Same as AE 521. Prerequisite: One of CEE 471, TAM 451, TAM 551. This section is for CEE students.",
    "topics": [
      "Fatigue and fracture behavior of metallic structures and connections",
      "fatigue and fracture mechanics theory",
      "generation and use of laboratory data",
      "background and application of international testing and assessment standards"
    ],
    "embedding_text": "CEE 575 Fracture and Fatigue. Fatigue and fracture behavior of metallic structures and connections; fatigue and fracture mechanics theory; generation and use of laboratory data; background and application of international testing and assessment standards. Prerequisite: One of CEE 471, TAM 451, TAM 551."
  },
  {
    "course_instance_id": "CEE 576 Nonlinear Finite Elements F 53805",
    "course_id": "CEE 576",
    "course_number": 576,
    "subject": "CEE",
    "title": "Nonlinear Finite Elements",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "F",
    "crn": 53805,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Nonlinear formulations in solid mechanics and nonlinear equation solving strategies; finite deformation (hyperelasticity) elastostatics and elastodynamics, semi-discrete weighted residual formulations, implicit and explicit time-stepping algorithms and stability analysis; theory of mixed finite element methods, strain-projection methods, and stabilized methods; mixed methods for nonlinear coupled-field problems.",
    "prerequisites": "CEE 471 or TAM 445; CEE 470 or ME 471",
    "admin_notes": "Same as CSE 552. Prerequisite: CEE 471 or TAM 445; CEE 470 or ME 471.",
    "topics": [
      "Nonlinear formulations in solid mechanics and nonlinear equation solving strategies",
      "finite deformation (hyperelasticity) elastostatics and elastodynamics, semi-discrete weighted residual formulations, implicit and explicit time-stepping algorithms and stability analysis",
      "theory of mixed finite element methods, strain-projection methods, and stabilized methods",
      "mixed methods for nonlinear coupled-field problems"
    ],
    "embedding_text": "CEE 576 Nonlinear Finite Elements. Nonlinear formulations in solid mechanics and nonlinear equation solving strategies; finite deformation (hyperelasticity) elastostatics and elastodynamics, semi-discrete weighted residual formulations, implicit and explicit time-stepping algorithms and stability analysis; theory of mixed finite element methods, strain-projection methods, and stabilized methods; mixed methods for nonlinear coupled-field problems. Prerequisite: CEE 471 or TAM 445; CEE 470 or ME 471."
  },
  {
    "course_instance_id": "CEE 590 Geotechnical Field Measurement ONL 71947",
    "course_id": "CEE 590",
    "course_number": 590,
    "subject": "CEE",
    "title": "Geotechnical Field Measurement",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "ONL",
    "crn": 71947,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Discussion of observational method in geotechnical engineering. Historical, theoretical, experimental, and empirical development of in-situ tests and instrumentation in geotechnical engineering. Practical applications and limitation of field testing devices and instruments. Interpretation of test results and measurements for geotechnical site characterization. Discussion of data acquisition systems and data management. Introduction of emerging technologies in field testing and instrumentation.",
    "prerequisites": "CEE 483 and CEE 484",
    "admin_notes": "Prerequisite: CEE 483 and CEE 484.",
    "topics": [
      "Discussion of observational method in geotechnical engineering",
      "Historical, theoretical, experimental, and empirical development of in-situ tests and instrumentation in geotechnical engineering",
      "Practical applications and limitation of field testing devices and instruments",
      "Interpretation of test results and measurements for geotechnical site characterization",
      "Discussion of data acquisition systems and data management",
      "Introduction of emerging technologies in field testing and instrumentation"
    ],
    "embedding_text": "CEE 590 Geotechnical Field Measurement. Discussion of observational method in geotechnical engineering. Historical, theoretical, experimental, and empirical development of in-situ tests and instrumentation in geotechnical engineering. Practical applications and limitation of field testing devices and instruments. Interpretation of test results and measurements for geotechnical site characterization. Discussion of data acquisition systems and data management. Introduction of emerging technologies in field testing and instrumentation. Prerequisite: CEE 483 and CEE 484."
  },
  {
    "course_instance_id": "CEE 591 Reliability Analysis ONL 80646",
    "course_id": "CEE 591",
    "course_number": 591,
    "subject": "CEE",
    "title": "Reliability Analysis",
    "associated_term": "Fall 2025 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Online",
    "section_number": "ONL",
    "crn": 80646,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Introduction to applied probability theory and random processes, Bayesian analysis of model uncertainties. Formulation of reliability for components and systems. Exact solutions for special cases. Approximate solutions by second-moments, first- and second-order reliability methods (FORM and SORM), the response surface method, simulation methods including importance sampling techniques. Reliability-based optimal design and probabilistic design codes. Time- and space-variant reliability formulations.",
    "prerequisites": "CEE 491",
    "admin_notes": "Prerequisite: CEE 491.",
    "topics": [
      "Introduction to applied probability theory and random processes, Bayesian analysis of model uncertainties",
      "Formulation of reliability for components and systems",
      "Exact solutions for special cases",
      "Approximate solutions by second-moments, first- and second-order reliability methods (FORM and SORM), the response surface method, simulation methods including importance sampling techniques",
      "Reliability-based optimal design and probabilistic design codes",
      "Time- and space-variant reliability formulations"
    ],
    "embedding_text": "CEE 591 Reliability Analysis. Introduction to applied probability theory and random processes, Bayesian analysis of model uncertainties. Formulation of reliability for components and systems. Exact solutions for special cases. Approximate solutions by second-moments, first- and second-order reliability methods (FORM and SORM), the response surface method, simulation methods including importance sampling techniques. Reliability-based optimal design and probabilistic design codes. Time- and space-variant reliability formulations. Prerequisite: CEE 491."
  },
  {
    "course_instance_id": "CEE 592 Sustainable Urban Systems D 61987",
    "course_id": "CEE 592",
    "course_number": 592,
    "subject": "CEE",
    "title": "Sustainable Urban Systems",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "D",
    "crn": 61987,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Fundamental concepts of sustainability and resilience in urban systems, including the complex interactions among human, engineered, and natural systems. Project-based format, focusing on real-world problems solicited from government agencies, industry, and non-governmental organizations in one or more partnering cities. Students work in multidisciplinary teams with faculty advisors from multiple departments and colleges.",
    "prerequisites": "One of ATMS 421, CEE 491, NRES 439, UP 456, UP 480, or equivalent course related to sustainable urban systems; and one of NRES 454, UP 418, GEOG 480, or equivalent course related to geographic information systems (GIS)",
    "admin_notes": "Same as NRES 592 and UP 576. Prerequisite: One of ATMS 421, CEE 491, NRES 439, UP 456, UP 480, or equivalent course related to sustainable urban systems; and one of NRES 454, UP 418, GEOG 480, or equivalent course related to geographic information systems (GIS). Fundamental concepts of sustainability and resilience in urban systems, including the complex interactions among human, engineered, and natural systems. Course will include both engineering and social science perspectives of urban sustainability. Project and discussion based format, with flexibility to choose project related to a student s research interests.",
    "topics": [
      "Fundamental concepts of sustainability and resilience in urban systems, including the complex interactions among human, engineered, and natural systems",
      "Project-based format, focusing on real-world problems solicited from government agencies, industry, and non-governmental organizations in one or more partnering cities",
      "Students work in multidisciplinary teams with faculty advisors from multiple departments and colleges"
    ],
    "embedding_text": "CEE 592 Sustainable Urban Systems. Fundamental concepts of sustainability and resilience in urban systems, including the complex interactions among human, engineered, and natural systems. Project-based format, focusing on real-world problems solicited from government agencies, industry, and non-governmental organizations in one or more partnering cities. Students work in multidisciplinary teams with faculty advisors from multiple departments and colleges. Prerequisite: One of ATMS 421, CEE 491, NRES 439, UP 456, UP 480, or equivalent course related to sustainable urban systems; and one of NRES 454, UP 418, GEOG 480, or equivalent course related to geographic information systems (GIS)."
  },
  {
    "course_instance_id": "CEE 593 Tunneling in Soil and Rock G 73052",
    "course_id": "CEE 593",
    "course_number": 593,
    "subject": "CEE",
    "title": "Tunneling in Soil and Rock",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "G",
    "crn": 73052,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "History of development of tunneling design and methods. Relationship of geology on anticipated ground response to tunneling. Study of tunneling methods unique to tunnels in soil, tunnels in rock, caverns in soils and caverns in rock. Analysis approaches for tunnels in soils and rock. Geotechnical Baselines report and other risk allocation tools for tunnel construction. Case histories of tunneling projects.",
    "prerequisites": "CEE 483 required",
    "admin_notes": "The course lectures will be scheduled for twice a week for 80 minutes each class during a 16 week semester. Prerequisite: CEE 483 required. Credit or concurrent enrollment in CEE 484 is required.",
    "topics": [
      "History of development of tunneling design and methods",
      "Relationship of geology on anticipated ground response to tunneling",
      "Study of tunneling methods unique to tunnels in soil, tunnels in rock, caverns in soils and caverns in rock",
      "Analysis approaches for tunnels in soils and rock",
      "Geotechnical Baselines report and other risk allocation tools for tunnel construction",
      "Case histories of tunneling projects"
    ],
    "embedding_text": "CEE 593 Tunneling in Soil and Rock. History of development of tunneling design and methods. Relationship of geology on anticipated ground response to tunneling. Study of tunneling methods unique to tunnels in soil, tunnels in rock, caverns in soils and caverns in rock. Analysis approaches for tunnels in soils and rock. Geotechnical Baselines report and other risk allocation tools for tunnel construction. Case histories of tunneling projects. Prerequisite: CEE 483 required."
  },
  {
    "course_instance_id": "CEE 595 Adv Environmental Engr Seminar AG 31753",
    "course_id": "CEE 595",
    "course_number": 595,
    "subject": "CEE",
    "title": "Adv Environmental Engr Seminar",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Seminar",
    "section_number": "AG",
    "crn": 31753,
    "credit_hours": 1,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Discussion of current topics in civil and environmental engineering and related fields by staff, students, and visiting lecturers.",
    "prerequisites": null,
    "admin_notes": "Approved for S/U grading only. May be repeated. SECTION 595 AG: Environmental Ph.D. students and second year M.S. students must enroll in CEE 595 AG each semester.",
    "topics": [
      "Discussion of current topics in civil and environmental engineering and related fields by staff, students, and visiting lecturers"
    ],
    "embedding_text": "CEE 595 Adv Environmental Engr Seminar. Discussion of current topics in civil and environmental engineering and related fields by staff, students, and visiting lecturers."
  },
  {
    "course_instance_id": "CEE 597 Independent Study 0 10476",
    "course_id": "CEE 597",
    "course_number": 597,
    "subject": "CEE",
    "title": "Independent Study",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Independent Study",
    "section_number": "0",
    "crn": 10476,
    "credit_hours": 1,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Individual investigations or studies of any phase of civil engineering selected by the student and approved by the adviser and the staff member who will supervise the investigation.",
    "prerequisites": "Consent of instructor",
    "admin_notes": "May be repeated. Prerequisite: Consent of instructor.",
    "topics": [
      "Individual investigations or studies of any phase of civil engineering selected by the student and approved by the adviser and the staff member who will supervise the investigation"
    ],
    "embedding_text": "CEE 597 Independent Study. Individual investigations or studies of any phase of civil engineering selected by the student and approved by the adviser and the staff member who will supervise the investigation. Prerequisite: Consent of instructor."
  },
  {
    "course_instance_id": "CEE 598 Electric Traction ET 31761",
    "course_id": "CEE 598",
    "course_number": 598,
    "subject": "CEE",
    "title": "Electric Traction",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "ET",
    "crn": 31761,
    "credit_hours": 2,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites.",
    "prerequisites": null,
    "admin_notes": "May be repeated in the same or separate terms if topics vary.",
    "topics": [
      "Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum",
      "See Class Schedule or departmental course information for topics and prerequisites"
    ],
    "embedding_text": "CEE 598 Electric Traction. Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites."
  },
  {
    "course_instance_id": "CEE 598 Rail Vehicle Dynamics RVD 59655",
    "course_id": "CEE 598",
    "course_number": 598,
    "subject": "CEE",
    "title": "Rail Vehicle Dynamics",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "RVD",
    "crn": 59655,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites.",
    "prerequisites": null,
    "admin_notes": "May be repeated in the same or separate terms if topics vary. Railway transportation demand for both freight and passengers is increasing throughout the world. A special characteristic of the railway system is that the vehicle and infrastructure are extremely dependent on each other. An understanding of the dynamic interaction between vehicle and track is crucial for an engineer working in this sector. The course starts with a brief description of the vehicle and the track. The dynamic interaction between vehicle and track is then divided into the quasistatic part and the real dynamic interaction. Quasistatic vehicle track interaction deals with how to design curves with regard to curve radius and cant to achieve comfortable curve negotiation. The equations of motion needed to evaluate the vibration comfort in the vehicle and to determine the critical hunting speed are derived. Analysis methods such as calculation of eigenvalues and frequency response functions are explained and trained with help of exercises. The kinematic wheel-rail interaction is described and widely used terms like conicity are introduced. The wheel-rail contact theory needed to develop simulation models is explained. The theory introduced is then used to judge vehicle performance like ride comfort, wheel or rail wear behavior and derailment safety. Examples of typical running behavior for different types of running gear are discussed. Prerequisites: CEE 408 or 409, or permission by instructor.",
    "topics": [
      "Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum",
      "See Class Schedule or departmental course information for topics and prerequisites"
    ],
    "embedding_text": "CEE 598 Rail Vehicle Dynamics. Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites."
  },
  {
    "course_instance_id": "CEE 598 Structural Damping SD 49530",
    "course_id": "CEE 598",
    "course_number": 598,
    "subject": "CEE",
    "title": "Structural Damping",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "SD",
    "crn": 49530,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites.",
    "prerequisites": null,
    "admin_notes": "May be repeated in the same or separate terms if topics vary. Structural Damping",
    "topics": [
      "Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum",
      "See Class Schedule or departmental course information for topics and prerequisites"
    ],
    "embedding_text": "CEE 598 Structural Damping. Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites."
  },
  {
    "course_instance_id": "CEE 598 Design of Tall Buildings TB 46695",
    "course_id": "CEE 598",
    "course_number": 598,
    "subject": "CEE",
    "title": "Design of Tall Buildings",
    "associated_term": "Spring 2026 - Urbana-Champaign",
    "campus": "Urbana-Champaign",
    "schedule_type": "Lecture-Discussion",
    "section_number": "TB",
    "crn": 46695,
    "credit_hours": 4,
    "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
    "raw_description": "Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites.",
    "prerequisites": null,
    "admin_notes": "May be repeated in the same or separate terms if topics vary.",
    "topics": [
      "Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum",
      "See Class Schedule or departmental course information for topics and prerequisites"
    ],
    "embedding_text": "CEE 598 Design of Tall Buildings. Subject offerings of new and developing areas of knowledge in civil and environmental engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites."
  }
]