[
    {
      "course_instance_id": "ECE 402 Electronic Music Synthesis AB 65853",
      "course_id": "ECE 402",
      "course_number": 402,
      "subject": "ECE",
      "title": "Electronic Music Synthesis",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Laboratory",
      "section_number": "AB",
      "crn": 65853,
      "credit_hours": 3,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Historical survey of electronic and computer music technology; parameters of musical expression and their codification; analysis and synthesis of fixed sound spectra; time-variant spectrum analysis/synthesis of musical sounds; algorithms for dynamic sound synthesis. Course Information: 3 undergraduate hours. 3 graduate hours.",
      "prerequisites": "ECE 310",
      "admin_notes": null,
      "topics": [
        "electronic music technology",
        "computer music",
        "sound spectrum analysis",
        "time-variant synthesis",
        "dynamic sound synthesis",
        "musical expression parameters"
      ],
      "embedding_text": "ECE 402 Electronic Music Synthesis. Historical survey of electronic and computer music technology; parameters of musical expression and their codification; analysis and synthesis of fixed sound spectra; time-variant spectrum analysis/synthesis of musical sounds; algorithms for dynamic sound synthesis. Prerequisite: ECE 310."
    },
    {
      "course_instance_id": "ECE 406 Quantum Optics and Devices QO3 77272",
      "course_id": "ECE 406",
      "course_number": 406,
      "subject": "ECE",
      "title": "Quantum Optics and Devices",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Lecture",
      "section_number": "QO3",
      "crn": 77272,
      "credit_hours": 3,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Introduces students to essential physics and devices of quantum technologies. The first half of the course focuses on concepts and formalisms of quantum optics. In the second half the same concepts and related theoretical tools are used to study a broader range of quantum device platforms and the associated literatures. Course Information: 3 undergraduate hours. 4 graduate hours.",
      "prerequisites": "ECE 305 or equivalent",
      "admin_notes": "This course prepares ECE students with the essential quantum physics and device knowledge for the advent of quantum technology. The first half of the course will cover concepts and formalisms developed in quantum optics, which are widely used for analysis of various quantum devices and systems. The second half of the course will be focused on the application of the theoretical tools to study different quantum device platforms.",
      "topics": [
        "quantum optics",
        "quantum device platforms",
        "quantum technology",
        "optical formalisms",
        "device physics",
        "theoretical tools"
      ],
      "embedding_text": "ECE 406 Quantum Optics and Devices. Introduces essential physics and devices of quantum technologies. Covers concepts and formalisms of quantum optics and applies theoretical tools to a range of quantum device platforms. Prerequisite: ECE 305 or equivalent."
    },
    {
      "course_instance_id": "ECE 408 Applied Parallel Programming CSP 77405",
      "course_id": "ECE 408",
      "course_number": 408,
      "subject": "ECE",
      "title": "Applied Parallel Programming",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Packaged Section",
      "section_number": "CSP",
      "crn": 77405,
      "credit_hours": 4,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Parallel programming with emphasis on developing applications for processors with many computation cores. Computational thinking, forms of parallelism, programming models, mapping computations to parallel hardware, efficient data structures, paradigms for efficient parallel algorithms, and application case studies. Course Information: Same as CS 483 and CSE 408. 4 undergraduate hours. 4 graduate hours.",
      "prerequisites": "ECE 220",
      "admin_notes": "This section is intended for Chicago City Scholars only. There may be online and in person components. You are responsible for completing homework, quizzes, and any in person activities that are required. Please speak with your professor regarding expectations. In-person meeting in Classroom B at 200 S. Wacker Dr. Chicago.",
      "topics": [
        "parallel programming",
        "many-core processors",
        "programming models",
        "parallel algorithms",
        "efficient data structures",
        "mapping computations"
      ],
      "embedding_text": "ECE 408 Applied Parallel Programming. Parallel programming for many-core processors; computational thinking; forms of parallelism; programming models; mapping computations to parallel hardware; efficient data structures; paradigms for parallel algorithms; application case studies. Prerequisite: ECE 220."
    },
    {
      "course_instance_id": "ECE 411 Computer Organization & Design AL 32816",
      "course_id": "ECE 411",
      "course_number": 411,
      "subject": "ECE",
      "title": "Computer Organization & Design",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Lecture",
      "section_number": "AL",
      "crn": 32816,
      "credit_hours": 4,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Basic computer organization and design: integer and floating-point computer arithmetic; control unit design; pipelining; system interconnect; memory organization; I/O design; reliability and performance evaluation. Laboratory for computer design implementation, simulation, and layout. Course Information: 4 undergraduate hours. 4 graduate hours.",
      "prerequisites": "ECE 385 and either ECE 391 or CS 341",
      "admin_notes": "Students must register for one lab and one discussion section.",
      "topics": [
        "computer organization",
        "computer arithmetic",
        "control unit",
        "pipelining",
        "memory organization",
        "I/O design",
        "performance evaluation"
      ],
      "embedding_text": "ECE 411 Computer Organization & Design. Covers integer and floating-point arithmetic, control unit design, pipelining, interconnect, memory organization, I/O design, reliability and performance evaluation, with lab implementation and simulation. Prerequisite: ECE 385 and either ECE 391 or CS 341."
    },
    {
      "course_instance_id": "ECE 416 Biosensors A 49920",
      "course_id": "ECE 416",
      "course_number": 416,
      "subject": "ECE",
      "title": "Biosensors",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Lecture",
      "section_number": "A",
      "crn": 49920,
      "credit_hours": 3,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Underlying engineering principles used to detect small molecules, DNA, proteins, and cells in the context of applications in diagnostic testing, pharmaceutical research, and environmental monitoring. Biosensor approaches including electrochemistry, fluorescence, acoustics, and optics; aspects of selective surface chemistry including methods for biomolecule attachment to transducer surfaces; characterization of bisensor performance; blood glucose detection; fluorescent DNA microarrays; label-free biochips; bead-based assay methods. Case studies and analysis of commercial biosensor. Course Information: Same as BIOE 416. 3 undergraduate hours. 3 graduate hours.",
      "prerequisites": "ECE 329",
      "admin_notes": null,
      "topics": [
        "biosensors",
        "electrochemistry",
        "fluorescence",
        "surface chemistry",
        "biochips",
        "diagnostic testing",
        "sensor characterization"
      ],
      "embedding_text": "ECE 416 Biosensors. Principles and approaches for detecting small molecules, DNA, proteins and cells; electrochemical, fluorescence, acoustic and optical biosensors; selective surface chemistry; performance characterization and case studies. Prerequisite: ECE 329."
    },
    {
      "course_instance_id": "ECE 418 Image & Video Processing NB1 33737",
      "course_id": "ECE 418",
      "course_number": 418,
      "subject": "ECE",
      "title": "Image & Video Processing",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Laboratory",
      "section_number": "NB1",
      "crn": 33737,
      "credit_hours": 4,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Concepts and applications in image and video processing; introduction to multidimensional signal processing: sampling, Fourier transform, filtering, interpolation, and decimation; human visual perception; scanning and display of images and video; image enhancement, restoration and segmentation; digital image and video compression; image analysis. Laboratory exercises promote experience with topics and development of C and MATLAB programs. Course Information: 4 undergraduate hours. 4 graduate hours.",
      "prerequisites": "ECE 310; credit or concurrent registration in one of ECE 313, STAT 400, IE 300, MATH 461; MATH 415; experience with C programming language",
      "admin_notes": null,
      "topics": [
        "image processing",
        "video processing",
        "multidimensional signal processing",
        "Fourier transform",
        "filtering",
        "compression",
        "segmentation",
        "human visual perception"
      ],
      "embedding_text": "ECE 418 Image & Video Processing. Covers multidimensional signal processing, sampling, Fourier transform, filtering, interpolation/decimation, human visual perception, enhancement, restoration, segmentation, compression and image analysis with C/MATLAB labs. Prerequisites: ECE 310; concurrent statistics/linear systems background; C experience."
    },
    {
      "course_instance_id": "ECE 420 Embedded DSP Laboratory ABA 33739",
      "course_id": "ECE 420",
      "course_number": 420,
      "subject": "ECE",
      "title": "Embedded DSP Laboratory",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Laboratory",
      "section_number": "ABA",
      "crn": 33739,
      "credit_hours": 2,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Development of real-time digital signal processing (DSP) systems using a DSP microprocessor; several structured laboratory exercises, such as sampling and digital filtering; followed by an extensive DSP project of the student's choice. Course Information: 2 undergraduate hours. 2 graduate hours.",
      "prerequisites": "ECE 310",
      "admin_notes": null,
      "topics": [
        "embedded DSP",
        "real-time systems",
        "DSP microprocessors",
        "sampling",
        "digital filtering",
        "hardware labs",
        "DSP project"
      ],
      "embedding_text": "ECE 420 Embedded DSP Laboratory. Real-time DSP system development using DSP microprocessors; labs on sampling and digital filtering; culminating project. Prerequisite: ECE 310."
    },
    {
      "course_instance_id": "ECE 425 Intro to VLSI System Design AL1 33853",
      "course_id": "ECE 425",
      "course_number": 425,
      "subject": "ECE",
      "title": "Intro to VLSI System Design",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Lecture",
      "section_number": "AL1",
      "crn": 33853,
      "credit_hours": 3,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Complementary Metal-Oxide Semiconductor (CMOS) technology and theory; CMOS circuit and logic design; layout rules and techniques; circuit characterization and performance estimation; CMOS subsystem design; Very-Large-Scale Integrated (VLSI) systems design methods; VLSI Computer Aided Design (CAD) tools; workstation-based custom VLSI chip design using concepts of cell hierarchy; final project involving specification, design, and evaluation of a VLSI chip or VLSI CAD program; written report and oral presentation on the final project. Course Information: 3 undergraduate hours. 3 graduate hours.",
      "prerequisites": "ECE 385 or CS 233",
      "admin_notes": null,
      "topics": [
        "CMOS technology",
        "CMOS logic design",
        "VLSI layout",
        "circuit characterization",
        "performance estimation",
        "VLSI CAD tools",
        "cell hierarchy",
        "custom chip design"
      ],
      "embedding_text": "ECE 425 Intro to VLSI System Design. CMOS technology and theory; CMOS circuit and logic design; layout rules and techniques; circuit characterization and performance estimation; CMOS subsystem design; VLSI design methods and CAD tools; workstation-based custom VLSI chip design using cell hierarchy; final chip/CAD project with report and presentation. Prerequisite: ECE 385 or CS 233."
    },
    {
      "course_instance_id": "ECE 431 Electric Machinery ABC 33879",
      "course_id": "ECE 431",
      "course_number": 431,
      "subject": "ECE",
      "title": "Electric Machinery",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Laboratory",
      "section_number": "ABC",
      "crn": 33879,
      "credit_hours": 4,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Theory and laboratory experimentation with three-phase power, power-factor correction, single- and three-phase transformers, induction machines, DC machines, and synchronous machines; project work on energy control systems; digital simulation of machine dynamics. Course Information: 4 undergraduate hours. 4 graduate hours.",
      "prerequisites": "ECE 330",
      "admin_notes": null,
      "topics": [
        "three-phase power",
        "transformers",
        "induction machines",
        "DC machines",
        "synchronous machines",
        "power-factor correction",
        "machine simulation"
      ],
      "embedding_text": "ECE 431 Electric Machinery. Covers three-phase power, power-factor correction, transformers, induction/DC/synchronous machines, energy control projects and digital simulation of machine dynamics. Prerequisite: ECE 330."
    },
    {
      "course_instance_id": "ECE 434 Real World Algorithms - IoT/DS OLC 75205",
      "course_id": "ECE 434",
      "course_number": 434,
      "subject": "ECE",
      "title": "Real World Algorithms - IoT/DS",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Online Lecture",
      "section_number": "OLC",
      "crn": 75205,
      "credit_hours": 4,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Introduction to cross-disciplinary ideas and techniques in mobile computing, with an emphasis on how they can be composed to build systems and applications on smartphones, tablets, and wearable devices. Topics of interest include smartphone sensing, energy efficiency, indoor localization, augmented reality, context-awareness, gesture recognition, and data analytics. Various techniques and methods utilized to combine them into functional systems, propose a new system, define the underlying problems, and solve them end to end. Course Information: Same as CS 434. 3 undergraduate hours. 4 graduate hours.",
      "prerequisites": "ECE 391, CS 241, CS 341 or ECE 310",
      "admin_notes": null,
      "topics": [
        "mobile computing",
        "smartphone sensing",
        "energy efficiency",
        "indoor localization",
        "augmented reality",
        "context-aware systems",
        "gesture recognition",
        "data analytics"
      ],
      "embedding_text": "ECE 434 Real World Algorithms - IoT/DS. Cross-disciplinary mobile computing techniques for systems on smartphones/tablets/wearables; sensing, energy efficiency, indoor localization, AR, context-awareness, gesture recognition and analytics with end-to-end system design focus. Prerequisites: ECE 391/CS 241/CS 341 or ECE 310."
    },
    {
      "course_instance_id": "ECE 443 LEDs and Solar Cells CB2 69249",
      "course_id": "ECE 443",
      "course_number": 443,
      "subject": "ECE",
      "title": "LEDs and Solar Cells",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Laboratory",
      "section_number": "CB2",
      "crn": 69249,
      "credit_hours": 4,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "This course explores the energy conversion devices from fundamentals to system-levels including electronic structure of semiconductors; quantum physics; compound semiconductors; semiconductor heterostructures and low dimensional quantum structures; energy transfer between photons and electron-hole pairs; photon emission and capture processes; radiative and non-radiative processes; light extraction and trapping; emission and absorption engineering; electrical and optical modelling via numerical and TCAD simulation tools; hands-on characterization of modern light emitting diodes and solar cells. Course Information: 4 undergraduate hours. 4 graduate hours.",
      "prerequisites": "ECE 340",
      "admin_notes": null,
      "topics": [
        "LEDs",
        "solar cells",
        "semiconductor heterostructures",
        "photon-electron interactions",
        "radiative processes",
        "light extraction",
        "TCAD simulation",
        "energy conversion"
      ],
      "embedding_text": "ECE 443 LEDs and Solar Cells. Energy conversion devices from fundamentals to systems: semiconductor electronic structure, heterostructures/quantum structures, photon emission/capture, radiative/non-radiative processes, light extraction/trapping, emission/absorption engineering, numerical/TCAD modeling and hands-on characterization. Prerequisite: ECE 340."
    },
    {
      "course_instance_id": "ECE 444 IC Device Theory & Fabrication AB4 33905",
      "course_id": "ECE 444",
      "course_number": 444,
      "subject": "ECE",
      "title": "IC Device Theory & Fabrication",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Laboratory",
      "section_number": "AB4",
      "crn": 33905,
      "credit_hours": 4,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Fabrication lab emphasizing physical theory and design of devices suitable for integrated circuitry; electrical properties of semiconductors and techniques (epitaxial growth, oxidation, photolithography diffusion, ion implantation, metallization, and characterization) for fabricating integrated circuit devices such as p-n junction diodes, bipolar transistors, and field effect transistors. Course Information: 4 undergraduate hours. 4 graduate hours.",
      "prerequisites": "ECE 340",
      "admin_notes": "All lab sections meet during the first week of classes. Students who miss their first lab session will be immediately dropped and the slot opened for another student. Anyone who adds the class during the first week, and has a lab section that has already met, must immediately contact the lab engineer Dane Sievers (dsievers@illinois.edu). No one may add the class after the first week of the semester. This lab is held in 259 MNTL.",
      "topics": [
        "IC fabrication",
        "semiconductor properties",
        "epitaxial growth",
        "oxidation",
        "photolithography",
        "ion implantation",
        "metallization",
        "device characterization"
      ],
      "embedding_text": "ECE 444 IC Device Theory & Fabrication. Fabrication lab covering physical theory and design for integrated circuit devices; semiconductor electrical properties; epitaxial growth, oxidation, photolithography, diffusion, ion implantation, metallization and characterization; devices including diodes, bipolar transistors and FETs. Prerequisite: ECE 340."
    },
    {
      "course_instance_id": "ECE 445 Senior Design Project Lab H 56597",
      "course_id": "ECE 445",
      "course_number": 445,
      "subject": "ECE",
      "title": "Senior Design Project Lab",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Laboratory",
      "section_number": "H",
      "crn": 56597,
      "credit_hours": 4,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Team-based design projects in various areas of electrical and computer engineering; projects are chosen by students with approval of instructor. A professionally kept lab notebook, a written report, prepared to journal publication standards, and an oral presentation required. The projects involve building and testing of the designed hardware device and a demonstration of the device is required. Course Information: 4 undergraduate hours. No graduate credit.",
      "prerequisites": "ECE 385; Restricted to Senior standing",
      "admin_notes": "Additional Laboratory time to be arranged in 2070 ECEB.",
      "topics": [
        "senior design",
        "team-based projects",
        "hardware prototyping",
        "testing and demonstration",
        "technical writing",
        "oral presentation"
      ],
      "embedding_text": "ECE 445 Senior Design Project Lab. Team-based ECE design projects with approved topics; requires lab notebook, journal-style report and oral presentation; building, testing and demonstration of hardware. Prerequisite: ECE 385; Senior standing."
    },
    {
      "course_instance_id": "ECE 454 Antennas B 33920",
      "course_id": "ECE 454",
      "course_number": 454,
      "subject": "ECE",
      "title": "Antennas",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Discussion/Recitation",
      "section_number": "B",
      "crn": 33920,
      "credit_hours": 3,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Antenna parameters; polarization of electromagnetic waves; basic antenna types; antenna arrays; broadband antenna design; antenna measurements. Course Information: 3 undergraduate hours. 3 graduate hours.",
      "prerequisites": "ECE 350",
      "admin_notes": null,
      "topics": [
        "antenna parameters",
        "polarization",
        "antenna types",
        "antenna arrays",
        "broadband design",
        "antenna measurements"
      ],
      "embedding_text": "ECE 454 Antennas. Antenna parameters, EM polarization, basic antenna types, arrays, broadband antenna design and measurements. Prerequisite: ECE 350."
    },
    {
      "course_instance_id": "ECE 455 Optical Electronics G4 70772",
      "course_id": "ECE 455",
      "course_number": 455,
      "subject": "ECE",
      "title": "Optical Electronics",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Lecture",
      "section_number": "G4",
      "crn": 70772,
      "credit_hours": 4,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Optical beams and cavities; semiclassical theory of gain; characteristics of typical lasers (gas, solid state, and semiconductor); application of optical devices. Course Information: 3 undergraduate hours. 4 graduate hours.",
      "prerequisites": "ECE 350 or PHYS 436",
      "admin_notes": null,
      "topics": [
        "optical beams",
        "optical cavities",
        "laser physics",
        "semiclassical gain",
        "semiconductor lasers",
        "optical devices"
      ],
      "embedding_text": "ECE 455 Optical Electronics. Optical beams and cavities, semiclassical gain theory, characteristics of gas/solid-state/semiconductor lasers and applications of optical devices. Prerequisites: ECE 350 or PHYS 436."
    },
    {
      "course_instance_id": "ECE 461 Digital Communications A 67646",
      "course_id": "ECE 461",
      "course_number": 461,
      "subject": "ECE",
      "title": "Digital Communications",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Lecture",
      "section_number": "A",
      "crn": 67646,
      "credit_hours": 3,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Reliable communication of one bit of information over three types of channels: additive Gaussian noise, wireline, and wireless. Emphasis on the impact of bandwidth and power on the data rate and reliability, using discrete-time models. Technological examples used as case studies. Course Information: 3 undergraduate hours. 3 graduate hours.",
      "prerequisites": "ECE 210 and ECE 313",
      "admin_notes": null,
      "topics": [
        "digital communications",
        "Gaussian noise",
        "wireline channels",
        "wireless channels",
        "bandwidth-power tradeoff",
        "discrete-time models",
        "reliability"
      ],
      "embedding_text": "ECE 461 Digital Communications. Reliable communication over Gaussian noise, wireline and wireless channels; focuses on bandwidth/power impacts on data rate and reliability using discrete-time models with case studies. Prerequisites: ECE 210 and ECE 313."
    },
    {
      "course_instance_id": "ECE 467 Biophotonics A 61521",
      "course_id": "ECE 467",
      "course_number": 467,
      "subject": "ECE",
      "title": "Biophotonics",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Lecture",
      "section_number": "A",
      "crn": 61521,
      "credit_hours": 3,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Overview of the field of biophotonics, in three segments: (1) fundamental principles of light, optics, lasers, biology, and medicine; (2) diagnostic biophotonics including imaging, spectroscopy, and optical biosensors; (3) therapeutic applications of biophotonics including laser ablation and photodynamic therapies. Reviews and presentations of current scientific literature by students. Tours of microscopy facilities. Course Information: Same as BIOE 467. 3 undergraduate hours. 3 graduate hours.",
      "prerequisites": "One of ECE 455, ECE 460, PHYS 402",
      "admin_notes": null,
      "topics": [
        "biophotonics",
        "optics and lasers",
        "medical imaging",
        "spectroscopy",
        "optical biosensors",
        "photodynamic therapy",
        "microscopy"
      ],
      "embedding_text": "ECE 467 Biophotonics. Fundamentals of light/optics/lasers in biology and medicine; diagnostic imaging/spectroscopy/optical biosensors; therapeutic applications including laser ablation and photodynamic therapy; literature presentations and microscopy tours. Prerequisites: ECE 455/460 or PHYS 402."
    },
    {
      "course_instance_id": "ECE 470 Introduction to Robotics AB1 65294",
      "course_id": "ECE 470",
      "course_number": 470,
      "subject": "ECE",
      "title": "Introduction to Robotics",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Laboratory",
      "section_number": "AB1",
      "crn": 65294,
      "credit_hours": 4,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Fundamentals of robotics including rigid motions; homogeneous transformations; forward and inverse kinematics; velocity kinematics; motion planning; trajectory generation; sensing, vision; control. Course Information: Same as AE 482 and ME 445. 4 undergraduate hours. 4 graduate hours.",
      "prerequisites": "One of MATH 225, MATH 257, MATH 418",
      "admin_notes": null,
      "topics": [
        "robotics fundamentals",
        "kinematics",
        "homogeneous transformations",
        "motion planning",
        "trajectory generation",
        "robot sensing",
        "vision",
        "control"
      ],
      "embedding_text": "ECE 470 Introduction to Robotics. Rigid motions, homogeneous transformations, forward/inverse/velocity kinematics, motion planning, trajectory generation, sensing, vision and control. Prerequisites: MATH 225/257/418."
    },
    {
      "course_instance_id": "ECE 479 IoT and Cognitive Computing AB1 73609",
      "course_id": "ECE 479",
      "course_number": 479,
      "subject": "ECE",
      "title": "IoT and Cognitive Computing",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Laboratory",
      "section_number": "AB1",
      "crn": 73609,
      "credit_hours": 4,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Offers in-depth coverage on existing and emerging IoT and cognitive computing topics. Detailed topics include definition and characteristics of IoT; IoT enabling technologies; smart domains and applications; IoT systems; IoT design methodology; machine learning and deep learning; embedded GPU and FPGA for IoT; IoT servers and cloud; data analytics for IoT; cognitive computing; cognitive systems design; cognitive application workloads; IoT security; hands-on learning experience to build IoT systems; and various case studies such as smart city, smart home, and IoT for healthcare. Three lab-based machine problems working with actual IoT computing devices together with homework assignments will be given to reinforce students' understanding and learning of the techniques and topics. Course Information: 4 undergraduate hours. 4 graduate hours.",
      "prerequisites": "ECE 220 or CS 225",
      "admin_notes": null,
      "topics": [
        "Internet of Things",
        "IoT enabling technologies",
        "smart applications",
        "IoT system design",
        "machine learning",
        "embedded GPU/FPGA",
        "IoT security",
        "data analytics"
      ],
      "embedding_text": "ECE 479 IoT and Cognitive Computing. In-depth IoT and cognitive computing: enabling technologies, smart domains, design methodology, ML/DL, embedded GPU/FPGA, servers/cloud, analytics, cognitive systems, security and hands-on labs with case studies. Prerequisites: ECE 220 or CS 225."
    },
    {
      "course_instance_id": "ECE 480 Magnetic Resonance Imaging GR 78074",
      "course_id": "ECE 480",
      "course_number": 480,
      "subject": "ECE",
      "title": "Magnetic Resonance Imaging",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Lecture",
      "section_number": "GR",
      "crn": 78074,
      "credit_hours": "3 OR 4",
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Fundamental physical, mathematical, and computational principles governing the data acquisition and image reconstruction of magnetic resonance imaging. Course Information: Same as BIOE 480. 3 undergraduate hours. 3 or 4 graduate hours.",
      "prerequisites": "Recommended: ECE 310",
      "admin_notes": null,
      "topics": [
        "MRI",
        "image reconstruction",
        "data acquisition",
        "medical imaging",
        "computational methods",
        "signal physics"
      ],
      "embedding_text": "ECE 480 Magnetic Resonance Imaging. Fundamental physical, mathematical and computational principles for MRI data acquisition and image reconstruction. Recommended prerequisite: ECE 310."
    },
    {
      "course_instance_id": "ECE 481 Nanotechnology C3 54679",
      "course_id": "ECE 481",
      "course_number": 481,
      "subject": "ECE",
      "title": "Nanotechnology",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Lecture",
      "section_number": "C3",
      "crn": 54679,
      "credit_hours": 4,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Fundamental physical properties of nanoscale systems. Nanofabrication techniques, semiconductor nanotechnology, molecular and biomolecular nanotechnology, carbon nanotechnology (nanotubes and graphene), nanowires, and nanoscale architectures and systems. Course Information: 4 undergraduate hours. 4 graduate hours.",
      "prerequisites": "One of CHEM 442, CHBE 457, ME 485, MSE 401, PHYS 460",
      "admin_notes": null,
      "topics": [
        "nanoscale physics",
        "nanofabrication",
        "semiconductor nanotechnology",
        "nanotubes",
        "graphene",
        "nanowires",
        "nanoscale systems"
      ],
      "embedding_text": "ECE 481 Nanotechnology. Physical properties of nanoscale systems; nanofabrication; semiconductor, molecular/biomolecular and carbon nanotechnology (nanotubes, graphene); nanowires and nanoscale architectures. Prerequisites: CHEM 442/CHBE 457/ME 485/MSE 401/PHYS 460."
    },
    {
      "course_instance_id": "ECE 483 Analog IC Design L 33973",
      "course_id": "ECE 483",
      "course_number": 483,
      "subject": "ECE",
      "title": "Analog IC Design",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Discussion/Recitation",
      "section_number": "L",
      "crn": 33973,
      "credit_hours": 3,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Basic linear integrated circuit design techniques using bi-polar, JFET, and MOS technologies; operational amplifiers; wide-band feedback amplifiers; sinusoidal and relaxation oscillators; electric circuit noise; application of linear integrated circuits. Course Information: 3 undergraduate hours. 3 graduate hours.",
      "prerequisites": "ECE 342",
      "admin_notes": null,
      "topics": [
        "analog IC design",
        "BJT/JFET/MOS",
        "operational amplifiers",
        "feedback amplifiers",
        "oscillators",
        "circuit noise",
        "linear IC applications"
      ],
      "embedding_text": "ECE 483 Analog IC Design. Linear IC design with bipolar, JFET and MOS; op-amps, wide-band feedback amplifiers, sinusoidal/relaxation oscillators, noise and applications. Prerequisite: ECE 342."
    },
    {
      "course_instance_id": "ECE 484 Principles of Safe Autonomy AB2 76104",
      "course_id": "ECE 484",
      "course_number": 484,
      "subject": "ECE",
      "title": "Principles of Safe Autonomy",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Laboratory",
      "section_number": "AB2",
      "crn": 76104,
      "credit_hours": 4,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information。",
      "raw_description": "Introduces techniques for building autonomous systems such as autonomous cars, delivery drones, and manufacturing robots, and techniques for performing their safety analysis. Covers key algorithms and approaches in perception, modeling, motion planning, control, and safety analysis, with a view towards understanding their basic assumptions and performance guarantees. Also provides exposure to some of the state-of-the-art software tools for control, simulation, and analysis. Students will get experience through labs, programming assignments, and they will perform hands-on laboratory work on the Polaris GEM autonomous vehicle platform. Course material is distilled from recent research papers; thus, there is no required textbook. Course Information: 4 undergraduate hours. 4 graduate hours.",
      "prerequisites": "CS 124, ECE 220 or equivalent; ECE313, IE300, or STAT400. A course on data structures, algorithms, differential equations, and linear algebra is recommended.",
      "admin_notes": null,
      "topics": [
        "autonomous systems",
        "safety analysis",
        "perception",
        "motion planning",
        "control",
        "simulation tools",
        "research-paper based",
        "autonomous vehicles"
      ],
      "embedding_text": "ECE 484 Principles of Safe Autonomy. Algorithms and approaches for autonomous systems and safety analysis: perception, modeling, motion planning, control, simulation/analysis tools with labs on vehicle platform. Prerequisites: CS 124, ECE 220 or equivalent; ECE 313/IE 300/STAT 400."
    },
    {
      "course_instance_id": "ECE 486 Control Systems ABA 33976",
      "course_id": "ECE 486",
      "course_number": 486,
      "subject": "ECE",
      "title": "Control Systems",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Laboratory",
      "section_number": "ABA",
      "crn": 33976,
      "credit_hours": 4,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Analysis and design of control systems with emphasis on modeling, state variable representation, computer solutions, modern design principles, and laboratory techniques. Course Information: 4 undergraduate hours. 4 graduate hours.",
      "prerequisites": "ECE 210",
      "admin_notes": null,
      "topics": [
        "control systems",
        "system modeling",
        "state-space",
        "computer-aided analysis",
        "modern control design",
        "laboratory techniques"
      ],
      "embedding_text": "ECE 486 Control Systems. Analysis and design with emphasis on modeling, state-variable representation, computer solutions, modern design principles and lab techniques. Prerequisite: ECE 210."
    },
    {
      "course_instance_id": "ECE 488 Compound Semicond & Devices A 78081",
      "course_id": "ECE 488",
      "course_number": 488,
      "subject": "ECE",
      "title": "Compound Semicond & Devices",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Lecture",
      "section_number": "A",
      "crn": 78081,
      "credit_hours": 3,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Advanced semiconductor materials and devices; elementary band theory; heterostructures; transport issues; three-terminal devices; two-terminal devices; including lasers and light modulators. Course Information: 3 undergraduate hours. 3 graduate hours.",
      "prerequisites": "ECE 340 and ECE 350",
      "admin_notes": null,
      "topics": [
        "compound semiconductors",
        "band theory",
        "heterostructures",
        "transport",
        "lasers",
        "light modulators",
        "advanced devices"
      ],
      "embedding_text": "ECE 488 Compound Semicond & Devices. Advanced semiconductor materials and devices, band theory, heterostructures, transport, three-/two-terminal devices including lasers and light modulators. Prerequisites: ECE 340 and ECE 350."
    },
    {
      "course_instance_id": "ECE 490 Introduction to Optimization OP3 33979",
      "course_id": "ECE 490",
      "course_number": 490,
      "subject": "ECE",
      "title": "Introduction to Optimization",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Discussion/Recitation",
      "section_number": "OP3",
      "crn": 33979,
      "credit_hours": 3,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Basic theory and methods for the solution of optimization problems; iterative techniques for unconstrained minimization; linear and nonlinear programming with engineering applications. Course Information: Same as CSE 441. 3 undergraduate hours. 4 graduate hours.",
      "prerequisites": "ECE 220 and MATH 257",
      "admin_notes": null,
      "topics": [
        "optimization theory",
        "unconstrained minimization",
        "iterative methods",
        "linear programming",
        "nonlinear programming",
        "engineering applications"
      ],
      "embedding_text": "ECE 490 Introduction to Optimization. Theory and methods for optimization; iterative unconstrained minimization; linear and nonlinear programming with engineering applications. Prerequisites: ECE 220 and MATH 257."
    },
    {
      "course_instance_id": "ECE 496 Senior Research Project 0 58387",
      "course_id": "ECE 496",
      "course_number": 496,
      "subject": "ECE",
      "title": "Senior Research Project",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Independent Study",
      "section_number": "0",
      "crn": 58387,
      "credit_hours": 2,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Individual research project under the guidance of a faculty member: for example, mathematical analysis, laboratory experiments, computer simulations, software development, circuit design, or device fabrication. Preparation of a written research proposal, including preliminary results. Course Information: 2 undergraduate hours. No graduate credit. May be repeated. ECE 496 and ECE 499 taken in sequence fulfill the Advanced Composition Requirement.",
      "prerequisites": "RHET 105; consent of instructor",
      "admin_notes": "This course is intended for Honors students and Chancellor Scholars. ECE 496 and ECE 499 are approved for General Education credit only as a sequence.",
      "topics": [
        "independent research",
        "research proposal",
        "computer simulations",
        "circuit design",
        "device fabrication",
        "advanced composition sequence"
      ],
      "embedding_text": "ECE 496 Senior Research Project. Individual faculty-guided research (analysis, experiments, simulations, software, circuit design or device fabrication) with written research proposal and preliminary results. Prerequisites: RHET 105; consent of instructor."
    },
  
    {
      "course_instance_id": "ECE 498 Power Electronics Control AB3 33961",
      "course_id": "ECE 498",
      "course_number": 498,
      "subject": "ECE",
      "title": "Power Electronics Control",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Packaged Section",
      "section_number": "AB3",
      "crn": 33961,
      "credit_hours": 4,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Subject offerings of new and developing areas of knowledge in electrical and computer engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites. Course Information: 0 to 4 undergraduate hours. 0 to 4 graduate hours. May be repeated in the same or separate terms if topics vary.",
      "prerequisites": "ECE 464 (required) and ECE 486 (recommended)",
      "admin_notes": "This course aims to educate students in the detailed modeling, average-value modeling, thermal considerations, and control design of power electronic converters... final project for experience in the design, control, and simulation of power converters for an electric vehicle application.",
      "topics": [
        "power electronic converters",
        "average-value modeling",
        "thermal considerations",
        "PWM strategies",
        "controller design",
        "grid-tied applications",
        "nonlinear control",
        "EV power converters"
      ],
      "embedding_text": "ECE 498 Power Electronics Control. Detailed modeling and control of power electronic converters including average-value modeling, PWM strategies, controller design, grid-tied applications and thermal impacts with an EV-focused final project. Prerequisites: ECE 464 (required), ECE 486 (recommended)."
    },
    {
      "course_instance_id": "ECE 498 LLM Reasoning for Engineering BH3 77294",
      "course_id": "ECE 498",
      "course_number": 498,
      "subject": "ECE",
      "title": "LLM Reasoning for Engineering",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Lecture",
      "section_number": "BH3",
      "crn": 77294,
      "credit_hours": 3,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Subject offerings of new and developing areas of knowledge in electrical and computer engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites. Course Information: 0 to 4 undergraduate hours. 0 to 4 graduate hours. May be repeated in the same or separate terms if topics vary.",
      "prerequisites": null,
      "admin_notes": "This course explores the cutting-edge intersection of large language models (LLMs) and machine reasoning... students will present the latest research papers, and team up to work on course projects.",
      "topics": [
        "large language models",
        "machine reasoning",
        "engineering applications",
        "LLM evaluation",
        "LLM agents",
        "trustworthiness",
        "research papers",
        "course projects"
      ],
      "embedding_text": "ECE 498 LLM Reasoning for Engineering. Examines LLM fundamentals, reasoning capabilities and limitations, engineering applications across control, circuits, power, signals and more; discusses benchmarks and tool-integrated LLM agents with research-paper presentations and projects."
    },
    {
      "course_instance_id": "ECE 498 Concepts in Computer Org & Des RK 76192",
      "course_id": "ECE 498",
      "course_number": 498,
      "subject": "ECE",
      "title": "Concepts in Computer Org & Des",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Lecture",
      "section_number": "RK",
      "crn": 76192,
      "credit_hours": 3,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Subject offerings of new and developing areas of knowledge in electrical and computer engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites. Course Information: 0 to 4 undergraduate hours. 0 to 4 graduate hours. May be repeated in the same or separate terms if topics vary.",
      "prerequisites": "ECE 385",
      "admin_notes": "This course is an intensive introduction to the fundamentals of computer architecture... focus on ISA and microarchitecture... deepen understanding across levels.",
      "topics": [
        "computer architecture",
        "ISA",
        "microarchitecture",
        "hardware-software interface",
        "logic gate level",
        "system design fundamentals"
      ],
      "embedding_text": "ECE 498 Concepts in Computer Org & Des. Intensive introduction to computer architecture focusing on ISA and microarchitecture, bridging hardware/software interface and logic-level foundations. Prerequisite: ECE 385."
    },
    {
      "course_instance_id": "ECE 498 Model & Simulation RF Devices SR 33964",
      "course_id": "ECE 498",
      "course_number": 498,
      "subject": "ECE",
      "title": "Model & Simulation RF Devices",
      "associated_term": "Spring 2026 - Urbana-Champaign",
      "campus": "Urbana-Champaign",
      "schedule_type": "Lecture",
      "section_number": "SR",
      "crn": 33964,
      "credit_hours": 4,
      "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
      "raw_description": "Subject offerings of new and developing areas of knowledge in electrical and computer engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites. Course Information: 0 to 4 undergraduate hours. 0 to 4 graduate hours. May be repeated in the same or separate terms if topics vary.",
      "prerequisites": null,
      "admin_notes": "High Electron Mobility Transistors (HEMTs) and their applications to RF power amplification... compact model development in Verilog-A... Synopsys Sentaurus... Keysight ADS... industry standard tools and guest lectures.",
      "topics": [
        "HEMT",
        "RF power amplification",
        "compact modeling",
        "Verilog-A",
        "Sentaurus SDevice",
        "thermal behavior",
        "S-parameter analysis",
        "Keysight ADS"
      ],
      "embedding_text": "ECE 498 Model & Simulation RF Devices. Focus on HEMTs for RF power amplification; compact model development in Verilog-A; device simulation for DC/transient/S-parameter and thermal behaviors; calibration and large-scale RF simulation using industry tools."
    },

    [
      {
        "course_instance_id": "ECE 305 Quantum Systems I QS 77402",
        "course_id": "ECE 305",
        "course_number": 305,
        "subject": "ECE",
        "title": "Quantum Systems I",
        "associated_term": "Spring 2026 - Urbana-Champaign",
        "campus": "Urbana-Champaign",
        "schedule_type": "Lecture",
        "section_number": "QS",
        "crn": 77402,
        "credit_hours": 3,
        "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
        "raw_description": "Introduces the basic principles of quantum mechanics and its applications in quantum information science. The experimental and mathematical concepts of quantum mechanics are introduced in terms of quantum bits, or qubits, and the students will learn how qubits are used for computing and communication. Topics include: wave-particle duality, interferometry and quantum sensing, spin systems, atomic transitions and Rabi Oscillations, bra/ket notation, quantum communication and entanglement, quantum computation and algorithms, and continuous systems.",
        "prerequisites": "MATH 257 and PHYS 214, or junior standing.",
        "admin_notes": null,
        "topics": [
          "quantum mechanics",
          "quantum information",
          "qubits",
          "wave-particle duality",
          "interferometry",
          "quantum sensing",
          "entanglement",
          "quantum computation"
        ],
        "embedding_text": "ECE 305 Quantum Systems I. Basic principles of quantum mechanics and quantum information science using qubits; topics include wave-particle duality, interferometry, quantum sensing, spin systems, atomic transitions, quantum communication, entanglement and quantum algorithms. Prerequisite: MATH 257 and PHYS 214, or junior standing."
      },
      {
        "course_instance_id": "ECE 310 Digital Signal Processing CSP 70980",
        "course_id": "ECE 310",
        "course_number": 310,
        "subject": "ECE",
        "title": "Digital Signal Processing",
        "associated_term": "Spring 2026 - Urbana-Champaign",
        "campus": "Urbana-Champaign",
        "schedule_type": "Online Lecture",
        "section_number": "CSP",
        "crn": 70980,
        "credit_hours": 3,
        "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
        "raw_description": "Introduction to discrete-time systems and discrete-time signal processing with an emphasis on causal systems; discrete-time linear systems, difference equations, z-transforms, discrete convolution, stability, discrete-time Fourier transforms, analog-to-digital and digital-to-analog conversion, digital filter design, discrete Fourier transforms, fast Fourier transforms, spectral analysis, and applications of digital signal processing. Credit is not given towards graduation for both ECE 310 and ECE 401.",
        "prerequisites": "ECE 210.",
        "admin_notes": "This section is intended for Chicago City Scholars only. There may be online and in person components. You are responsible for completing homework, quizzes, and any in person activities that are required. In-person meeting in Classroom B at 200 S. Wacker Dr. Chicago.",
        "topics": [
          "digital signal processing",
          "discrete-time systems",
          "z-transform",
          "convolution",
          "Fourier transform",
          "digital filter design",
          "FFT",
          "spectral analysis"
        ],
        "embedding_text": "ECE 310 Digital Signal Processing. Discrete-time systems and signal processing for causal systems, including difference equations, z-transforms, convolution, discrete-time Fourier transforms, A/D and D/A conversion, digital filter design, FFT and spectral analysis. Prerequisite: ECE 210."
      },
      {
        "course_instance_id": "ECE 313 Probability with Engrg Applic A 48244",
        "course_id": "ECE 313",
        "course_number": 313,
        "subject": "ECE",
        "title": "Probability with Engrg Applic",
        "associated_term": "Spring 2026 - Urbana-Champaign",
        "campus": "Urbana-Champaign",
        "schedule_type": "Discussion/Recitation",
        "section_number": "A",
        "crn": 48244,
        "credit_hours": 3,
        "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
        "raw_description": "Probability theory with applications to engineering problems such as the reliability of circuits and systems to statistical methods for hypothesis testing, decision making under uncertainty, and parameter estimation. Same as MATH 362. Credit is not given for both ECE 313 and MATH 461.",
        "prerequisites": "MATH 257 or MATH 416.",
        "admin_notes": null,
        "topics": [
          "probability theory",
          "engineering applications",
          "reliability",
          "hypothesis testing",
          "decision making under uncertainty",
          "parameter estimation",
          "statistics"
        ],
        "embedding_text": "ECE 313 Probability with Engrg Applic. Probability theory for engineering applications including reliability, hypothesis testing, decision making under uncertainty and parameter estimation. Prerequisites: MATH 257 or MATH 416."
      },
      {
        "course_instance_id": "ECE 314 Probability in Engineering Lab A 65511",
        "course_id": "ECE 314",
        "course_number": 314,
        "subject": "ECE",
        "title": "Probability in Engineering Lab",
        "associated_term": "Spring 2026 - Urbana-Champaign",
        "campus": "Urbana-Champaign",
        "schedule_type": "Laboratory",
        "section_number": "A",
        "crn": 65511,
        "credit_hours": 1,
        "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
        "raw_description": "Designed to be taken concurrently with ECE 313, Probability in Engineering Systems, to strengthen the students' understanding of the concepts in ECE 313 and their applications, through computer simulation and computation using the Python programming language. Topics include sequential hypothesis testing, parameter estimation, confidence intervals, Bloom filters, min hashing, load balancing, inference for Markov chains, PageRank algorithm, vector Gaussian distribution, contagion in networks, principal component method and linear regression for data analysis, investment portfolio analysis.",
        "prerequisites": "Concurrent enrollment in ECE 313 or credit in one of: ECE 313, IE 300, STAT 410.",
        "admin_notes": null,
        "topics": [
          "probability lab",
          "Python simulation",
          "sequential hypothesis testing",
          "Bloom filters",
          "Markov chains",
          "PageRank",
          "Gaussian distribution",
          "linear regression",
          "portfolio analysis"
        ],
        "embedding_text": "ECE 314 Probability in Engineering Lab. Lab course to reinforce ECE 313 concepts via Python simulations, covering hypothesis testing, estimation, Bloom filters, Markov chains, PageRank, Gaussian vectors, PCA, regression and portfolio analysis. Prerequisite: concurrent ECE 313 or credit in ECE 313/IE 300/STAT 410."
      },
      {
        "course_instance_id": "ECE 316 Ethics and Engineering E1 32661",
        "course_id": "ECE 316",
        "course_number": 316,
        "subject": "ECE",
        "title": "Ethics and Engineering",
        "associated_term": "Spring 2026 - Urbana-Champaign",
        "campus": "Urbana-Champaign",
        "schedule_type": "Lecture",
        "section_number": "E1",
        "crn": 32661,
        "credit_hours": 3,
        "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
        "raw_description": "Ethical issues in the practice of engineering: safety and liability, professional responsibility to clients and employers, whistle-blowing, codes of ethics, career choice, and legal obligations. Philosophical analysis of normative ethical theories. Case studies. Same as PHIL 316. Credit is not given for both ECE 316 and either CS 210 or CS 211. Junior standing is required.",
        "prerequisites": "RHET 105.",
        "admin_notes": null,
        "topics": [
          "engineering ethics",
          "safety and liability",
          "professional responsibility",
          "whistle-blowing",
          "codes of ethics",
          "ethical theories",
          "case studies"
        ],
        "embedding_text": "ECE 316 Ethics and Engineering. Ethical issues in engineering practice including safety, liability, professional responsibility, whistle-blowing, codes of ethics and legal obligations, with philosophical analysis and case studies. Prerequisite: RHET 105; junior standing."
      },
      {
        "course_instance_id": "ECE 329 Fields and Waves I X 32668",
        "course_id": "ECE 329",
        "course_number": 329,
        "subject": "ECE",
        "title": "Fields and Waves I",
        "associated_term": "Spring 2026 - Urbana-Champaign",
        "campus": "Urbana-Champaign",
        "schedule_type": "Discussion/Recitation",
        "section_number": "X",
        "crn": 32668,
        "credit_hours": 3,
        "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
        "raw_description": "Electromagnetic fields and waves fundamentals and their engineering applications: static electric and magnetic fields; energy storage; Maxwell's equations for time-varying fields; wave solutions in free space, dielectrics and conducting media, transmission line systems; time- and frequency-domain analysis of transmission line circuits and Smith chart applications.",
        "prerequisites": "ECE 210.",
        "admin_notes": null,
        "topics": [
          "electromagnetic fields",
          "Maxwell's equations",
          "waves in media",
          "transmission lines",
          "Smith chart",
          "time-domain analysis",
          "frequency-domain analysis"
        ],
        "embedding_text": "ECE 329 Fields and Waves I. Fundamentals of EM fields and waves including static fields, energy storage, Maxwell's equations, wave solutions in various media and transmission line analysis with Smith charts. Prerequisite: ECE 210."
      },
      {
        "course_instance_id": "ECE 330 Power Ckts & Electromechanics C 56899",
        "course_id": "ECE 330",
        "course_number": 330,
        "subject": "ECE",
        "title": "Power Ckts & Electromechanics",
        "associated_term": "Spring 2026 - Urbana-Champaign",
        "campus": "Urbana-Champaign",
        "schedule_type": "Discussion/Recitation",
        "section_number": "C",
        "crn": 56899,
        "credit_hours": 3,
        "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
        "raw_description": "Network equivalents; power and energy fundamentals, resonance, mutual inductance; three-phase power concepts, forces and torques of electric origin in electromagnetic and electrostatic systems; energy conversion cycles; principles of electric machines; transducers; relays; laboratory demonstration.",
        "prerequisites": "ECE 210.",
        "admin_notes": null,
        "topics": [
          "power circuits",
          "three-phase power",
          "mutual inductance",
          "electric machines",
          "energy conversion",
          "electromechanics",
          "transducers",
          "relays"
        ],
        "embedding_text": "ECE 330 Power Ckts & Electromechanics. Power and energy fundamentals, resonance, mutual inductance, three-phase power, forces and torques, energy conversion cycles, electric machines, transducers and relays with lab demos. Prerequisite: ECE 210."
      },
      {
        "course_instance_id": "ECE 333 Green Electric Energy B 52523",
        "course_id": "ECE 333",
        "course_number": 333,
        "subject": "ECE",
        "title": "Green Electric Energy",
        "associated_term": "Spring 2026 - Urbana-Champaign",
        "campus": "Urbana-Champaign",
        "schedule_type": "Lecture",
        "section_number": "B",
        "crn": 52523,
        "credit_hours": 3,
        "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
        "raw_description": "Electric power grid structure and policy; analysis of wind, solar, and fuels as raw resources; wind turbines and parks; solar cells, modules, arrays and systems; fuel cell power plants; energy and financial performance of green energy projects; integration of green energy into power grid; energy project report and presentation.",
        "prerequisites": "ECE 205 or ECE 210.",
        "admin_notes": null,
        "topics": [
          "electric power grid",
          "renewable energy",
          "wind turbines",
          "solar cells",
          "fuel cells",
          "green energy integration",
          "energy economics"
        ],
        "embedding_text": "ECE 333 Green Electric Energy. Covers power grid structure and policy, wind and solar resources, fuel cell plants, energy and financial performance of green projects and integration into the grid, with an energy project report and presentation. Prerequisite: ECE 205 or ECE 210."
      },
      {
        "course_instance_id": "ECE 340 Semiconductor Electronics A 56893",
        "course_id": "ECE 340",
        "course_number": 340,
        "subject": "ECE",
        "title": "Semiconductor Electronics",
        "associated_term": "Spring 2026 - Urbana-Champaign",
        "campus": "Urbana-Champaign",
        "schedule_type": "Discussion/Recitation",
        "section_number": "A",
        "crn": 56893,
        "credit_hours": 3,
        "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
        "raw_description": "Modern device electronics: semiconductor fundamentals including crystals and energy bands, charge carriers (electrons and holes), doping, and transport (drift and diffusion); unipolar devices with the MOS field effect transistor as a logic device and circuit considerations; basic concepts of generation-recombination and the P-N junction as capacitors and current rectifier with applications in photonics; bipolar transistors as amplifiers and switching three-terminal devices.",
        "prerequisites": "(ECE 205 or ECE 210) and PHYS 214.",
        "admin_notes": null,
        "topics": [
          "semiconductor fundamentals",
          "energy bands",
          "charge carriers",
          "MOSFET",
          "PN junction",
          "generation-recombination",
          "bipolar transistors",
          "device transport"
        ],
        "embedding_text": "ECE 340 Semiconductor Electronics. Modern device electronics including semiconductor fundamentals, carrier transport, MOSFET logic devices, PN junctions and bipolar transistors for amplification and switching. Prerequisites: (ECE 205 or ECE 210) and PHYS 214."
      },
      {
        "course_instance_id": "ECE 342 Electronic Circuits C 56912",
        "course_id": "ECE 342",
        "course_number": 342,
        "subject": "ECE",
        "title": "Electronic Circuits",
        "associated_term": "Spring 2026 - Urbana-Champaign",
        "campus": "Urbana-Champaign",
        "schedule_type": "Lecture",
        "section_number": "C",
        "crn": 56912,
        "credit_hours": 3,
        "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
        "raw_description": "Analysis and design of analog and digital electronic circuits using MOS field effect transistors and bipolar junction transistors, with emphasis on amplifiers in integrated circuits. Credit is not given for both ECE 342 and PHYS 404.",
        "prerequisites": "ECE 210.",
        "admin_notes": null,
        "topics": [
          "analog circuits",
          "digital circuits",
          "MOSFET",
          "BJT",
          "amplifiers",
          "integrated circuits",
          "circuit design"
        ],
        "embedding_text": "ECE 342 Electronic Circuits. Analysis and design of analog and digital circuits using MOSFETs and BJTs with emphasis on integrated-circuit amplifiers. Prerequisite: ECE 210."
      },
      {
        "course_instance_id": "ECE 350 Fields and Waves II X 56911",
        "course_id": "ECE 350",
        "course_number": 350,
        "subject": "ECE",
        "title": "Fields and Waves II",
        "associated_term": "Spring 2026 - Urbana-Champaign",
        "campus": "Urbana-Champaign",
        "schedule_type": "Discussion/Recitation",
        "section_number": "X",
        "crn": 56911,
        "credit_hours": 3,
        "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
        "raw_description": "Continuation of ECE 329: radiation theory; antennas, radiation fields, radiation resistance and gain; transmitting arrays; plane-wave approximation of radiation fields; plane-wave propagation, reflection, and transmission; Doppler effect, evanescent waves and tunneling, dispersion, phase and group velocities; waveguides and resonant cavities; antenna reception and link budgets.",
        "prerequisites": "ECE 329.",
        "admin_notes": null,
        "topics": [
          "radiation theory",
          "antennas",
          "plane waves",
          "reflection and transmission",
          "Doppler effect",
          "waveguides",
          "resonant cavities",
          "link budgets"
        ],
        "embedding_text": "ECE 350 Fields and Waves II. Continuation of ECE 329 covering radiation theory, antennas, plane waves, reflection/transmission, Doppler, dispersion, waveguides, resonant cavities and link budgets. Prerequisite: ECE 329."
      },
      {
        "course_instance_id": "ECE 364 Programming Methods for ML CSP 77448",
        "course_id": "ECE 364",
        "course_number": 364,
        "subject": "ECE",
        "title": "Programming Methods for ML",
        "associated_term": "Spring 2026 - Urbana-Champaign",
        "campus": "Urbana-Champaign",
        "schedule_type": "Online Lecture",
        "section_number": "CSP",
        "crn": 77448,
        "credit_hours": 3,
        "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
        "raw_description": "Focuses on auto-differentiation tools like PyTorch used with basic machine learning algorithms (linear regression, logistic regression, deep nets, k-means clustering), and extensions in custom methods to fit specific needs. Auto-differentiation tools are essential for data analysis and a solid understanding is increasingly important in many disciplines. In contrast to existing courses which focus on algorithmic and theoretical aspects of Machine Learning, the focus here is on implementation with auto-diff tools.",
        "prerequisites": "MATH 257.",
        "admin_notes": null,
        "topics": [
          "machine learning programming",
          "auto-differentiation",
          "PyTorch",
          "linear regression",
          "logistic regression",
          "deep neural networks",
          "k-means clustering",
          "data analysis"
        ],
        "embedding_text": "ECE 364 Programming Methods for ML. Implementation-focused course on auto-differentiation tools such as PyTorch with basic ML algorithms (regression, deep nets, clustering) and their extensions for practical data analysis. Prerequisite: MATH 257."
      },
      {
        "course_instance_id": "ECE 385 Digital Systems Laboratory AL1 32782",
        "course_id": "ECE 385",
        "course_number": 385,
        "subject": "ECE",
        "title": "Digital Systems Laboratory",
        "associated_term": "Spring 2026 - Urbana-Champaign",
        "campus": "Urbana-Champaign",
        "schedule_type": "Packaged Section",
        "section_number": "AL1",
        "crn": 32782,
        "credit_hours": 3,
        "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
        "raw_description": "Design, build, and test digital systems using transistor-transistor logic (TTL), SystemVerilog, and field-programmable gate arrays (FPGAs). Topics include combinational and sequential logic, storage elements, input/output and display, timing analysis, design tradeoffs, synchronous and asynchronous design methods, datapath and controller, microprocessor design, software/hardware co-design, and system-on-a-chip.",
        "prerequisites": "ECE 110 and ECE 220.",
        "admin_notes": "Students must register for one lab and one lecture section.",
        "topics": [
          "digital systems design",
          "TTL",
          "SystemVerilog",
          "FPGA",
          "combinational logic",
          "sequential logic",
          "microprocessor design",
          "hardware-software co-design",
          "system-on-a-chip"
        ],
        "embedding_text": "ECE 385 Digital Systems Laboratory. Lab course to design, build and test digital systems using TTL, SystemVerilog and FPGAs, covering combinational/sequential logic, datapaths, controllers, microprocessor design and hardware/software co-design. Prerequisites: ECE 110 and ECE 220."
      },
      {
        "course_instance_id": "ECE 391 Computer Systems Engineering AD4 57948",
        "course_id": "ECE 391",
        "course_number": 391,
        "subject": "ECE",
        "title": "Computer Systems Engineering",
        "associated_term": "Spring 2026 - Urbana-Champaign",
        "campus": "Urbana-Champaign",
        "schedule_type": "Discussion/Recitation",
        "section_number": "AD4",
        "crn": 57948,
        "credit_hours": 4,
        "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
        "raw_description": "Concepts and abstractions central to the development of modern computing systems, with an emphasis on the systems software that controls interaction between devices and other hardware and application programs. Input-output semantics; synchronization; interrupts; multitasking; virtualization of abstractions. Term-based projects. Credit is not given for both ECE 391 and either CS 341 or CS 241.",
        "prerequisites": "ECE 220 or CS 233.",
        "admin_notes": null,
        "topics": [
          "computer systems",
          "systems software",
          "I/O semantics",
          "synchronization",
          "interrupts",
          "multitasking",
          "virtualization"
        ],
        "embedding_text": "ECE 391 Computer Systems Engineering. Central concepts and abstractions in modern computing systems with emphasis on systems software, including I/O semantics, synchronization, interrupts, multitasking and virtualization; term-based projects. Prerequisite: ECE 220 or CS 233."
      },
      {
        "course_instance_id": "ECE 395 Advanced Digital Projects Lab A 32766",
        "course_id": "ECE 395",
        "course_number": 395,
        "subject": "ECE",
        "title": "Advanced Digital Projects Lab",
        "associated_term": "Spring 2026 - Urbana-Champaign",
        "campus": "Urbana-Champaign",
        "schedule_type": "Packaged Section",
        "section_number": "A",
        "crn": 32766,
        "credit_hours": "2 OR 3",
        "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
        "raw_description": "Planning, designing, executing, and documenting a microcomputer-based project. Emphasis on hardware but special projects may require an equal emphasis on software. May be repeated in separate terms.",
        "prerequisites": "ECE 385.",
        "admin_notes": null,
        "topics": [
          "digital project lab",
          "microcomputer-based systems",
          "hardware design",
          "project planning",
          "project documentation",
          "embedded systems"
        ],
        "embedding_text": "ECE 395 Advanced Digital Projects Lab. Planning, design, execution and documentation of microcomputer-based projects, with emphasis on hardware and possible significant software components. Prerequisite: ECE 385."
      },
      {
        "course_instance_id": "ECE 398 Fields and Waves VR Lab RI2 44438",
        "course_id": "ECE 398",
        "course_number": 398,
        "subject": "ECE",
        "title": "Fields and Waves VR Lab",
        "associated_term": "Spring 2026 - Urbana-Champaign",
        "campus": "Urbana-Champaign",
        "schedule_type": "Laboratory",
        "section_number": "RI2",
        "crn": 44438,
        "credit_hours": 1,
        "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
        "raw_description": "Subject offerings of new and developing areas of knowledge in electrical and computer engineering intended to augment the existing curriculum. Approved for both letter and S/U grading. May be repeated in the same or separate terms if topics vary.",
        "prerequisites": null,
        "admin_notes": "See Class Schedule or departmental course information for specific topics and prerequisites.",
        "topics": [
          "fields and waves",
          "VR laboratory",
          "experimental ECE topics",
          "emerging curriculum",
          "hands-on learning"
        ],
        "embedding_text": "ECE 398 Fields and Waves VR Lab. Laboratory in new and developing topics related to fields and waves using VR-based or other experimental approaches; content varies by term."
      },
      {
        "course_instance_id": "ECE 205 Electrical & Electronic Ckts AB3 65805",
        "course_id": "ECE 205",
        "course_number": 205,
        "subject": "ECE",
        "title": "Electrical & Electronic Ckts",
        "associated_term": "Spring 2026 - Urbana-Champaign",
        "campus": "Urbana-Champaign",
        "schedule_type": "Laboratory",
        "section_number": "AB3",
        "crn": 65805,
        "credit_hours": 3,
        "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
        "raw_description": "ECE 205 is an introductory course on circuit analysis and electronics for non-majors in engineering. The course includes bi-weekly electronics lab experiments designed to provide students with hands-on experience. Basic principles of circuit analysis and DC circuits; time-domain analysis of 1st and 2nd order linear circuits; complex numbers, phasors, AC steady-state analysis; frequency response; op-amp, diode, and BJT circuits; logic gates and digital logic circuits. Credit is not given to Computer or Electrical Engineering majors.",
        "prerequisites": "PHYS 212.",
        "admin_notes": "Students must register for one lecture and one lab. Credit is not given to Computer or Electrical Engineering majors.",
        "topics": [
          "circuit analysis",
          "DC circuits",
          "AC steady-state",
          "frequency response",
          "op-amp circuits",
          "diode and BJT circuits",
          "digital logic",
          "introductory electronics"
        ],
        "embedding_text": "ECE 205 Electrical & Electronic Ckts. Introductory circuit analysis and electronics for non-majors including DC and AC circuits, frequency response, op-amps, diodes, BJTs and digital logic, with bi-weekly labs. Prerequisite: PHYS 212."
      },
      {
        "course_instance_id": "ECE 206 Electrical & Electronics Lab F1 32485",
        "course_id": "ECE 206",
        "course_number": 206,
        "subject": "ECE",
        "title": "Electrical & Electronics Lab",
        "associated_term": "Spring 2026 - Urbana-Champaign",
        "campus": "Urbana-Champaign",
        "schedule_type": "Laboratory",
        "section_number": "F1",
        "crn": 32485,
        "credit_hours": 1,
        "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
        "raw_description": "Laboratory experiments in digital logic and controllers; transistor amplifier and switching circuits; DC motor control and voltage regulators; sensors and motion control with feedback; wireless communication. Credit is not given to Computer or Electrical Engineering majors.",
        "prerequisites": "ECE 205.",
        "admin_notes": null,
        "topics": [
          "electronics lab",
          "digital logic experiments",
          "amplifier circuits",
          "motor control",
          "voltage regulators",
          "sensors",
          "feedback control",
          "wireless communication"
        ],
        "embedding_text": "ECE 206 Electrical & Electronics Lab. Laboratory experiments covering digital logic, transistor amplifiers, switching circuits, DC motor control, sensors, feedback and wireless communication. Prerequisite: ECE 205."
      },
      {
        "course_instance_id": "ECE 210 Analog Signal Processing AB4 74918",
        "course_id": "ECE 210",
        "course_number": 210,
        "subject": "ECE",
        "title": "Analog Signal Processing",
        "associated_term": "Spring 2026 - Urbana-Champaign",
        "campus": "Urbana-Champaign",
        "schedule_type": "Laboratory",
        "section_number": "AB4",
        "crn": 74918,
        "credit_hours": 4,
        "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
        "raw_description": "Analog signal processing, with an emphasis on underlying concepts from circuit and system analysis: linear systems; review of elementary circuit analysis; differential equation models of linear circuits and systems; Laplace transform; convolution; stability; phasors; frequency response; Fourier series; Fourier transform; active filters; AM radio. Credit is not given for both ECE 210 and ECE 211.",
        "prerequisites": "ECE 110 and PHYS 212; credit or concurrent registration in MATH 285 or MATH 286.",
        "admin_notes": "Students must register for one lab and one lecture section.",
        "topics": [
          "analog signal processing",
          "linear systems",
          "Laplace transform",
          "convolution",
          "frequency response",
          "Fourier series",
          "Fourier transform",
          "active filters",
          "AM radio"
        ],
        "embedding_text": "ECE 210 Analog Signal Processing. Analog signal processing using circuit and system analysis, including linear systems, Laplace transforms, convolution, frequency response, Fourier series/transform, active filters and AM radio. Prerequisites: ECE 110 and PHYS 212; MATH 285 or 286 (credit or concurrent)."
      },
      {
        "course_instance_id": "ECE 211 Analog Circuits & Systems B 32581",
        "course_id": "ECE 211",
        "course_number": 211,
        "subject": "ECE",
        "title": "Analog Circuits & Systems",
        "associated_term": "Spring 2026 - Urbana-Champaign",
        "campus": "Urbana-Champaign",
        "schedule_type": "Lecture",
        "section_number": "B",
        "crn": 32581,
        "credit_hours": 2,
        "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
        "raw_description": "Concepts from circuit and system analysis: linear systems; review of elementary circuit analysis; op amps; transient analysis; differential equation models of linear circuits and systems; Laplace transform. Credit is not given for both ECE 211 and ECE 210.",
        "prerequisites": "ECE 110 and PHYS 212; credit or concurrent registration in MATH 285 or MATH 286.",
        "admin_notes": null,
        "topics": [
          "analog circuits",
          "linear systems",
          "op amps",
          "transient analysis",
          "differential equation models",
          "Laplace transform"
        ],
        "embedding_text": "ECE 211 Analog Circuits & Systems. Circuit and system analysis concepts including linear systems, op amps, transient analysis, differential equation models and Laplace transforms. Prerequisites: ECE 110 and PHYS 212; MATH 285 or 286 (credit or concurrent)."
      },
      {
        "course_instance_id": "ECE 220 Computer Systems & Programming BD4 61639",
        "course_id": "ECE 220",
        "course_number": 220,
        "subject": "ECE",
        "title": "Computer Systems & Programming",
        "associated_term": "Spring 2026 - Urbana-Champaign",
        "campus": "Urbana-Champaign",
        "schedule_type": "Discussion/Recitation",
        "section_number": "BD4",
        "crn": 61639,
        "credit_hours": 4,
        "grade_mode": "No Section specified grade mode, please see Catalog link below for more information.",
        "raw_description": "Advanced use of LC-3 assembly language for I/O and function calling convention. C programming, covering basic programming concepts, functions, arrays, pointers, I/O, recursion, simple data structures, linked lists, dynamic memory management, and basic algorithms. Information hiding and object-oriented design as commonly implemented in modern software and computer systems programming.",
        "prerequisites": "ECE 120. Restricted to Computer Engineering or Electrical Engineering majors or transfer students with ECE Department consent.",
        "admin_notes": null,
        "topics": [
          "LC-3 assembly",
          "C programming",
          "functions and arrays",
          "pointers",
          "data structures",
          "linked lists",
          "dynamic memory",
          "object-oriented design",
          "computer systems programming"
        ],
        "embedding_text": "ECE 220 Computer Systems & Programming. Advanced LC-3 assembly for I/O and calling conventions plus C programming including functions, arrays, pointers, recursion, basic data structures, dynamic memory and object-oriented design in systems programming. Prerequisite: ECE 120; restricted to CE/EE majors or approved transfers."
      }
    ]
  ]
  
  
